Repository: zhangjiangen11/godot
Catalog: editor/translations/editor/*.po
Languages: hu

source: Animation tracks can only point to AnimationPlayer nodes.
hu: Animáció sávok csak AnimationPlayer node-ra mutathatnak.

source: Not possible to add a new track without a root
hu: Új sáv hozzáadása nem lehetséges gyökér nélkül

source: Invalid track for Bezier (no suitable sub-properties)
hu: Érvénytelen sáv Bezier számára (nincs megfelelő al-tulajdonság)

source: Add Bezier Track
hu: Beizer Sáv Hozzáadása

source: Track path is invalid, so can't add a key.
hu: Sáv elérési útja helytelen, kulcs hozzáadása nem lehetséges.

source: Track path is invalid, so can't add a method key.
hu: Sáv elérési útja helytelen, kulcs hozzáadása nem lehetséges.

source: Add Method Track Key
hu: Metódus Sáv Kulcs Hozzáadása

source: Method not found in object:
hu: A metódus nem található az objektumban:

source: Animation Move Keys
hu: Animáció - Kulcsok Mozgatása

source: Position
hu: Pozíció

source: Rotation
hu: Forgatás

source: Scale
hu: Skála

source: Methods
hu: Metódusok

source: Bezier
hu: Bézier

source: Audio
hu: Hang

source: Clipboard is empty!
hu: A vágólap üres!

source: Paste Tracks
hu: Sávok beillesztése

source: Make Easing Keys
hu: Átmenet Kulcsok Létrehozása

source: Create Node
hu: Node létrehozás

source: Some AnimationPlayerEditor's options are disabled since this is the dummy AnimationPlayer for preview. The dummy player is forced active, non-deterministic and doesn't have the root motion track. Furthermore, the original node is inactive temporary.
hu: Néhány AnimationPlayerEditor opció nem elérhető, mert ez a "hamis" AnimationPlayer előnézete. A "hamis" lejátszó kényszerítetten aktív, nem-determinisztikus és nincs benne a gyökér sáv. Továbbá az eredeti node ideiglenesen ki van kapcsolva.

source: AnimationPlayer is inactive. The playback will not be processed.
hu: Az AnimationPlayer ki van kapcsolva. A lejátszás nem lesz feldolgozva.

source: Select an AnimationPlayer node to create and edit animations.
hu: Válasszon egy AnimationPlayer node-ot az animációk létrehozásához és szerkesztéséhez.

source: Warning: Editing imported animation
hu: Figyelmeztetés: Importált animáció szerkesztése

source: Dummy Player
hu: "Hamis" Lejátszó

source: Warning: AnimationPlayer is inactive
hu: Figyelmeztetés: Az AnimationPlayer ki van kapcsolva

source: Toggle between the bezier curve editor and track editor.
hu: A bézier görbe szerkesztő és a sávszerkesztő között vált.

source: Toggle function names in the track editor.
hu: A sávszerkesztőbeli függvényneveket kapcsolja.

source: Only show tracks from nodes selected in tree.
hu: Csak a fában kiválosztott node-ok sávjainak megjelenítése.

source: Sort tracks/groups alphabetically. If disabled, tracks are shown in the order they are added and can be reordered using drag-and-drop.
hu: Sávok/csoportok betűrendbe rendezése. Kikapcsolt állapotban a sávok a hozzáadásuk sorrendjében jelennek meg és húzd-és-vidd módszerrel rendezhetőek.

source: Group tracks by node or display them as plain list.
hu: Sávok csoportosítása node-ok szerint, vagy megjelenítés egyszerű listaként.

source: Apply snapping to timeline cursor.
hu: Idővonal kurzorjához igazítás.

source: Apply snapping to the nearest integer FPS.
hu: A legközelebbi egész számú FPS-re igazítás.

source: Animation step value.
hu: Animáció lépés értéke.

source: Seconds
hu: Másodperc

source: Auto Fit Bezier
hu: Auto Bézier Igazítás

source: Edit
hu: Szerkesztés

source: Animation properties.
hu: Animáció tulajdonságok.

source: Set Start Offset (Audio)
hu: Kezdeti Eltolás Beállítása (Audió)

source: Set End Offset (Audio)
hu: Végeltolás Beállítása (Audió)

source: Move First Selected Key to Cursor
hu: Először Kijelölt Kulcs Kurzorhoz Mozgatása

source: Move Last Selected Key to Cursor
hu: Utoljára Kijelölt Kulcs Kurzorhoz Mozgatása

source: Delete Selection
hu: Kijelölés Törlése

source: Go to Next Step
hu: Ugrás a Következő Lépésre

source: Go to Previous Step
hu: Ugrás az Előző Lépésre

source: Add tracks to RESET
hu: Sávok RESET-hez adása

source: Use Bezier Curves
hu: Bézier görbék használata

source: Optimize
hu: Optimalizálás

source: Trim keys placed in negative time
hu: Negatív idejű kulcsok levágása

source: Trim keys placed exceed the animation length
hu: Az animáció hosszánál későbbi kulcsok levágása

source: Remove invalid keys
hu: Érvénytelen kulcsok eltávolítása

source: Remove unresolved and empty tracks
hu: Megoldatlan és üres nyomvonalak eltávolítása

source: Clean-up all animations
hu: Összes animáció tisztítása

source: Clean-Up Animation(s) (NO UNDO!)
hu: Animáció(k) Tisztítása (NEM VISSZAVONHATÓ!)

source: Clean-Up
hu: Tisztítás

source: Scale Ratio:
hu: Méretezési arány:

source: Select Transition and Easing
hu: Áttűnés és Átmenet Kiválasztása

source: Transition Type:
hu: Átmenet Típus:

# Transition Type
source: Sine
hu: Szinusz

# Transition Type
source: Quint
hu: Kvint

# Transition Type
source: Quart
hu: Kvart

# Transition Type
source: Quad
hu: Kvad

# Transition Type
source: Elastic
hu: Elasztikus

# Transition Type
source: Circ
hu: Kör

# Transition Type
source: Bounce
hu: Ugráló

# Transition Type
source: Spring
hu: Rugós

# Ease Type
source: Ease Out
hu: Lassító

# Ease Type
source: Ease In-Out
hu: Gyorsító-és-Lassuló

# Ease Type
source: Ease Out-In
hu: Lassuló-és-Gyorsító

source: Select Tracks to Copy
hu: Másolandó nyomvonalak kiválasztása

source: Select All/None
hu: Összes/semmi kijelölése

source: Copy Selection
hu: Kijelölés másolása

source: Marker name is read-only in the inspector.
hu: A jelző neve az elemzőben csak-olvasható.

source: A marker's name can only be changed by right-clicking it in the animation editor and selecting "Rename Marker", in order to make sure that marker names are all unique.
hu: A jelzőnevek egyediségének érdekében egy jelző nevét csak az animáció szerkesztőben jobb klikk után a "Jelző Átnevezése" menüponttal lehet módosítani.

source: Show All Marker Names
hu: Minden Jelzőnév Mutatása

source: Marker:
hu: Jelző:

source: Empty marker names are not allowed.
hu: Üres jelzőnevek nem megengedettek.

source: Multi Edit Marker Color
hu: Több Jelző Színének Módosítása

source: Add Audio Track Clip
hu: Hangsávklip hozzáadása

source: Change Audio Track Clip Start Offset
hu: Hangsáv klip eltolt kezdési idejének módosítása

source: Change Audio Track Clip End Offset
hu: Hangsáv klip eltolt befejezési idejének módosítása

source: Root
hu: Gyökér

source: Path:
hu: Útvonal:

source: Title
hu: Cím

source: License
hu: Licenc

source: Version:
hu: Verzió:

source: Contents:
hu: Tartalom:

source: View Files
hu: Fájlok Megtekintése

source: Description:
hu: Leírás:

source: Download
hu: Letöltés

source: Connection error, please try again.
hu: Kapcsolat hiba, kérjük próbálja meg újra.

source: Can't connect.
hu: Nem lehet csatlakozni.

source: Can't connect to host:
hu: Nem lehet csatlakozni a kiszolgálóhoz:

source: No response from host:
hu: Nincs válasz a kiszolgálótól:

source: No response.
hu: Nincs válasz.

source: Can't resolve hostname:
hu: A gazdagép neve nem oldható meg:

source: Can't resolve.
hu: Nem megoldható.

source: Request failed, return code:
hu: Kérés sikertelen, visszatérési kód:

source: Request failed.
hu: A kérés sikertelen.

source: Cannot save response to:
hu: A válasz nem menthető:

source: Write error.
hu: Írási hiba.

source: Request failed, too many redirects
hu: Kérés sikertelen, túl sok átirányítás

source: Redirect loop.
hu: Ciklus átirányítása.

source: Request failed, timeout
hu: A kérés nem sikerült, időtúllépés

source: Timeout.
hu: Időtúllépés.

source: Failed:
hu: Sikertelen:

source: Bad download hash, assuming file has been tampered with.
hu: Rossz letöltési hash, a program feltételezi, hogy a fájlt rosszindulatilag módosították.

source: Got:
hu: Kapott:

source: Failed SHA-256 hash check
hu: SHA-256 hash ellenőrzés megbukot

source: Asset Download Error:
hu: Eszköz Letöltési Hiba:

source: Ready to install!
hu: Telepítésre kész!

source: Downloading (%s / %s)...
hu: Letöltés (%s / %s)...

source: Downloading...
hu: Letöltés...

source: Resolving...
hu: Megoldás...

source: Connecting...
hu: Csatlakozás...

source: Requesting...
hu: Lekérdezés...

source: Error making request
hu: Hiba kéréskor

source: Idle
hu: Tétlen

source: Install...
hu: Telepítés...

source: Retry
hu: Újra

source: Download Error
hu: Letöltési Hiba

source: Recently Updated
hu: Nemrég frissítve

source: Least Recently Updated
hu: Legutóbb frissítve

source: Name (A-Z)
hu: Név (A-Z)

source: Name (Z-A)
hu: Név (Z-A)

source: License (A-Z)
hu: Licenc (A-Z)

source: License (Z-A)
hu: Licenc (Z-A)

source: Community
hu: Közösség

source: Testing
hu: Tesztelés

source: Loading...
hu: Betöltés...

source: The Asset Library requires an online connection and involves sending data over the internet.
hu: A csomagtár használatához internetkapcsolat szükséges, és adatforgalommal jár.

source: Go Online
hu: Lépj online

source: Failed to get repository configuration.
hu: Adattár konfiguráció lekérdezése sikertelen.

source: All
hu: Mind

source: No results compatible with %s %s for support level(s): %s. Check the enabled support levels using the 'Support' button in the top-right corner.
hu: Nincs kompatibilis találat - %s%s - az alábbi támogatási szinthez: %s. Ellenőrizze az engedélyezett támogatási szinteket a jobb felső sarokban lévő 'Támogatás' gombbal.

source: Install
hu: Telepítés

source: Search Templates, Projects, and Demos
hu: Sablonok, Projektek és Demók keresése

source: Search Assets (Excluding Templates, Projects, and Demos)
hu: Csomagok keresése (kivéve Sablonok, Projektek és Demók)

source: Import...
hu: Importálás...

source: Plugins...
hu: Bővítmények...

source: Sort:
hu: Rendezés:

source: Category:
hu: Kategória:

source: Site:
hu: Oldal:

source: Support
hu: Támogatás

source: Assets ZIP File
hu: Eszköz ZIP Fájl

source: Error opening asset file for "%s" (not in ZIP format).
hu: Hiba a "%s" csomagfájl megnyitása során (nem ZIP formátumú).

source: %s (already exists)
hu: %s (már létezik)

source: %d file conflicts with your project and won't be installed
hu: %d fájl ütközik a projekttel és nem fog települni

source: This asset doesn't have a root directory, so it can't be ignored.
hu: Ennek a csomagnak nincs gyökérkönyvtára, ezért nem lehet figyelmen kívül hagyni.

source: Ignore the root directory when extracting files.
hu: Gyökérkönyvtár figyelmen kívül hagyása kicsomagoláskor.

source: Uncompressing Assets
hu: Eszközök Kicsomagolása

source: The following files failed extraction from asset "%s":
hu: A következő fájlokat nem sikerült kibontani "%s" csomagból:

source: (and %s more files)
hu: (és további %s fájl)

source: Asset "%s" installed successfully!
hu: "%s" nevű csomag sikeresen telepítve!

source: Success!
hu: Siker!

source: Asset:
hu: Csomag:

source: Open the list of the asset contents and select which files to install.
hu: Nyissa meg a csomag tartalmának listáját és válassza ki a telepítendő fájlokat.

source: Change the folder where the contents of the asset are going to be installed.
hu: Válassza ki a könyvtárat, amelybe a csomag tartalma települni fog.

source: Ignore asset root
hu: Csomag gyökér ignorálása

source: Show contents of the asset and conflicting files.
hu: Megmutatja a csomag tartalmát és az ütköző fájlokat.

source: Contents of the asset:
hu: A csomag tartalma:

source: Configure Asset Before Installing
hu: Csomag Telepítés Előtti Konfigurálása

source: Audio Preview Play/Pause
hu: Audió Előnézet Lejátszás/Szünet

source: Play
hu: Lejátszás

source: Stop
hu: Leállítás

source: Speakers
hu: Hangszórók

source: Add Effect
hu: Effektus Hozzáadása

source: Rename Audio Bus
hu: Hangbusz Átnevezése

source: Change Audio Bus Volume
hu: Hangbusz Hangerő Módosítás

source: Toggle Audio Bus Solo
hu: Hangbusz Szóló Ki-/Bekapcsolása

source: Toggle Audio Bus Mute
hu: Hangbusz Némításának Ki-/Bekapcsolása

source: Toggle Audio Bus Bypass Effects
hu: Hangbusz KItérés Effektus Ki-/Bekapcsolása

source: Select Audio Bus Send
hu: Hangbusz Küldésének Kiválasztása

source: Add Audio Bus Effect
hu: Hangbusz Effektus Hozzáadása

source: Move Bus Effect
hu: Busz Effektus Áthelyezése

source: Delete Bus Effect
hu: Busz Effektus Törlése

source: Drag & drop to rearrange.
hu: Az átrendezéshez húzza át.

source: Solo
hu: Szóló

source: Mute
hu: Néma

source: Bypass
hu: Kitérés

source: Volume
hu: Mennyiség

source: Channel %d, Left VU
hu: Csatorna %d, Bal VU

source: Send
hu: Küldés

source: Bus Options
hu: Busz Beállítások

source: Reset Volume
hu: Hangerő Visszállítása

source: Delete Effect
hu: Effektus Törlése

source: Add Audio Bus
hu: Hangbusz Hozzáadása

source: Master bus can't be deleted!
hu: A főbuszt nem lehet kitörölni!

source: Delete Audio Bus
hu: Hangbusz Törlése

source: Duplicate Audio Bus
hu: Hangbusz Megkettőzése

source: Reset Bus Volume
hu: Busz Hangerő Visszaállítása

source: Move Audio Bus
hu: Hangbusz Áthelyezése

source: Save Audio Bus Layout As...
hu: Hangbusz Elrendezés Mentése Másként...

source: Location for New Layout...
hu: Új Elrendezés Helye...

source: Open Audio Bus Layout
hu: Hangbusz Elrendezés Megnyitása

source: Error saving file: %s
hu: Hiba a fájl mentésekor: %s

source: Add Bus
hu: Busz Hozzáadása

source: Add a new Audio Bus to this layout.
hu: Új hangbusz hozzáadása ehhez az elrendezéshez.

source: Load
hu: Betöltés

source: Load an existing Bus Layout.
hu: Meglévő Busz Elrendezés betöltése.

source: Save this Bus Layout to a file.
hu: Jelenlegi Busz Elrendezés mentése fájlba.

source: Load Default
hu: Alapértelmezett Betöltése

source: Load the default Bus Layout.
hu: Betölti az alapértelmezett Busz Elrendezést.

source: Create a new Bus Layout.
hu: Új Buszelrendezés létrehozása.

source: Step Into
hu: Belépés

source: Step Over
hu: Átlépés

source: Break
hu: Szünet

source: Continue
hu: Folytatás

source: Debug with External Editor
hu: Hibakeresés külső szerkesztővel

source: Deploy with Remote Debug
hu: Indítás Távoli Teszteléssel

source: When this option is enabled, using one-click deploy will make the executable attempt to connect to this computer's IP so the running project can be debugged. This option is intended to be used for remote debugging (typically with a mobile device). You don't need to enable it to use the GDScript debugger locally.
hu: Bekapcsolva, az egykattintásos telepítés (deploy) futtatható állománya megpróbál a számítógép IP címére kapcsolódni, így a futó projekten hibakeresés végezhető. Ez az opció leginkább a távoli hibakereséshez használatos (jellemzően hordozható eszközök esetében). A GDScript hibakereső helyi használatához nincs rá szükség.

source: Small Deploy with Network Filesystem
hu: Kis Telepítés Hálózati Fájlrendszerrel

source: When this option is enabled, using one-click deploy for Android will only export an executable without the project data. The filesystem will be provided from the project by the editor over the network. On Android, deploying will use the USB cable for faster performance. This option speeds up testing for projects with large assets.
hu: Ha ez az opció engedélyezve van, akkor az exportálás vagy a telepítés egy minimális méretű futtatható programot hoz létre. A fájlrendszert magát a projektből a szerkesztő szolgáltatja majd a hálózaton keresztül. Androidon a telepítés gyorsabb teljesítmény érdekében kihasználja az USB kábelt. Ez a lehetőség felgyorsítja a nagy lábnyomú játékok tesztelését.

source: Visible Collision Shapes
hu: Látható Ütközési Alakzatok

source: When this option is enabled, collision shapes and raycast nodes (for 2D and 3D) will be visible in the running project.
hu: Ha ez az opció be van kapcsolva, az ütközési alakzatok és a sugárkövető Node-ok (mind 2D-hez és 3D-hez) láthatóak lesznek a játék futásakor.

source: Visible Navigation
hu: Látható Navigáció

source: Synchronize Scene Changes
hu: Jelenet Változások Szinkronizálása

source: When this option is enabled, any changes made to the scene in the editor will be replicated in the running project. When used remotely on a device, this is more efficient when the network filesystem option is enabled.
hu: Ha ez a beállítás be van kapcsolva, bármely a jeleneten való változtatás a szerkesztből, a futó projekre is alkalmazva lesz. Távoli eszköz használatakor hatékonyabb, ha a hálózati fájlrendszer opció engedélyezve van.

source: Synchronize Script Changes
hu: Szkript Változtatások Szinkronizálása

source: When this option is enabled, any script that is saved will be reloaded in the running project. When used remotely on a device, this is more efficient when the network filesystem option is enabled.
hu: Ha ez a beállítás be van kapcsolva, bármilyen szkript, amit elment, újra betöltődik a futó játékba. Távoli eszköz használatakor hatékonyabb, ha a hálózati fájlrendszer opció engedélyezve van.

source: When this option is enabled, the editor debug server will stay open and listen for new sessions started outside of the editor itself.
hu: Bekapcsolva, a szerkesztő hibakereső szervere nyitva marad és érzékeli a szerkesztőn kívül indított hibakereső munkameneteket.

source: Customize Run Instances...
hu: Futtatási Példányok Testreszabása...

source: Set %s
hu: %s beállítása

source: Set %s on %d objects
hu: %s beállítása %d objektumban

source: Debugger
hu: Hibakereső

source: Session %d
hu: Munkamenet %d

source: Debug
hu: Hibakeresés

source: Some remote nodes were not selected, as the configured maximum selection is %d. This can be changed at "debugger/max_node_selection" in the Editor Settings.
hu: Néhány távoli node nem lett kiválasztva, mert a beállított maximum kiválasztás %d. Ez a "debugger/max_node_selection" segítségével változtatható a Szerkesztő Beállításokban.

source: Save Branch as Scene...
hu: Ág Mentése Jelenetként...

source: Copy Node Path
hu: Node Útvonal Másolása

source: Instance:
hu: Példány:

source: This node has been instantiated from a PackedScene file: %s Click to open the original file in the Editor.
hu: Ez a node egy PackedScene fájlból lett példányosítva: %s Az eredeti fájl kattintással megnyitható a Szerkesztőben.

source: Toggle Visibility
hu: Láthatóság Átváltása

source: Saving the branch as a scene requires selecting only one node, but you have selected %d nodes.
hu: Az ág mentéséhez egyetlen node kijelölése szükséges, de %d node van kijelölve.

source: Expression to evaluate (Up/Down: Navigate history)
hu: Kiértékelendő kifejezés (Fel/Le: Előzmények navigálása)

source: Expression to evaluate
hu: Kiértékelendő kifejezés

source: Updating assets on target device:
hu: Elemek frissítése a céleszközön:

source: Getting remote file system
hu: Távoli fájlrendszer elérése

source: Decompressing remote file system
hu: Távoli fájlrendszer kibontása

source: Sending list of changed files:
hu: Megváltozott fájlok listájának küldése:

source: Monitors
hu: Monitorok

source: Pick one or more items from the list to display the graph.
hu: Válasszon ki egy vagy több elemet a listából a grafikon megjelenítéséhez.

source: Measure:
hu: Mérés:

source: Frame %
hu: Keret %

source: Physics Frame %
hu: Fizika Keret %

source: Inclusive
hu: Befoglaló

source: Self
hu: Saját

source: Inclusive: Includes time from other functions called by this function. Use this to spot bottlenecks. Self: Only count the time spent in the function itself, not in other functions called by that function. Use this to find individual functions to optimize.
hu: Inkluzív: Beleszámolja ezen függvény által hívott más függvények idejét. Szűk keresztmetszet megkereséséhez való. Önálló: Csak a függvény saját idejét számolja; más, ezen függvény által hívott függvényekét nem. Függvények önálló optimalizálásához való.

source: Frame #:
hu: Keret #:

source: Name
hu: Név

source: Time
hu: Idő

source: Calls
hu: Hívások

source: Linked
hu: Kapcsolt

source: Errors
hu: Hibák

source: Main Thread
hu: Fő vonal

source: Execution resumed.
hu: Végrehajtás folytatva.

source: Bytes:
hu: Bájt:

source: Stack Trace
hu: Verem Követés

source: Stack Trace:
hu: Verem Követés:

source: Debug session closed.
hu: Hibakeresés munkamenet lezárva.

source: Copy Error
hu: Hiba Másolása

source: Open C++ Source on GitHub
hu: C++ Forrás Megnyitása GitHub-on

source: C++ Source
hu: C++ forrás

source: Skip Breakpoints
hu: Töréspontok kihagyása

source: Ignore Error Breaks
hu: Hiba Megszakítás Ignorálása

source: Thread:
hu: Szál:

source: Stack Frames
hu: Verem Képek

source: Breakpoints
hu: Töréspontok

source: Expand All
hu: Összes kinyitása

source: Collapse All
hu: Összes becsukása

source: Evaluator
hu: Kiértékelő

source: Profiler
hu: Profilozó

source: List of Video Memory Usage by Resource:
hu: Videó Memóra használat Erőforrásonként:

source: Total:
hu: Összesen:

source: Video RAM Total
hu: Videó RAM Összesen

source: Export list to a CSV file
hu: Lista CSV fájlba exportálása

source: Video RAM
hu: Videó RAM

source: Resource Path
hu: Erőforrás Útvonal

source: Type
hu: Típus

source: Format
hu: Formátum

source: Usage
hu: Használat

source: Misc
hu: Egyéb

source: Clicked Control:
hu: Kattintott Vezérlő:

source: Clicked Control Type:
hu: Kattintott Vezérlő Típus:

source: Live Edit Root:
hu: Élő Gyökér Módosítás:

source: Export measures as CSV
hu: Elemzés CSV-be exportálása

source: This method supports a variable number of arguments.
hu: Ez a metódus változó számú argumentumot támogat.

source: This method is called by the engine. It can be overridden to customize built-in behavior.
hu: Ezt a metódust a motor hívja. Felülírható a beépített viselkedés testreszabása érdekében.

source: This method is required to be overridden when extending its base class.
hu: Osztályöröklés esetén ezt a metódust kötelező felülírni.

source: This method has no side effects. It does not modify the object in any way.
hu: Ennek a metódusnak nincsenek mellékhatásai. Semmilyen módon nem módosítja az objektumot.

source: This method does not need an instance to be called. It can be called directly using the class name.
hu: Ezt a metódust nem kell példányosítani a meghívásához. Közvetlenül hívható az osztálynév használatával.

source: This method must be implemented to complete the abstract class.
hu: Ezt a metódust kötelező implementálni az absztrakt osztály kiteljesítéséhez.

source: This value is an integer composed as a bitmask of the following flags.
hu: Ez az érték a következő jelzők bitmaszkjaként összeállított egész szám.

source: Experimental
hu: Kísérleti

source: Constructors
hu: Építők

source: Operators
hu: Operátorok

source: Method Descriptions
hu: Metódus leírások

source: Constructor Descriptions
hu: Konstruktor leírása

source: Operator Descriptions
hu: Operátor tulajdonságok

source: This method may be changed or removed in future versions.
hu: Ez a metódus módosulhat vagy törölve is lehet a jövőbeli verziókban.

source: This constructor may be changed or removed in future versions.
hu: Ez a konstruktor módosulhat vagy törölve is lehet a jövőbeli verziókban.

source: This operator may be changed or removed in future versions.
hu: Ez az operátor módosulhat vagy törölve is lehet a jövőbeli verziókban.

source: There is currently no description for this method.
hu: Jelenleg nincs leírás ehhez a metódushoz.

source: There is currently no description for this constructor.
hu: Jelenleg nincs leírás ehhez a konstruktorhoz.

source: There is currently no description for this operator.
hu: Jelenleg nincs leírás ehhez az operátorhoz.

source: Top
hu: Eleje

source: Class:
hu: Osztály:

source: This class may be changed or removed in future versions.
hu: Ez az osztály módosulhat vagy törölve is lehet a jövőbeli verziókban.

source: Inherits:
hu: Örökli:

source: Inherited by:
hu: Őt örökli:

source: Description
hu: Leírás

source: There is currently no description for this class.
hu: Jelenleg nincs leírás ehhez az osztályhoz.

source: Note:
hu: Megjegyzés:
