Repository: zhangjiangen11/godot
Catalog: editor/translations/editor/*.po
Languages: hu

source: Rotate %d CanvasItems
hu: %d CanvasItem Forgatása

source: Rotate CanvasItem "%s" to %d degrees
hu: "%s" CanvasItem Forgatása %d fokra

source: Scale Node2D "%s" to (%s, %s)
hu: Node2D "%s" Méretezése (%s, %s)

source: Resize Control "%s" to (%d, %d)
hu: Control "%s" Átméretezése (%d, %d)

source: Scale %d CanvasItems
hu: %d CanvasItem Méretezése

source: Scale CanvasItem "%s" to (%s, %s)
hu: "%s" CanvasItem Méretezése (%s, %s)-ra/re

source: Move %d CanvasItems
hu: %d CanvasItem Áthelyezése

source: Move CanvasItem "%s" to (%d, %d)
hu: %s CanvasItem mozgatása (%d, %d)-ra/re

source: units
hu: egység

source: Alt+Drag: Move selected node.
hu: Alt+Húzás: Kijelölt node mozgatása.

source: RMB: Add node at position clicked.
hu: RMB: Node hozzáadása a kattintott pozíción.

source: Click to change object's pivot.
hu: Kattintással változtatható az objektum forgáspontja.

source: Shift: Set temporary pivot.
hu: Shift: Ideiglenes forgáspont beállítás.

source: Click this button while holding Shift to put the temporary pivot in the center of the selected nodes.
hu: Kattintson erre a gombra a Shift nyomvatartása mellett, hogy az ideiglenes forgáspontot a kijelölt node-ok középpontjába helyezze.

source: Paste Pose
hu: Póz Beillesztése

source: Clear Guides
hu: Segédvonalak törlése

source: Zoom to 3.125%
hu: Nagyítás: 3,125%

source: Zoom to 6.25%
hu: Nagyítás: 6,25%

source: Zoom to 12.5%
hu: Nagyítás: 12.5%

source: Zoom to 1600%
hu: Nagyítás: 1600%

source: Shift: Scale proportionally.
hu: Shift: Arányos méretezés.

source: Pan Mode
hu: Pásztázás Mód

source: You can also use Pan View shortcut (Space by default) to pan in any mode.
hu: Bármely módban használhatja a Csúsztatás Nézet gyorsbillentyűt (alapértelmezetten szóköz).

source: Toggle smart snapping.
hu: Okos illesztés kapcsolása.

source: Use Smart Snap
hu: Intelligens illesztés használata

source: Toggle grid snapping.
hu: Rácsra illesztés kapcsolása.

source: Use Grid Snap
hu: Rácsra Illesztés Használata

source: Snapping Options
hu: Illesztési beállítások

source: Use Rotation Snap
hu: Forgatási Illesztés Használata

source: Use Scale Snap
hu: Méretezés Illesztés Használata

source: Snap Relative
hu: Relatív Illesztés

source: Use Pixel Snap
hu: Pixelhez Illesztés

source: Snap to Parent
hu: Illesztés szülőhöz

source: Snap to Node Anchor
hu: Illesztés node horgonyhoz

source: Snap to Node Sides
hu: Illesztés node oldalakhoz

source: Snap to Node Center
hu: Illesztés node középponthoz

source: Snap to Other Nodes
hu: Illesztés más node-okhoz

source: Snap to Guides
hu: Illesztés segédvonalakhoz

source: Smart Snapping
hu: Intelligens illesztés

source: Groups the selected node with its children. This causes the parent to be selected when any child node is clicked in 2D and 3D view.
hu: Csoportosítja a kijelölt node-ot és annak gyermekeit. Ez kijelöli a szülőt, amikor bármely gyermek node-ra kattint 2D vagy 3D nézetben.

source: Skeleton Options
hu: Csontváz beállítások

source: Show Bones
hu: Csontok Mutatása

source: Make Bone2D Node(s) from Node(s)
hu: Bone2D Node(ok) Létrehozása Node(ok)-ból

source: Show Helpers
hu: Segítők megjelenítése

source: Show Rulers
hu: Vonalzók Megjelenítése

source: Show Guides
hu: Vezetővonalak Megjelenítése

source: Show Origin
hu: Origó Megjelenítése

source: Show Viewport
hu: Nézet Megjelenítése

source: Center Selection
hu: Kijelölés középre

source: Frame Selection
hu: Kijelölés Keretezése

source: Preview Canvas Scale
hu: Vászonméret Előnézet

source: Insert keys (based on mask).
hu: Kulcsok beillesztése (maszk alapján).

source: Insert Key
hu: Kulcs Beszúrása

source: Auto insert keys when objects are translated, rotated or scaled (based on mask). Keys are only added to existing tracks, no new tracks will be created. Keys must be inserted manually for the first time.
hu: Auto kulcs beillesztés objektumok mozgatásakor, elforgatásakor vagy méretezésekor (maszk alapján). A kulcsok csak a létező sávokhoz jönnek létre, új sávok nem készülnek. A kulcsokat első alkalommal manuálisan kell beilleszteni.

source: Auto Insert Key
hu: Auto Kulcs Beillesztés

source: Animation Key and Pose Options
hu: Animáció Kulcs és Póz Beállítások

source: Copy Pose
hu: Póz Másolása

source: Clear Pose
hu: Póz törlése

source: Multiply grid step by 2
hu: Rács Léptetés Mértékének Kétszerezése

source: Divide grid step by 2
hu: Rács Léptetés Mértékének Felezése

source: Adding %s...
hu: %s Hozzáadása...

source: Circular dependency found at %s.
hu: Körkörös függőség található itt: %s.

source: Drag and drop to add as sibling of selected node (except when root is selected).
hu: A kijelölt node-hoz való testvérként hozzáadáshoz húzza rá (kivéve, ha a gyökér van kiválasztva).

source: Hold Shift when dropping to add as child of selected node.
hu: Shift nyomvatartásával ráejtéskor gyermekként jön létre a kijelölt node-on.

source: Hold Alt when dropping to add as child of root node.
hu: Alt nyomvatartásával ráejtéskor gyermekként jön létre a gyökér node-on.

source: Hold Alt + Shift when dropping to add as different node type.
hu: Alt+Shift nyomvatartásával ráejtéskor más node típusként hozható létre.

source: All selected CanvasItems are either invisible or locked in some way and can't be transformed.
hu: Vagy minden kijelölt CanvasItem láthatatlan, vagy valamilyen módon zárolt és nem alakítható át.

source: Method in target node must be specified.
hu: Nevezze el a metódust a cél node-ban.

source: Method name must be a valid identifier.
hu: A metódusnévnek érvényes azonosítónak kell lennie.

source: Target method not found. Specify a valid method or attach a script to the target node.
hu: Nem található a célmetódus! Nevezzen meg egy érvényes metódust, vagy csatoljon egy szkriptet a cél node-hoz.

source: %s: Callback code won't be generated, please add it manually.
hu: %s: Visszahívási kód nem generálódik, hozza létre manuálisan.

source: Connect to Node:
hu: Csatlakoztatás node-hoz:

source: Connect to Script:
hu: Csatlakoztatás szkripthez:

source: From Signal:
hu: Jelzésből:

source: Scene does not contain any script.
hu: A jelenet nem tartalmaz szkriptet.

source: No method found matching given filters.
hu: A megadott szűrők alapján nincs megfelelő metódus.

source: Add Extra Call Argument:
hu: További meghívási argumentum hozzáadása:

source: Extra Call Arguments:
hu: További hívási argumentumok:

source: Allows to drop arguments sent by signal emitter.
hu: Eltávolíthatóvá teszi a jeladó által továbbított argumentumokat.

source: Receiver Method:
hu: Fogadó metódus:

source: Deferred
hu: Elhalasztott

source: Defers the signal, storing it in a queue and only firing it at idle time.
hu: Késlelteti a jelzést, amit egy sorban tárol és csak holtidőben adja ki.

source: Disconnects the signal after its first emission.
hu: Az első kibocsátás után lekapcsolja a jelzést.

source: The source object is automatically sent when the signal is emitted.
hu: Az eredet objektum automatikusan továbbítódik a jel kibocsátásakor.

source: Cannot connect signal
hu: Nem lehet csatlakoztatni a jelet

source: Connect
hu: Csatlakoztatás

source: Connect '%s' to '%s'
hu: '%s' csatlakoztatása ehhez: '%s'

source: Disconnect '%s' from '%s'
hu: '%s' leválasztása erről: '%s'

source: Disconnect all from signal: '%s'
hu: Az összes leválasztása a jelzésről: '%s'

source: Connect...
hu: Csatlakoztatás...

source: Disconnect
hu: Leválasztás

source: Connect a Signal to a Method
hu: Jelzés csatlakoztatása metódushoz

source: Are you sure you want to remove all connections from the "%s" signal?
hu: Biztosan eltávolítja az összes kapcsolatot a(z) "%s" jelzésről?

source: Are you sure you want to remove all connections from this signal?
hu: Biztosan eltávolítja az összes kapcsolatot erről a jelzésről?

source: Disconnect All
hu: Összes lecsatlakoztatása

source: Edit...
hu: Szerkesztés...

source: Go to Method
hu: Ugrás az eljárásra

source: Load Curve Preset
hu: Előre Beállított Görbe Betöltése

source: Remove Curve Point
hu: Görbe Pontjának Eltávolítása

source: Modify Curve Point
hu: Görbe Pontjának Módosítása

source: Hold Shift to edit tangents individually
hu: Tartsa lenyomva a Shift gombot az érintők egyenkénti szerkesztéséhez

source: Ease In
hu: Enyhén be

source: Ease Out
hu: Enyhén ki

source: Smoothstep
hu: Simított Lépés

source: Play This Scene
hu: Jelenet lejátszása

source: Close Tab
hu: Lap bezárása

source: Undo Close Tab
hu: Lap bezárásának visszavonása

source: Close Other Tabs
hu: A Többi Lap Bezárása

source: Close Tabs to the Right
hu: Lapok bezárása ettől jobbra

source: Close All Tabs
hu: Minden lap bezárása

source: Add a new scene.
hu: Hozzáad egy új jelenetet.

source: Reverse Gradient
hu: Színátmenet Megfordítása

source: Reverse/Mirror Gradient
hu: Színátmenet Megfordítása/Tükrözése

source: Renaming Group References
hu: Csoportreferenciák Átnevezése

source: Removing Group References
hu: Csoportreferenciák Eltávolítása

source: This node doesn't have a control parent.
hu: Ennek a node-nak nincs vezérlő szülője.

source: Use the appropriate layout properties depending on where you are going to put it.
hu: Használja a megfelelő elrendezési tulajdonságokat az elhelyezéstől függően.

source: This node is a child of a container.
hu: Ez a node egy konténer gyermeke.

source: Use container properties for positioning.
hu: Helyzetbeállításhoz használja a konténer tulajdonságokat.

source: This node is a child of a regular control.
hu: Ez a node egy szokványos vezérlő gyermeke.

source: Use anchors and the rectangle for positioning.
hu: Helyzetbeállításhoz használjon horgonyokat és a téglalapot.

source: Collapse positioning hint.
hu: Helyzetbeállítás tipp becsukása.

source: Expand positioning hint.
hu: Helyzetbeállítás tipp kinyitása.

source: Fill
hu: Kitöltés

source: Shrink End
hu: Vég Zsugorítás

source: Top Left
hu: Bal felső

source: Center Top
hu: Felső közép

source: Top Right
hu: Jobb felső

source: Top Wide
hu: Széles Felső

source: Center Left
hu: Bal közép

source: Center
hu: Középre

source: Center Right
hu: Jobbra közép

source: HCenter Wide
hu: Széles HCenter

source: Bottom Left
hu: Bal alsó

source: Center Bottom
hu: Középre lent

source: Bottom Right
hu: Jobb alsó

source: Bottom Wide
hu: Széles Alsó

source: Left Wide
hu: Széles Bal

source: VCenter Wide
hu: Széles VCenter

source: Right Wide
hu: Széles Jobb

source: Full Rect
hu: Teljes Téglalap

source: Enable to also set the Expand flag. Disable to only set Shrink/Fill flags.
hu: Engedélyezéskor a Kinyitás kapcsolót is állítja. Kikapcsolva csak a Zsugorítás/Kitöltés kapcsolókat állítja.

source: Some parents of the selected nodes do not support the Expand flag.
hu: A kijelölt node-ok egyes szülői nem támogatják a Kinyitás kapcsolót.

source: Change Anchors, Offsets, Grow Direction
hu: Horgonyok, Eltolások, Növesztés Irányának Változtatása

source: Change Anchors, Offsets (Keep Ratio)
hu: Horgonyok, Eltolások (Aránytartással) Változtatása

source: Presets for the anchor and offset values of a Control node.
hu: Egy Control node horgony és eltolás értékeinek előbeállítása (preset).

source: Adjust anchors and offsets to match the current rect size.
hu: Horgonyok és eltolások igazítása a jelenlegi rect mérethez.

source: When active, moving Control nodes changes their anchors instead of their offsets.
hu: Amikor aktív, a mozgó Control node eltolás helyett a horgonyokat változtatja meg.

source: Sizing settings for children of a Container node.
hu: Méretezési beállítások egy Konténer node gyermekei számára.

source: Features (%d of %d set)
hu: Funkciók (%d a(z) %d készletből)

source: East Asian Language
hu: Kelet Ázsiai Nyelv

source: East Asian Widths
hu: Kelet Ázsiai Szélességek

source: Unable to preview font
hu: Betűtípus előnézet nem elérhető

source: 1 font
hu: 1 betűtípus

source: 1 font size
hu: 1 betűtípus méret

source: 1 icon
hu: 1 ikon

source: {num} currently selected
hu: {num} kijelölt elem

source: Nothing was selected for the import.
hu: Semmi sem lett kijelölve importálásra.

source: Importing items {n}/{n}
hu: Importálás {n}/{n}

source: With Data
hu: Adatokkal

source: Select by data type:
hu: Adattípus szerinti kijelölés:

source: Select all visible color items.
hu: Minden látható szín elem kijelölése.

source: Select all visible color items and their data.
hu: Minden látható szín elem kijelölése adatokkal együtt.

source: Deselect all visible color items.
hu: Kijelölés megszüntetése minden látható szín elemen.

source: Select all visible constant items.
hu: Minden látható konstans elem kijelölése.

source: Select all visible constant items and their data.
hu: Minden látható konstans elem kijelölése adatokkal együtt.

source: Deselect all visible constant items.
hu: Kijelölés megszüntetése minden látható konstans elemen.

source: Select all visible font items.
hu: Minden látható betűtípus elem kijelölése.

source: Select all visible font items and their data.
hu: Minden látható betűtípus elem kijelölése adatokkal együtt.

source: Deselect all visible font items.
hu: Kijelölés megszüntetése minden látható betűtípus elemen.

source: Select all visible font size items and their data.
hu: Minden látható betűtípus méret elem kijelölése adatokkal együtt.

source: Select all visible icon items.
hu: Minden látható ikon elem kijelölése.

source: Select all visible icon items and their data.
hu: Minden látható ikon elem kijelölése adatokkal együtt.

source: Deselect all visible icon items.
hu: Kijelölés megszüntetése minden látható ikon elemen.

source: Select all visible stylebox items.
hu: Minden látható stylebox elem kijelölése.

source: Select all visible stylebox items and their data.
hu: Minden látható stylebox elem kijelölése adatokkal együtt.

source: Deselect all visible stylebox items.
hu: Kijelölés megszüntetése minden látható stylebox elemen.

source: Caution: Adding icon data may considerably increase the size of your Theme resource.
hu: Figyelem: Ikon adatok hozzáadása jelentősen növelheti a Téma erőforrás méretét.

source: Select all Theme items with item data.
hu: Minden Téma elem kijelölése adatokkal együtt.

source: Deselect all Theme items.
hu: Kijelölés megszüntetése minden Téma elemen.

source: Import Items tab has some items selected. Selection will be lost upon closing this window. Close anyway?
hu: Az Elemek Importálása fülön vannak kijelölt tételek. Az ablak bezárásakor a kijelölés elvész. Be szeretné zárni?

source: Select a theme type from the list to edit its items. You can add a custom type or import a type with its items from another theme.
hu: Jelöljön ki egy téma típust a listából az elemeinek módosításához. Hozzáadhat egyedi típust vagy importálhat egyet egy másik témából.

source: This theme type is empty. Add more items to it manually or by importing from another theme.
hu: Ez a téme típus üres. Adjon hozzá elemeket kézzel vagy importáljon másik témából.

source: Rename Constant Item
hu: Konstans Elem Átnevezése

source: Invalid file, same as the edited Theme resource.
hu: Érvénytelen fájl, egyezik a módosított Téma erőforrással.

source: Remove Class Items
hu: Osztály Elem Eltávolítása

source: Remove All Items
hu: Minden Elem Eltávolítása

source: Filter the list of types or create a new custom type:
hu: A típuslista szűrése vagy új egyedi típus létrehozása:

source: Unpin this StyleBox as a main style.
hu: Fő stílusként beállított StyleBox kitűzés megszüntetése.

source: Pin this StyleBox as a main style. Editing its properties will update the same properties in all other StyleBoxes of this type.
hu: StyleBox kitűzése fő stílusként. A tulajdonásgainak átállítása frissíti ugyanazon tulajdonságokat az összes azonos típusú StyleBox-ban.

source: Pin this StyleBox as a main style.
hu: StyleBox kitűzése fő stílusként.

source: Override All Default Theme Items
hu: Minden Alapértelmezett Téma Elem Felülírása

source: Set Font Size Item in Theme
hu: Téma Betűtípus Méretének Beállítása

source: Set Font Item in Theme
hu: Téma Betűtípusának Beállítása

source: Set Icon Item in Theme
hu: Téma Ikon Beállítása

source: Add a type from a list of available types or create a new one.
hu: Adjon hozzá egy típust az elérhetők listáiból vagy hozzon létre újat.

source: Show default type items alongside items that have been overridden.
hu: Alapértelmezett típus elemek mutatása a felülírtak mellett.

source: Override all default type items.
hu: Minden alapértelmezett típus elem felülírása.

source: Select the variation base type from a list of available types.
hu: Válassza ki az alap típus variációját az elérhető típusokból.

source: A type associated with a built-in class cannot be marked as a variation of another type.
hu: Beépített osztályhoz tartozó típus nem jelölhető meg más típus variációjaként.

source: Theme
hu: Téma

source: Add, remove, organize, and import Theme items.
hu: Téma elemek hozzáadása, eltávolítása, rendezése és importálása.

source: Toggle the control picker, allowing to visually select control types for edit.
hu: Vezérlőválasztó kapcsolása, lehetővé téve a vezérlő típusok módosítását.

source: Toggle Button
hu: Váltógomb

source: Disabled Button
hu: Letiltott gomb

source: Item
hu: Elem

source: Disabled Item
hu: Letiltott elem

source: Check Item
hu: Pipálható Elem

source: Checked Item
hu: Kipipált Elem

source: Radio Item
hu: Rádió Elem

source: Checked Radio Item
hu: Bejelölt Választógomb

source: Named Separator
hu: Elnevezett Elválasztó

source: Submenu
hu: Almenü

source: Subitem 1
hu: Alelem 1

source: Subitem 2
hu: Alelem 2

source: Has
hu: Van

source: Many
hu: Sok

source: Disabled LineEdit
hu: Letiltott szerkesztősor

source: Editable Item
hu: Szerkeszthető elem

source: Subtree
hu: Részfa

source: Has,Many,Options
hu: Van,Több,Opciója

source: Invalid path, the PackedScene resource was probably moved or removed.
hu: Érvénytelen útvonal, a PackedScene erőforrást valószínűleg áthelyezték vagy eltávolították.

source: Invalid PackedScene resource, must have a Control node at its root.
hu: Érvénytelen PackedScene erőforrás, gyökér elemként egy Control node-ra van szükség.

source: Reload the scene to reflect its most actual state.
hu: Jelenet újratöltése a legfrissebb állapot mutatásához.

source: Preview is not available for this shader mode.
hu: Ehhez a shader módhoz nem használható előnézet.

source: Box
hu: Doboz

source: Quad
hu: Kvad

source: Hold Shift to scale around midpoint instead of moving.
hu: Shift nyomvatartásával mozgatás helyett középpontosan méretezhető.

source: Toggle between minimum/maximum and base value/spread modes.
hu: Váltás minimum/maximum és alap érték/szórás módok között.

source: Batch Rename
hu: Csoportos átnevezés

source: Replace:
hu: Csere:

source: Use Regular Expressions
hu: Reguláris kifejezés használata

source: Substitute
hu: Helyettesítő

source: Sequential integer counter. Compare counter options.
hu: Szekvenciális számláló. Számláló tulajdonságok összehasonlítása.

source: Per-level Counter
hu: Szintenkénti Számláló

source: If set, the counter restarts for each group of child nodes.
hu: Ha be van kapcsolva, a számláló minden gyermekcsoport esetén újraindul.

source: Initial value for the counter.
hu: A számláló alapértéke.

source: Step
hu: Lépés

source: Amount by which counter is incremented for each node.
hu: Mennyiség, amivel a számláló értéke node-onként növekszik.

source: Minimum number of digits for the counter. Missing digits are padded with leading zeros.
hu: A számláló minimális számjegyeinek száma. A hiányzó számjegyek helye nullákkal töltődik fel.

source: Minimum number of digits for the counter.
hu: A számláló minimális számjegyeinek száma.

source: Post-Process
hu: Utófeldolgozás

source: PascalCase to snake_case
hu: PascalCase átírás snake_case-re

source: snake_case to PascalCase
hu: snake_case átírás PascalCase-re

source: To Lowercase
hu: Kisbetűssé

source: To Uppercase
hu: Nagybetűssé

source: Reset
hu: Visszaállítás

source: Regular Expression Error:
hu: Reguláris Kifejezési Hiba:

source: At character %s
hu: A(z) %s karakternél

source: Keep Global Transform
hu: Globális Transzformáció Megtartása

source: Reparent
hu: Új szülő hozzárendelése

source: ERROR: Couldn't load resource!
hu: HIBA: Nem sikerült betölteni az erőforrást!

source: Add Resource
hu: Erőforrás Hozzáadása

source: Rename Resource
hu: Erőforrás Átnevezése

source: Delete Resource
hu: Erőforrás Törlése

source: Resource clipboard is empty!
hu: Az erőforrás vágólap üres!

source: Paste Resource
hu: Erőforrás Beillesztése

source: Load Resource
hu: Erőforrás Betöltése

source: Leave empty to derive from scene name
hu: Hagyja üresen a jelenetnévből származtatáshoz

source: When empty, the root node name is derived from the scene name based on the "editor/naming/node_name_casing" project setting.
hu: Ha üres, akkor a gyökér node neve a jelenet nevéből jön létre az "editor/naming/node_name_casing" projekt beállítás alapján.

source: The root node of a scene is recommended to not be transformed, since instances of the scene will usually override this. Reset the transform and reload the scene to remove this warning.
hu: Nem javasolt egy jelenet gyökér node-ját transzformálni, mert a jelenetek példányai általában felülírják azt. Állítsa vissza a transzformációt és töltse újra a jelenetet a figyelmeztetés eltüntetéséhez.

source: Toggle Visible
hu: Láthatóság Kapcsolása

source: Unlock Node
hu: Node feloldása

source: (Connecting From)
hu: (Csatlakozás Innen)

source: Node configuration warning:
hu: Node konfiguráció figyelmeztetés:

source: This node can be accessed from anywhere within the scene it belongs to by using the '%s' prefix in the node path.
hu: Ez a node a jelenetén belül bárhonnan elérhető a node útvonalban használt "%s" prefix használatával.

source: Click to disable this.
hu: Kattintással kikapcsolható.

source: Click to show signals dock.
hu: Kattintásra megmutatja a jel dokkot.

source: Click to show groups dock.
hu: Kattintásra megmutatja a csoport dokkot.

source: This script can run in the editor. It is currently disabled due to recovery mode.
hu: Ez a szkript a szerkesztőben is futhat. Jelenleg le van tiltva a visszaállítási mód miatt.

source: This script is currently running in the editor.
hu: Ez a szkript jelenleg fut a szerkesztőben.

source: This script is a custom type.
hu: Ez a szkript egy egyedi típus.

source: Open Script:
hu: Szkript megnyitása:

source: Node is locked. Click to unlock it.
hu: Zárolt node. Kattintásra felold.

source: Children are not selectable. Click to make them selectable.
hu: A gyermekek nem jelölhetőek ki. Kattintásra kijelölhetővé válnak.

source: AnimationPlayer is pinned. Click to unpin.
hu: Az AnimationPlayer ki van tűzve. Kattintással visszavonható.

source: "%s" is not a known filter.
hu: "%s" egy ismeretlen szűrő.

source: Root nodes cannot be accessed as unique names in their own scene. Instantiate in another scene and set as unique name there.
hu: Gyökér node-ok nem érhetőek el egyedi név használatával a jelenetükben. Példányosítson egy másik jelenetet és állítson be ott egy egyedi nevet.

source: Scene Tree (Nodes):
hu: Jeleneti Fa (Node-ok):

source: Node Configuration Warning!
hu: Node Konfiguráció Figyelmeztetés!

source: Revoke
hu: Visszavonás

source: Don't Ask Again
hu: Ne Kérdezze Újra

source: This dialog can also be enabled/disabled in the Editor Settings: Docks > Scene Tree > Ask Before Revoking Unique Name.
hu: Ez a párbeszédablak a Szerkesztő Beállításaiban is be-/kikapcsolható a Dokkok > Jelenetfa > Kérdezzen rá az Egyedi Név Visszavonására.

source: Allowed:
hu: Engedélyezett:

source: Select a Node
hu: Node Kiválasztása

source: No Frames Selected
hu: Nincs Kijelölt Képkocka

source: Add %d Frame(s)
hu: %d Képkocka Hozzáadása

source: Add Frame
hu: Kép Hozzáadása

source: Unable to load images
hu: Nem lehet betölteni a képeket

source: (empty)
hu: (üres)
