Repository: zhangjiangen11/godot
Catalog: editor/translations/editor/*.po
Languages: hu

source: This field filters projects by name and last path component. To filter projects by name and full path, the query must contain at least one `/` character.
hu: Ez a mező név és az utolsó útvonalrész szerint szűri a projekteket. Név és teljes útvonal szerinti szűréshez a szűrőnek legalább egy "/" karaktert kell tartalmaznia.

source: Last Edited
hu: Utoljára szerkesztve

source: Tags
hu: Címkék

source: Note: The Asset Library requires an online connection and involves sending data over the internet.
hu: Megjegyzés: A csomagtár használatához internetkapcsolat szükséges, és adatforgalommal jár.

source: Edit in verbose mode
hu: Módosítás részletes (verbose) módban

source: Edit in recovery mode
hu: Módosítás visszaállítási módban

source: Remove Missing
hu: Hiányzó eltávolítása

source: Donate
hu: Adományozás

source: Asset Library
hu: Csomagtár

source: Asset Library not available (due to using Web editor, or because SSL support disabled).
hu: A csomagtár nem elérhető (a Webes szerkesztő használata, vagy SSL támogatás hiánya miatt).

source: Select a Folder to Scan
hu: Válassza ki a mappát a kereséshez

source: Remove All
hu: Összes Eltávolítása

source: Edit in Recovery Mode
hu: Módosítás Visszaállítási Módban

source: This option will perform full project conversion, updating scenes, resources and scripts from Godot 3 to work in Godot 4. Note that this is a best-effort conversion, i.e. it makes upgrading the project easier, but it will not open out-of-the-box and will still require manual adjustments. IMPORTANT: Make sure to backup your project before converting, as this operation makes it impossible to open it in older versions of Godot.
hu: Ez az opció teljes projekt konverziót hajt végre, frissítve a jeleneteket, erőforrásokat és szkripteket Godot 3-ról Godot 4-re. Ez egy "best-effort" konverzió, ami azt jelenti, hogy egyszerűsíti a projekt frissítését, de nem fog azonnal működni és kézi módosításokat igényel. FONTOS: Készítsen biztonsági másolatot a projektről a konverzió előtt, mert a művelet után régebbi Godot verziókkal már nem nyitható meg.

source: Error
hu: Hiba

source: Manage Project Tags
hu: Projektcímkék kezelése

source: Click tag to remove it from the project.
hu: Címkére kattintással eltávolítható a projektről.

source: Click tag to add it to the project.
hu: Címkére kattintással hozzáadható a projekthez.

source: Tags are capitalized automatically when displayed.
hu: A címkék megjelenítéskor automatikusan nagybetűsek.

source: example_tag (will display as Example Tag)
hu: példa_címke (megjelenítéskor Példa Címke)

source: Restart Now
hu: Újraindítás most

source: Style
hu: Stílus

source: Custom preset can be further configured in the editor.
hu: Az egyéni előbeállítás (preset) részletesen beállítható a szerkesztőben.

source: Check for Updates
hu: Frissítések Keresése

source: Directory Naming Convention
hu: Mappa Elnevezési Konvenció

source: Settings changed! The project manager must be restarted for changes to take effect.
hu: A beállítások megváltoztak! Újra kell indítani a projekt menedzsert a változások érvénybe lépéséhez.

source: Different engine version may have minor differences in various Resources, like additional fields or removed properties. When upgrading the project to a new version, such changes can cause diffs when saving scenes or resources, or reimporting. This tool ensures that such changes are performed all at once. It will: - Regenerate UID cache - Load and re-save every text/binary Resource - Reimport every importable Resource Full upgrade will take considerable amount of time, but afterwards saving/reimporting any scene/resource should not cause unintended changes.
hu: Más motorverziókban egyes Erőforrások esetén előfordulhatnak apró különbségek, például új mezők vagy eltávolított tulajdonságok. A projekt frissítésekor ezek a változások különbségeket okozhatnak a jelenetek vagy erőforrások mentésénél vagy újraimportálásánál. Ez az eszköz biztosítja, hogy a változások egyszerre történjenek: - UID gyorsítótár újraépítése - Szöveges/bináris Erőforrások betöltése és újra elmentése - Importálható Erőforrások újraimportálása A teljes frissítés jelentős időbe telik, de utána a jelenetek/erőforrások mentése/újraimportálása nem fog nem kívánt változásokat eredményezni.

source: Restart & Upgrade
hu: Újraindítás és Frissítés

source: Movie Maker mode is enabled, but no movie file path has been specified. A default movie file path can be specified in the project settings under the Editor > Movie Writer category. Alternatively, for running single scenes, a `movie_file` string metadata can be added to the root node, specifying the path to a movie file that will be used when recording that scene.
hu: A Filmkészítő mód be van kapcsolva, de nincs film útvonal beállítva. Az alapértelmezett útvonal a projekt beállítások Szerkesztő > Filmíró kategóriájában állítható be. Alternatívaként önálló jeleneteknél a `movie_file` szöveges metaadat használható a gyökér node-on, mely a film fájl útvonalát kell tartalmazza a jelenet felvételéhez.

source: Recovery Mode is enabled. Disable it to run the project.
hu: Visszaállítási Mód engedélyezve. A projekt futtatásához kapcsolja ki.

source: Autostart is enabled for the following profilers, which can have a performance impact:
hu: Az alábbi profilozók esetén engedélyezett az automatikus indítás, ami hatással lehet a teljesítményre:

source: Network Profiler
hu: Hálózati profilkészítő

source: Click to open the first profiler for which autostart is enabled.
hu: Kattintással megnyílik az első profilozó, amely automatikusan elindul.

source: Godot opened the project in Recovery Mode, which is a special mode that can help recover projects that crash the engine upon initialization. The following features have been temporarily disabled:
hu: A Godot szoftver Visszaállítási Módban nyitotta meg a projektet, ami egy speciális mód a motor összeomlását okozó projektek visszaállításához. Az alábbi funkciók ideiglenesen ki vannak kapcsolva:

source: If the project cannot be opened outside of this mode, then it's very likely any of these components is preventing this project from launching. This mode is intended only for basic editing to troubleshoot such issues, and therefore it is not possible to run a project in this mode.
hu: Ha a projektet ezen a módon kívül másképp nem lehet megnyitni, akkor nagy valószínűséggel ezen összetevők bármelyike felelős lehet érte. Ez a mód egyszerű módosításokkal történő hibafelderítéshez való, ezért a projekt futtatására ebben a módban nincs lehetőség.

source: To disable Recovery Mode, reload the project by pressing the Reload button next to the Recovery Mode banner, or by reopening the project normally.
hu: A Visszaállítási mód kikapcsolásához töltse be újra a projektet a Újratöltés gombbal a Visszaállítási Mód fejléce mellett vagy úgy, hogy a szokásos módon nyitja meg a projektet.

source: Disable recovery mode and reload the project.
hu: Kikapcsolja a visszaállítási módot és újratölti a projektet.

source: Recovery Mode is enabled. Click for more details.
hu: Visszaállítási Mód engedélyezve. Kattintson a részletekért.

source: Run Scene in Regular Mode
hu: Jelenet Futtatása Szokásos Módon

source: Run Scene in XR Mode
hu: Jelenet Futtatása XR Módban

source: Run Specific Scene
hu: Adott Jelenet Futtatása

source: Run in XR Mode
hu: Futtatás XR Módban

source: Enable Movie Maker Mode
hu: Filmkészítő Mód Bekapcsolása

source: Enable Movie Maker mode. The project will run at stable FPS and the visual and audio output will be recorded to a video file.
hu: Bekapcsolja a Filmkészítő módot. A projekt stabil FPS-sel fog futni és az audiovizuális kimenet videófájlként rögzül.

source: No Remote Deploy export presets configured.
hu: Nincs beállított Távoli Telepítő export előbeállítás (preset).

source: No runnable export preset found for this platform. Please add a runnable preset in the Export menu or define an existing preset as runnable.
hu: Nem található futtatható exportállomány ehhez a platformhoz. Kérem adjon hozzá egy futtatható exportállományt az export menüben.

source: Warning: The CPU architecture "%s" is not active in your export preset. Run "Remote Deploy" anyway?
hu: Figyelmeztetés: A(z) "%s" CPU architektúra inaktív az export előbeállításokban (preset). Futtassuk a "Távoli Telepítést"?

source: Deploy to First Device in List
hu: Telepítés a lista Első Eszközére

source: Deploy to Second Device in List
hu: Telepítés a lista Második Eszközére

source: Deploy to Third Device in List
hu: Telepítés a lista Harmadik Eszközére

source: Deploy to Fourth Device in List
hu: Telepítés a lista Negyedik Eszközére

source: Suspend/Resume Embedded Project
hu: Beágyazott Projekt Felfüggesztése/Folytatása

source: Game running not embedded.
hu: A futó játék nincs beágyazva.

source: Press play to start the game.
hu: A játék indításához kattintson az indítás gombra.

source: Game embedding not available on your OS.
hu: Játék beágyazás nem elérhető ezen a rendszeren.

source: Game embedding not available for the Display Server: '%s'. Display Server can be modified in the Project Settings (Display > Display Server > Driver).
hu: Játék beágyazás nem elérhető a Megjelenítő Szerverhez: "%s". A Megjelenítő Szerver módosítható a Projekt Beállításokban (Megjelenítés > Megjelenítő Szerver > Meghajtóprogram).

source: Game embedding not available when the game starts minimized.
hu: Játék beágyazás nem elérhető, ha a játék kisméretűként indul.

source: Consider overriding the window mode project setting with the editor feature tag to Windowed to use game embedding while leaving the exported project intact.
hu: A játék beágyazáshoz átállíthatja az ablakbeállítás projekt tulajdonságot Ablakosra a szerkesztő funkciócímkéjével, ezzel megőrizve az exportált projekt épségét.

source: Game embedding not available when the game starts maximized.
hu: Játék beágyazás nem elérhető, ha a játék maximalizált méretben indul el.

source: Game embedding not available when the game starts in fullscreen.
hu: Játék beágyazás nem elérhető, ha a játék teljes képernyős módban indul el.

source: Game embedding not available in single window mode.
hu: Játék beágyazás nem elérhető egyablakos módban.

source: Game embedding not available when the game starts in headless mode.
hu: Játék beágyazás nem elérhető, ha a játék headless módban indul el.

source: Unmute game audio.
hu: Játék audió némítás feloldása.

source: Mute game audio.
hu: Játék audió némítása.

source: Suspend
hu: Felfüggesztés

source: Force pause at SceneTree level. Stops all processing, but you can still interact with the project.
hu: Kényszerített szünet a SceneTree szintjén. Minden feldolgozást megállít, de továbbra is használható a projekt.

source: Speed State
hu: Sebesség Állapota

source: Allow game input.
hu: Játékbemenet engedélyezése.

source: Disable game input and allow to select Node2Ds, Controls, and manipulate the 2D camera.
hu: Játékbemenet letiltása és Node2D, Control kijelölésésének, valamint a 2D kamera manipulálásának engedélyezése.

source: Disable game input and allow to select Node3Ds and manipulate the 3D camera.
hu: Játékbemenet letiltása és Node3D kijelölésének, valamint a 3D kamera manipulálásának engedélyezése.

source: Reset 2D Camera
hu: 2D Kamera Alaphelyzetbe

source: Reset 3D Camera
hu: 3D Kamera Alaphelyzetbe

source: Manipulate In-Game
hu: Játékbeli Manipuláció

source: Manipulate From Editors
hu: Manipulálás Szerkesztőkből

source: Embed Game on Next Play
hu: Játék Beágyazása a Következő Indításkor

source: Make Game Workspace Floating on Next Play
hu: Játék Munkatér Lebegtetése a Következő Indításkor

source: Embedded Window Sizing
hu: Beágyazott Ablak Méretezés

source: Embedded game size is based on project settings. The 'Keep Aspect' mode is used when the Game Workspace is smaller than the desired size.
hu: A beágyazott játék mérete a projek beállításoktól függ. A "Képarány Megtartása" módot az elvárt méretnél kisebb Játék Munkatér esetén használjuk.

source: Keep the aspect ratio of the embedded game.
hu: A beágyazott játék képarányának megtartása.

source: Stretch to Fit
hu: Rugalmas Igazítás

source: Embedded game size stretches to fit the Game Workspace.
hu: A beágyazott játék rugalmasan illeszkedik a Játék Munkatér méretéhez.

source: Clear All
hu: Mind Bezárása

source: Space-separated arguments, example: host player1 blue
hu: Szóközzel elválasztott argumentumok, például: host player1 blue

source: Comma-separated tags, example: demo, steam, event
hu: Vesszővel elválasztott címkék, például: demo, steam, event

source: Enable Multiple Instances
hu: Több Példány Engedélyezése

source: Override Main Run Args
hu: Fő Futtatási Arg-ok Felülírása

source: Launch Arguments
hu: Indítási Argumentumok

source: Move Origin to Geometric Center
hu: Eredet a Geometrikus Középpontba

source: Create Polygon
hu: Sokszög létrehozása

source: Edit points. LMB: Move Point RMB: Erase Point
hu: Pontok szerkesztése Bal Egérgomb: Pont mozgatása Jobb Egérgomb: Pont törlése

source: Move center of gravity to geometric center.
hu: A gravitációs középpont geometrikus középpontba helyezése.

source: Edit Polygon
hu: Sokszög szerkesztése

source: Insert Point
hu: Pont Beszúrása

source: Edit Polygon (Remove Point)
hu: Sokszög szerkesztése (pont eltávolítása)

source: Remove Polygon And Point
hu: Sokszög és pont eltávolítása

source: Snap Camera2D Limits to the Viewport
hu: Camera2D Határok Betekintőhöz illesztése

source: Snap the Limits to the Viewport
hu: Határok Betekintőhöz Illesztése

source: Create Occluder Polygon
hu: Árnyékoló Sokszög Létrehozása

source: Generate Visibility Rect
hu: Láthatósági Téglalap Generálása

source: Load Emission Mask
hu: Kibocsátási Maszk Betöltése

source: Solid Pixels
hu: Tömör Pixelek

source: Border Pixels
hu: Szegélypixelek

source: Loading emission mask requires ParticleProcessMaterial.
hu: Az emissziós maszk betöltése ParticleProcessMaterial-t igényel.

source: Failed to convert mask texture to RGBA8.
hu: A maszk textúra RGBA8-ra konvertálása sikertelen.

source: Mask texture has an invalid size.
hu: A maszk textúra mérete érvénytelen.

source: Failed to convert direction texture to RGBA8.
hu: Az iránytextúra RGBA8-ra konvertálása sikertelen.

source: Direction texture has an invalid size. It must have the same size as the mask texture.
hu: Az iránytextúra mérete érvénytelen. Mérete meg kell egyezzen a maszk textúráéval.

source: Convert to CPUParticles2D
hu: Konvertálás CPUParticles2D-re

source: Generation Time (sec):
hu: Generálási Idő (mp):

source: Remove Point from Curve
hu: Pont Eltávolítása Görbéről

source: Remove Out-Control from Curve
hu: Ki-Vezérlő Eltávolítása Görbéből

source: Remove In-Control from Curve
hu: Be-Vezérlő Eltávolítása Görbéből

source: Move Point in Curve
hu: Pont Mozgatása a Görbén

source: Add Point to Curve
hu: Pont Hozzáadása a Görbéhez

source: Split Curve
hu: Görbe Felosztása

source: Move In-Control in Curve
hu: Be-Vezérlő Mozgatása a Görbén

source: Move Out-Control in Curve
hu: Ki-Vezérlő Mozgatása a Görbén

source: Right Click: Delete Point
hu: Jobb Kattintás: Pont Törlése

source: Select Control Points (Shift+Drag)
hu: Vezérlőpontok Kiválasztása (Shift + Húzás)

source: Delete Point
hu: Pont Törlése

source: Close Curve
hu: Görbe Lezárása

source: Please Confirm...
hu: Kérjük erősítse meg...

source: Mirror Handle Angles
hu: Fogantyú Szögének Tükrözése

source: Mirror Handle Lengths
hu: Fogantyú Hosszok Tükrözése

source: Set Handle
hu: Fogantyú Beállítása

source: The skeleton property of the Polygon2D does not point to a Skeleton2D node
hu: A Polygon2D váz tulajdonsága nem Skeleton2D node-ra mutat

source: Sync Bones
hu: Csontok szinkronizálása

source: Create UV Map
hu: UV Térkép Létrehozása

source: Polygon 2D has internal vertices, so it can no longer be edited in the viewport.
hu: A Polygon2D belső csúcsokkal rendelkezik, ezért a betekintőben már nem módosítható.

source: Create Polygon & UV
hu: Sokszög és UV létrehozása

source: Create Internal Vertex
hu: Belső csúcspont létrehozása

source: Remove Internal Vertex
hu: Belső csúcspont eltávolítása

source: Invalid Polygon (need 3 different vertices)
hu: Érvénytelen Sokszög (3 különböző csúcsra van szükség)

source: Add Custom Polygon
hu: Egyéni sokszög hozzáadása

source: Remove Custom Polygon
hu: Egyéni sokszög eltávolítása

source: Transform UV Map
hu: UV Térkép Transzformálása

source: Transform Polygon
hu: Sokszög átalakítása

source: Paint Bone Weights
hu: Csont Súlyok Festése

source: Points
hu: Pontok

source: Polygons
hu: Sokszögek

source: Bones
hu: Csontok

source: Move Polygon
hu: Sokszög Mozgatása

source: Rotate Polygon
hu: Sokszög Forgatása

source: Scale Polygon
hu: Sokszög Skálázása

source: Create a custom polygon. Enables custom polygon rendering.
hu: Egyedi sokszög létrehozása. Bekapcsolja az egyedi sokszög renderelést.

source: Remove a custom polygon. If none remain, custom polygon rendering is disabled.
hu: Eltávolít egy egyedi sokszöget. Ha nincs több, akkor az egyedi sokszög renderelés kikapcsolódik.

source: Paint weights with specified intensity.
hu: Súlyok adott erősségűre festése.

source: Unpaint weights with specified intensity.
hu: Adott erősségű súlyok festésének visszavonása.

source: Strength
hu: Erő

source: Radius:
hu: Sugár:

source: Copy Polygon to UV
hu: Sokszög UV-ba másolása

source: Copy UV to Polygon
hu: UV Másolása Sokszögbe

source: Clear UV
hu: UV Törlése

source: Grid Settings
hu: Rács beállításai

source: Snap
hu: Illesztés

source: Enable Snap
hu: Illesztés Engedélyezése

source: Grid
hu: Rács

source: Show Grid
hu: Rács Megjelenítése

source: Configure Grid:
hu: Rács beállítása:

source: Grid Offset X:
hu: Rács X eltolása:

source: Grid Offset Y:
hu: Rács Y eltolása:

source: Grid Step X:
hu: Rács Beosztás X:

source: Grid Step Y:
hu: Rács Beosztás Y:

source: Sync Bones to Polygon
hu: Csontok Szinkronizálása Sokszögre

source: This skeleton has no bones, create some children Bone2D nodes.
hu: Ennek a váznak nincsenek csontjai, hozzon létre gyermek Bone2D node csontokat.

source: Set Rest Pose to Bones
hu: Pihenő Póz Beállítása Csontokhoz

source: Create Rest Pose from Bones
hu: Pihenő Póz Létrehozása Csontokból

source: MeshInstance2D Preview
hu: MeshInstance2D Előnézet

source: Create Polygon2D
hu: Polygon2D Létrehozása

source: Polygon2D Preview
hu: Polygon2D Előnézet

source: Create CollisionPolygon2D
hu: CollisionPolygon2D Létrehozása

source: CollisionPolygon2D Preview
hu: CollisionPolygon2D Előnézet

source: Create LightOccluder2D
hu: LightOccluder2D Létrehozása

source: LightOccluder2D Preview
hu: LightOccluder2D Előnézet

source: Invalid geometry, can't replace by mesh.
hu: Érvénytelen geometria, mesh alapján nem cserélhető.

source: Invalid geometry, can't create polygon.
hu: Érvénytelen geometria, nem hozható létre sokszög.

source: Convert to Polygon2D
hu: Polygon2D-re Konvertálás

source: Invalid geometry, can't create collision polygon.
hu: Érvénytelen geometria, nem hozható létre az ütközési sokszög.

source: Create CollisionPolygon2D Sibling
hu: CollisionPolygon2D Testvér Létrehozása

source: Invalid geometry, can't create light occluder.
hu: Érvénytelen geometria, az árnyékoló nem hozható létre.

source: Create LightOccluder2D Sibling
hu: LightOccluder2D Testvér Létrehozása

source: Sprite's region needs to be enabled in the inspector.
hu: A sprite területe bekapcsolt állapotban kell legyen az elemzőben.

source: Drag to Resize Region Rect
hu: Húzással Átméretezhető Terület Téglalap

source: Shrink (Pixels):
hu: Zsugorítás (Pixelek):

source: Grow (Pixels):
hu: Növesztés (Pixelek):

source: Update Preview
hu: Előnézet frissítése

source: Settings:
hu: Beállítások:

source: Merge TileSetAtlasSource
hu: TileSetAtlasSource Összevonása

source: Merge (Keep original Atlases)
hu: Összevonás (Eredeti Atlaszok megtartásával)

source: Merge
hu: Összevonás

source: Next Line After Column
hu: Következő Utáni Sor Oszlop

source: Source: %d Atlas coordinates: %s Alternative: 0
hu: Forrás: %d Atlasz koordináták: %s Alternatíva: 0

source: Source: %d Atlas coordinates: %s Alternative: %d
hu: Forrás: %d Atlasz koordináták: %s Alternatíva: %d

source: The selected atlas source has no valid texture. Assign a texture in the TileSet bottom tab.
hu: A kiválasztott atlasz forrásnak nincs érvényes textúrája. Rendeljen hozzá egy textúrát az alsó TileSet fülön.

source: Flip Polygons Vertically
hu: Sokszögek Vertikális Tükrözése

source: Edit points tool
hu: Pontmódosító eszköz

source: Advanced
hu: Speciális

source: Rotate Right
hu: Forgatás jobbra

source: Rotate Left
hu: Forgatás balra

source: Flip Horizontally
hu: Horizontális Tükrözés

source: Flip Vertically
hu: Vertikális Tükrözés

source: Grid Snap
hu: Rácsra Illesztés

source: Subdivision
hu: Felosztás

source: No terrains
hu: Nincsenek terepek

source: No terrain
hu: Nincs terep

source: Painting Terrain Set
hu: Terepkészlet Festése

source: Painting Terrain
hu: Terepfestés

source: Pick
hu: Kiválaszt

source: Drawing Rect:
hu: Rajz Téglalap:

source: Can't rotate patterns when using non-square tile grid.
hu: A mintákat nem lehet forgatni, ha nem négyzetes a csempe rács.

source: No Texture Atlas Source (ID: %d)
hu: Nincs Textúra Atlasz Forrás (ID: %d)

source: Scene Collection Source (ID: %d)
hu: Jelenetgyűjtemény Forrás (ID: %d)

source: Empty Scene Collection Source (ID: %d)
hu: Üres Jelenetgyűjtemény Forrás (ID: %d)

source: Unknown Type Source (ID: %d)
hu: Ismeretlen Típus Forrás (ID: %d)

source: The selected scene collection source has no scenes. Add scenes in the TileSet bottom tab.
hu: A kiválasztott jelenetgyűjtemény forrásban nincsenek jelenetek. Adjon hozzá jeleneteket az alsó TileSet fülön.

source: Bucket Tool
hu: Vödör Eszköz

source: Alternatively hold %s with other tools to pick tile.
hu: Alternatívaként %s nyomvatartása mellett más eszközökkel is választhat csempét.

source: Alternatively use RMB to erase tiles.
hu: Alternatívaként RMB használható a csempék törléséhez.

source: Erase
hu: Törlés

source: Flip Tile Vertically
hu: Csempe Horizontális Tükrözése

source: Modifies the chance of painting nothing instead of a randomly selected tile.
hu: Módosítja annak az esélyét, hogy véletlenszerű helyett üres csempét fest.

source: Tiles
hu: Csempék

source: This TileMap's TileSet has no Tile Source configured. Go to the TileSet bottom panel to add one.
hu: A TileMap-hez tartozó TileSet-nek nincs beállított forrása. Az alsó TileSet panelet adjon hozzá egyet.

source: Sort by ID (Ascending)
hu: ID sorrend (Növekvő)

source: Sort by ID (Descending)
hu: ID sorrend (Csökkenő)

source: Patterns
hu: Minták

source: Drag and drop or paste a TileMap selection here to store a pattern.
hu: Minta tárolásához húzzon rá vagy illesszen be egy TileMap szelekciót.

source: Matches Corners and Sides
hu: Sarkokhoz és Oldalakhoz Igazítás

source: Terrain Set %d (%s)
hu: Terepkészlet %d (%s)

source: Connect mode: paints a terrain, then connects it with the surrounding tiles with the same terrain.
hu: Kapcsolási mód: terepet fest és összekapcsolja az ugyanolyan környező terep csempékkel.

source: Path mode: paints a terrain, then connects it to the previous tile painted within the same stroke.
hu: Útvonal mód: terepet fest és összekapcsolja az előző csempével, ami ugyanazon mozdulattal készült.

source: Terrains
hu: Terepek

source: Extract TileMap layers as individual TileMapLayer nodes
hu: TileMap rétegek kicsomagolása TileMapLayer node-okként

source: Can't edit multiple layers at once.
hu: Egyszerre több réteg módosítása nem lehetséges.

source: The selected TileMap has no layer to edit.
hu: A kiválasztott TileMap-nek nincsenek rétegei.

source: The edited layer is disabled or invisible
hu: A módosított réteg le van tiltva vagy láthatatlan
