Repository: zhangjiangen11/godot
Catalog: editor/translations/editor/*.po
Languages: hu

source: Unauthorized
hu: Nem engedélyezett

source: Out of memory
hu: Nincs elég memória

source: File: Bad drive
hu: Fájl: Hibás meghajtó

source: File: Bad path
hu: Fájl: Hibás útvonal

source: File: Permission denied
hu: Fájl: Nem engedélyezett

source: File unrecognized
hu: Ismeretlen fájl

source: File corrupt
hu: Sérült fájl

source: Can't write database
hu: Nem lehet írni az adatbázisba

source: Cyclic link detected
hu: Ciklikus hivatkozás érzékelve

source: Busy
hu: Foglalt

source: Skip
hu: Kihagyás

source: Help
hu: Súgó

source: Bug
hu: Hiba

source: Printer on fire
hu: Ég a nyomtató

source: Physical
hu: Fizikai

source: Left Mouse Button
hu: Bal egérgomb

source: Right Mouse Button
hu: Jobb egérgomb

source: Middle Mouse Button
hu: Középső egérgomb

source: Mouse Wheel Up
hu: Egérgörgő fel

source: Mouse Wheel Down
hu: Egérgörgő le

source: Mouse Wheel Left
hu: Egérgörgő bal

source: Mouse Wheel Right
hu: Egérgörgő jobb

source: Mouse Thumb Button 1
hu: Oldalsó egérgomb 1

source: Mouse Thumb Button 2
hu: Oldalsó egérgomb 2

source: Button
hu: Gomb

source: Double Click
hu: Dupla kattintás

source: Mouse motion at position (%s) with velocity (%s)
hu: Egérmozgás (%s) pozíciónál, (%s) gyorsasággal

source: Left Stick X-Axis, Joystick 0 X-Axis
hu: Bal Analóg Kar X-tengely, Joystick 0 X-tengely

source: Left Stick Y-Axis, Joystick 0 Y-Axis
hu: Bal Analóg Kar Y-tengely, Joystick 0 Y-tengely

source: Right Stick X-Axis, Joystick 1 X-Axis
hu: Jobb Analóg Kar X-tengely, Joystick 1 X-tengely

source: Right Stick Y-Axis, Joystick 1 Y-Axis
hu: Jobb Analóg Kar Y-tengely, Joystick 1 Y-tengely

source: Joystick 2 X-Axis, Left Trigger, Sony L2, Xbox LT
hu: Joystick 2 X-tengely, Bal Ravasz, Sony L2, Xbox LT

source: Joystick 2 Y-Axis, Right Trigger, Sony R2, Xbox RT
hu: Joystick 2 Y-tengely, Jobb Ravasz, Sony R2, Xbox RT

source: Joystick 3 X-Axis
hu: Joystick 3 X-tengely

source: Joystick 3 Y-Axis
hu: Joystick 3 Y-tengely

source: Joystick 4 X-Axis
hu: Joystick 4 X-tengely

source: Joystick 4 Y-Axis
hu: Joystick 4 Y-tengely

source: Unknown Joypad Axis
hu: Ismeretlen Joystick tengely

source: Joypad Motion on Axis %d (%s) with Value %.2f
hu: Joystick Mozgatás a(z) %d (%s) tengelyen, ennyivel: %.2f

source: Bottom Action, Sony Cross, Xbox A, Nintendo B
hu: Alsó Akciógomb, Sony Kereszt, Xbox A, Nintendo B

source: Right Action, Sony Circle, Xbox B, Nintendo A
hu: Jobb Akciógomb, Sony Kör, Xbox B, Nintendo A

source: Left Action, Sony Square, Xbox X, Nintendo Y
hu: Bal Akciógomb, Sony Négyzet, Xbox X, Nintendo Y

source: Top Action, Sony Triangle, Xbox Y, Nintendo X
hu: Felső Akciógomb, Sony Háromszög, Xbox Y, Nintendo X

source: Back, Sony Select, Xbox Back, Nintendo -
hu: Vissza, Sony Select, Xbox Back, Nintendo -

source: Guide, Sony PS, Xbox Home
hu: Segítség Gomb, Sony PS, Xbox Home

source: Start, Xbox Menu, Nintendo +
hu: Start, Xbox Menü, Nintendo +

source: Left Stick, Sony L3, Xbox L/LS
hu: Bal Kar, Sony L3, Xbox L/LS

source: Right Stick, Sony R3, Xbox R/RS
hu: Jobb Kar, Sony R3, Xbox R/RS

source: Left Shoulder, Sony L1, Xbox LB
hu: Bal Hátsó Gomb, Sony L1, Xbox LB

source: Right Shoulder, Sony R1, Xbox RB
hu: Jobb Hátsó Gomb, Sony R1, Xbox RB

source: D-pad Up
hu: D-pad Fel

source: D-pad Down
hu: D-pad Le

source: D-pad Left
hu: D-pad Bal

source: D-pad Right
hu: D-pad Jobb

source: Xbox Paddle 1
hu: Xbox Pedál 1

source: Xbox Paddle 2
hu: Xbox pedál 2

source: Xbox Paddle 3
hu: Xbox pedál 3

source: Xbox Paddle 4
hu: Xbox pedál 4

source: PS4/5 Touchpad
hu: PS4/5 Érintőpad

source: Joypad Button %d
hu: Joypad Gomb %d

source: Pressure:
hu: Nyomás:

source: canceled
hu: Mégse

source: touched
hu: megérintve

source: released
hu: elengedve

source: Screen %s at (%s) with %s touch points
hu: Képernyő %s a (%s) helyen, %s érintési pontban

source: Screen dragged with %s touch points at position (%s) with velocity of (%s)
hu: A Képernyőt húzták %s érintési pontban, (%s) pozícióban, (%s) sebességgel

source: Magnify Gesture at (%s) with factor %s
hu: Nagyító Kézmozdulat a (%s) helyen, %s tényezővel

source: Pan Gesture at (%s) with delta (%s)
hu: Pásztázás Kézmozdulat a (%s) pontban, (%s) delta értékkel

source: MIDI Input on Channel=%s Message=%s
hu: MIDI Bevitel: Csatorna=%s Üzenet=%s

source: Input Event with Shortcut=%s
hu: Bemenet Esemény: Gyorsbillentyű=%s

source: or
hu: vagy

source: Action has no bound inputs
hu: A műveletnek nincsenek hozzárendelt bemenetei

source: Accept
hu: Elfogad

source: Select
hu: Kiválaszt

source: Cancel
hu: Mégse

source: Focus Next
hu: Fókuszálás a Következőre

source: Focus Prev
hu: Fókuszálás az Előzőre

source: Left
hu: Bal

source: Right
hu: Jobb

source: Up
hu: Fel

source: Down
hu: Le

source: Page Up
hu: Lap fel

source: Page Down
hu: Lap Le

source: End
hu: Vége

source: Cut
hu: Kivágás

source: Copy
hu: Másolás

source: Paste
hu: Beillesztés

source: Undo
hu: Visszavonás

source: Redo
hu: Újra

source: Completion Query
hu: Kódkiegészítés

source: New Line
hu: Új Sor

source: New Blank Line
hu: Új Üres Sor

source: New Line Above
hu: Új Sor Felette

source: Indent
hu: Behúzás Növelése

source: Dedent
hu: Behúzás Csökkentése

source: Backspace Word
hu: Szó Törlése Balra

source: Backspace all to Left
hu: Törlés a Sor Elejéig

source: Delete
hu: Törlés

source: Delete Word
hu: Szó Törlése Jobbra

source: Delete all to Right
hu: Sor Törlése Jobbra

source: Caret Left
hu: Kurzor Balra

source: Caret Word Left
hu: Kurzor Szó Elejére

source: Caret Right
hu: Kurzor Jobbra

source: Caret Word Right
hu: Kurzor Szó Végére

source: Caret Up
hu: Kurzor Fel

source: Caret Down
hu: Kurzor Le

source: Caret Line Start
hu: Kurzor a Sor Elejére

source: Caret Line End
hu: Kurzor a Sor Végére

source: Caret Page Up
hu: Kurzor Egy Oldallal Feljebb

source: Caret Page Down
hu: Kurzor Egy Oldallal Lejjebb

source: Caret Document Start
hu: Kurzor a Dokumentum Elejére

source: Caret Document End
hu: Kurzor a Dokumentum Végére

source: Caret Add Below
hu: Hiányjelet Hozzáadni Alatta

source: Caret Add Above
hu: Hiányjelet Adj Felül

source: Scroll Up
hu: Görgő Fel

source: Scroll Down
hu: Görgő Le

source: Select All
hu: Összes Kijelölése

source: Select Word Under Caret
hu: Szó Kijelölése a Kurzor Alatt

source: Add Selection for Next Occurrence
hu: Kijelölés Hozzáadása Következő Esetnél

source: Skip Selection for Next Occurrence
hu: Kijelölés kihagyása a következő esetnél

source: Clear Carets and Selection
hu: Kijelölés és Keretezések törlése

source: Toggle Insert Mode
hu: Beillesztés Mód Be-/Kikapcsolása

source: Submit Text
hu: Szöveg Elküldése

source: Duplicate Nodes
hu: Node-ok duplikálása

source: Delete Nodes
hu: Node-ok törlése

source: Follow Output Port Connection
hu: Kimeneti Port Kapcsolat Követése

source: Go Up One Level
hu: Ugrás Egy Szinttel Feljebb

source: Refresh
hu: Frissítés

source: Show Hidden
hu: Rejtettek megjelenítése

source: Focus Path
hu: Elérési Út Fókuszálása

source: Swap Input Direction
hu: Irányok Felcserélése

source: Start Unicode Character Input
hu: Unicode karakterbevitele indítása

source: Accessibility: Keyboard Drag and Drop
hu: Akadálymentesítés: Billentyűzet Húzd és Vidd

source: Invalid input %d (not passed) in expression
hu: Érvénytelen bemenet '%d' (nem átadott) a kifejezésben

source: self can't be used because instance is null (not passed)
hu: Nem használható self mivel nincs megadva

source: Invalid operands to operator %s, %s and %s.
hu: Érvénytelen operandusok az %s, %s és %s operátorhoz.

source: Invalid index of type %s for base type %s
hu: Érvénytelen %s típusú index %s típusú alaphoz

source: Invalid named index '%s' for base type %s
hu: Érvénytelen nevezett index '%s' %s alaptípushoz

source: Invalid arguments to construct '%s'
hu: Érvénytelen argumentumok a(z) '%s' építőben

source: On call to '%s':
hu: '%s' hívásánál:

source: Built-in script
hu: Beépített program

source: Built-in
hu: Beépített

source: Time:
hu: Idő:

source: Value:
hu: Érték:

source: Update Selected Key Handles
hu: Kiválasztott Kulcsok Frissítése

source: Insert Key Here
hu: Kulcs Beszúrása Ide

source: Duplicate Selected Key(s)
hu: Kiválasztott Kulcs(ok) Megkettőzése

source: Cut Selected Key(s)
hu: Kiválasztott Kulcs(ok) Kivágása

source: Copy Selected Key(s)
hu: Kiválasztott Kulcs(ok) Másolása

source: Paste Key(s)
hu: Kulcs(ok) Beillesztése

source: Delete Selected Key(s)
hu: Kiválasztott Kulcs(ok) Törlése

source: Make Handles Free
hu: Fogópontok szabaddá tétele

source: Make Handles Linear
hu: Fogópontok lineárissá tétele

source: Make Handles Balanced
hu: Fogópontok kiegyensúlyozása

source: Make Handles Mirrored
hu: Fogópontok tükrözése

source: Make Handles Balanced (Auto Tangent)
hu: Fogópontok kiegyensúlyozása (automatikus érintő)

source: Make Handles Mirrored (Auto Tangent)
hu: Fogópontok tükrözése (automatikus érintő)

source: Add Bezier Point
hu: Bézier Pont Hozzáadása

source: Move Bezier Points
hu: Bézier Pontok Mozgatása

source: Animation Duplicate Keys
hu: Animáció - Kulcsok Megkettőzése

source: Animation Cut Keys
hu: Animáció - Kulcsok Kivágása

source: Animation Paste Keys
hu: Animáció - Kulcsok Beillesztése

source: Animation Delete Keys
hu: Animáció - Kulcsok Törlése

source: Focus
hu: Fókusz

source: Select All Keys
hu: Összes Kulcs Kiválasztása

source: Deselect All Keys
hu: Összes Kulcs Kiválasztásának Megszüntetése

source: Add Animation
hu: Animáció Hozzáadása

source: Add %s
hu: %s Hozzáadása

source: Load...
hu: Betöltés...

source: Move Node Point
hu: Node Pont Mozgatás

source: Change BlendSpace1D Labels
hu: BlendSpace1D Címkék Változtatása

source: This type of node can't be used. Only animation nodes are allowed.
hu: Ez a node típus nem használható. Csak az animációs node-ok engedélyezettek.

source: This type of node can't be used. Only root nodes are allowed.
hu: Ez a node típus nem használható. Csak gyökér node-ok engedélyezettek.

source: Add Node Point
hu: Node Pont Hozzáadás

source: Add Animation Point
hu: Animáció Pont Hozzáadás

source: Remove BlendSpace1D Point
hu: BlendSpace1D Pont Eltávolítás

source: Move BlendSpace1D Node Point
hu: BlendSpace1D Node Pont Mozgatás

source: Continuous
hu: Folyamatos

source: Discrete
hu: Pontozott

source: Capture
hu: Felvétel

source: Select and move points. RMB: Create point at position clicked. Shift+LMB+Drag: Set the blending position within the space.
hu: Válassza ki és mozgassa a pontokat. RMB: Pont létrehozása a klikk pozícióján. Shift+LMB+Drag: A keverési pozíció térbeli beállítása.

source: Create points.
hu: Pontok létrehozása.

source: Set the blending position within the space.
hu: A keverési pozíció térbeli beállítása.

source: Erase points.
hu: Pontok törlése.

source: Enable snap and show grid.
hu: Illesztés engedélyezése és rács megjelenítése.

source: Blend:
hu: Keverés:

source: Point
hu: Pont

source: Open Editor
hu: Szerkesztő megnyitása

source: Value
hu: Érték

source: Open Animation Node
hu: Animáció Node Megnyitása

source: Triangle already exists.
hu: A háromszög már létezik.

source: Add Triangle
hu: Háromszög hozzáadása

source: Change BlendSpace2D Labels
hu: BlendSpace2D Címkék Változtatása

source: Remove BlendSpace2D Point
hu: BlendSpace2D Pont Eltávolítás

source: Remove BlendSpace2D Triangle
hu: BlendSpace2D Háromszög Eltávolítás

source: No triangles exist, so no blending can take place.
hu: Nincsenek háromszögek, így nem történhet keverés.

source: Toggle Auto Triangles
hu: Automatikus háromszögek be- és kikapcsolása

source: Create triangles by connecting points.
hu: Háromszög készítés pontok összekötésével.

source: Erase points and triangles.
hu: Pontok és háromszögek törlése.

source: Generate blend triangles automatically (instead of manually)
hu: Keverési háromszögek generálása automatikusan (kézi helyett)

source: Edit Filters
hu: Szűrők Szerkesztése

source: Output node can't be added to the blend tree.
hu: Kimeneti node nem adható hozzá a keverési fához.

source: Add Node to BlendTree
hu: Node Hozzáadása a BlendTree-hez

source: Node Moved
hu: Node Áthelyezve

source: Unable to connect, port may be in use or connection may be invalid.
hu: Nem sikerült csatlakozni, a port használatban van vagy a kapcsolat érvénytelen.

source: Nodes Connected
hu: Node-ok Csatlakoztatva

source: Nodes Disconnected
hu: Node-ok Lecsatlakoztatva

source: Set Animation
hu: Animáció Beállítása

source: Delete Node
hu: Node Törlése

source: Delete Node(s)
hu: Node(-ok) törlése

source: Toggle Filter On/Off
hu: Szűrő be- és kikapcsolása

source: Change Filter
hu: Szűrő módosítása

source: Animation player has no valid root node path, so unable to retrieve track names.
hu: Az animáció lejátszónak nincs érvényes gyökér node útvonala, ezért a sávneveket nem lehet lekérdezni.

source: Anim Clips
hu: Animáció klipek

source: Audio Clips
hu: Audió klipek

source: Functions
hu: Függvények

source: Inspect Filtered Tracks:
hu: Szűrt Sávok Ellenőrzése:

source: Edit Filtered Tracks:
hu: Szűrt Sávok Módosítása:

source: Node Renamed
hu: Node átnevezve

source: Add Node...
hu: Node hozzáadása...

source: Enable Filtering
hu: Szűrés engedélyezése

source: Invert
hu: Invertálás

source: Clear
hu: Töröl

source: Set Custom Timeline from Marker
hu: Egyedi Idővonal Beállítás Jelzőből

source: End Marker
hu: Végjelző

source: Enter a library name.
hu: Adjon meg egy könyvtárnevet.

source: Global library will be created.
hu: Globális könyvár fog létrejönni.

source: Load Animation
hu: Animáció Betöltése

source: Make Animation Library Unique: %s
hu: Animációs Könyvtár Egyedivé Tétele: %s

source: Save Animation library to File: %s
hu: Animáció könyvtár Fájlba Mentése: %s

source: The file you selected is an imported scene from a 3D model such as glTF or FBX. In Godot, 3D models can be imported as either scenes or animation libraries, which is why they show up here. If you want to use animations from this 3D model, open the Advanced Import Settings dialog and save the animations using Actions... → Set Animation Save Paths, or import the whole scene as a single AnimationLibrary in the Import dock.
hu: A kiválasztott fájl egy 3D modellből - például glTF vagy FBX - importált jelenet. A Godot szoftverben 3D modellek importálhatóak jelenetként vagy animáció könyvtárként is, ezért kerülnek ide. Ha animációt szeretne használni ebből a 3D modellből, nyissa meg a Speciális Import Beállítások ablakot és mentse el az animációkat a Műveletek... → Animáció Mentés Útvonala segítségével, vagy importálja a teljes jelenetet egyetlen AnimationLibrary-ként az Import dokkon.

source: The file you selected is not a valid AnimationLibrary. If the animations you want are inside of this file, save them to a separate file first.
hu: A kiválasztott fájl nem egy érvényes AnimationLibrary. Ha a szükséges animációk ebben a fájlban vannak, akkor mentse el őket külön fájlba.

source: Some of the selected libraries were already added to the mixer.
hu: A kiválasztott könyvtárak között néhány már szerepel a keverőben.

source: Some of the selected animations were already added to the library.
hu: A kiválasztott animációk között néhány már szerepel a könyvtárban.

source: Animation Name:
hu: Animáció Neve:

source: Pasted Animation
hu: Animáció Beillesztve

source: Save
hu: Mentés

source: Save As
hu: Mentés Másként

source: Make Unique
hu: Egyedivé tétel

source: Open in Inspector
hu: Megnyitás az Elemzőben

source: [built-in]
hu: [beépített]

source: [foreign]
hu: [külső]

source: Resource
hu: Erőforrás

source: Error:
hu: Hiba:

source: Toggle Autoplay
hu: Automatikus Lejátszás Váltása

source: Create New Animation
hu: Új Animáció Létrehozása

source: New Animation Name:
hu: Új Animáció Neve:

source: Rename Animation
hu: Animáció Átnevezése

source: Change Animation Name:
hu: Animáció Nevének Megváltoztatása:

source: Remove Animation
hu: Animáció Eltávolítása

source: Invalid animation name!
hu: Érvénytelen animáció név!

source: Duplicate Animation
hu: Animáció Megkettőzése

source: Blend Next Changed
hu: Következő Megváltozott Keverése

source: Change Blend Time
hu: Keverési Idő Módosítása

source: Onion skinning requires a RESET animation.
hu: Hagymahéjhoz RESET animációra van szükség.

source: Animation
hu: Animáció

source: Animation position (in seconds).
hu: Animáció pozíció (másodpercekben).

source: Scale animation playback globally for the node.
hu: Animáció lejátszás skálázása globálisan a Node-nak.

source: Animation Tools
hu: Animációs Eszközök

source: New...
hu: Új...

source: Duplicate...
hu: Megkettőzés...

source: Rename...
hu: Átnevezés...

source: Edit Transitions...
hu: Átmenetek szerkesztése...

source: Remove
hu: Eltávolítás

source: Display list of animations in player.
hu: A lejátszóban lévő animációk listájának megjelenítése.

source: Autoplay on Load
hu: Lejátszás Betöltéskor

source: Enable Onion Skinning
hu: Másolópapír Mód Bekapcsolása

source: Onion Skinning Options
hu: Hagymahéj Beállítások

source: Directions
hu: Irányok

source: Past
hu: Múlt

source: Future
hu: Jövő

source: Depth
hu: Mélység

source: 1 step
hu: 1 lépés

source: 2 steps
hu: 2 lépés

source: 3 steps
hu: 3 lépés

source: Differences Only
hu: Csak A Különbségek

source: Force White Modulate
hu: Fehérmoduláció Kierőltetése

source: Include Gizmos (3D)
hu: Kihatás Gizmókra Is (3D)

source: Pin AnimationPlayer
hu: AnimationPlayer Kitűzése

source: Close
hu: Bezárás

source: Error!
hu: Hiba!

source: Cross-Animation Blend Times
hu: Animációk Közötti Keverési Idők

source: Blend Times:
hu: Keverési Idők:

source: Next (Auto Queue):
hu: Következő (Auto Sor):

source: Move Node
hu: Node áthelyezése

source: Transition exists!
hu: Az átmenet létezik!

source: Cannot transition to self!
hu: Nem tűnhet át saját magába!

source: Cannot transition to "Start"!
hu: Nem tűnhet át "Start"-hoz!

source: Cannot transition from "End"!
hu: Nem tűnhet át "End"-ből!

source: Play/Travel to %s
hu: Lejátszás/Mozgás ide: %s

source: Add Transition
hu: Átmenet hozzáadása

source: Immediate
hu: Azonnal

source: Sync
hu: Szinkronizálás

source: At End
hu: A végén

source: Travel
hu: Utazás

source: No playback resource set at path: %s.
hu: Nincs lejátszási erőforrás az útvonalon: %s.

source: Node Removed
hu: Node eltávolítva

source: Transition Removed
hu: Átmenet eltávolítva

source: Select and move nodes. RMB: Add node at position clicked. Shift+LMB+Drag: Connects the selected node with another node or creates a new node if you select an area without nodes.
hu: Válassza ki és mozgassa a node-okat. RMB: Node létrehozása a klikk pozícióján. Shift+LMB+Drag: Összekapcsolja a kiválasztott node-ot egy másik node-dal vagy létrehoz egy új node-ot ha a kiválasztott területen nincs node.

source: Create new nodes.
hu: Új node-ok létrehozása.

source: Connect nodes.
hu: Node-ok csatlakoztatása.

source: Remove selected node or transition.
hu: Kiválasztott node vagy átmenet eltávolítása.

source: Transition:
hu: Átmenet:

source: New Transitions Should Auto Advance
hu: Új Áttűnések Automatikusan Haladjanak

source: Play Mode:
hu: Lejátszási mód:

source: Animation Change Transition
hu: Animáció Átmenet Változtatása

source: Animation Change Position3D
hu: Animáció Position3D Módosítása

source: Animation Change Rotation3D
hu: Animáció Rotation3D Módosítása

source: Animation Change Scale3D
hu: Animáció Scale3D Módosítása

source: Animation Change Keyframe Value
hu: Animáció Kulcskép Érték Módosítása

source: Change Animation Length
hu: Animáció Hosszának Változtatása

source: Change Animation Loop
hu: Animáció Ismétlésének Változtatása

source: Can't change loop mode on animation instanced from an imported scene. To change this animation's loop mode, navigate to the scene's Advanced Import settings and select the animation. You can then change the loop mode from the inspector menu.
hu: Nem lehet megváltoztatni az ismétlési módot egy importált jelenetből származó példányosított animáción. Az animáció ismétlési módjának módosításához lépj a jelenet speciális importálási beállításaihoz, és válaszd ki az animációt. Ezután az elemző menüben módosíthatod az ismétlési módot.

source: Can't change loop mode on animation instanced from an imported resource.
hu: Nem lehet megváltoztatni az ismétlési módot egy importált erőforrásból származó példányosított animáción.

source: Can't change loop mode on animation embedded in another scene. You must open this scene and change the animation's loop mode from there.
hu: Nem lehet megváltoztatni az ismétlési módot egy másik jelenetbe ágyazott animáción. Ehhez nyisd meg a jelenetet, és ott módosítsd az animáció ismétlési módját.

source: Can't change loop mode on animation embedded in another resource.
hu: Egy másik erőforrásba ágyazott animáció ciklikusságán nem lehet módosítani.

source: Animation length (frames)
hu: Animáció hossza (képkockák)

source: Animation length (seconds)
hu: Animáció hossza (másodpercek)

source: Filter tracks by entering part of their node name or property.
hu: Sávok szűrése a node neve vagy tulajdonságai alapján.

source: Animation Looping
hu: Animáció Ismétlése

source: Functions:
hu: Függvények:

source: Audio Clips:
hu: Hang Klipek:

source: Change Track Path
hu: Sáv Útvonal Változtatás

source: Toggle this track on/off.
hu: Jelen sáv ki/be kapcsolása.

source: Update Mode (How this property is set)
hu: Frissítés Módja (Hogyan van ez a tulajdonság beállítva)

source: Interpolation Mode
hu: Interpolálás Módja

source: Loop Wrap Mode (Interpolate end with beginning on loop)
hu: Összefűzés Módja (Vége és kezdete interpolálása ismétlés esetén)

source: Remove this track.
hu: Jelen sáv eltávolítása.

source: Time (s):
hu: Idő (mp):

source: Scale:
hu: Skála:

source: Type:
hu: Típus:

source: Easing:
hu: Átmenet:

# Bezier Handle Mode
source: Free
hu: Szabad

source: Toggle Track Enabled
hu: Sáv Engedélyezés Kapcsolása

source: Don't Use Blend
hu: Keverés Tiltása

source: Nearest
hu: Legközelebbi

source: Linear
hu: Lineáris

source: Cubic
hu: Köbös

source: Clamp Loop Interp
hu: Átmenet Nélküli Interpoláció

source: Wrap Loop Interp
hu: Folytatólagos Interpoláció

source: Duplicate Key(s)
hu: Kulcs(ok) Megkettőzése

source: Send Key(s) to RESET
hu: Kulcs(ok) RESET-hez Küldése

source: Delete Key(s)
hu: Kulcs(ok) Törlése

source: Change Animation Update Mode
hu: Animáció Frissítés Módjának Változtatása

source: Change Animation Interpolation Mode
hu: Animáció Interpolálás Módjának Változtatása

source: Change Animation Loop Mode
hu: Animáció Összefűzés Módjának Változtatása

source: Compressed tracks can't be edited or removed. Re-import the animation with compression disabled in order to edit.
hu: Tömörített sávokat nem lehet szerkeszteni vagy törölni. Importálja újra az animációt tömörítás nélkül a szerkesztéshez.

source: Remove Anim Track
hu: Animáció Sáv Eltávolítása

source: Hold Shift when clicking the key icon to skip this dialog.
hu: Shift billentyű + kulcsra kattintás átugorja ezt a párbeszédablakot.

source: Create
hu: Létrehozás

source: node '%s'
hu: '%s' csomópont

source: animation
hu: animáció

source: AnimationPlayer can't animate itself, only other players.
hu: AnimationPlayer nem tudja önmagát animálni, csak más AnimationPlayer elemeket.

source: property '%s'
hu: '%s' tulajdonság

source: Set the default handle mode of new bezier keys.
hu: Beállítja az új bézier kulcsok alapértelmezett kezelési módját.

source: Change Animation Step
hu: Animáció Léptékének Változtatása

source: Rearrange Tracks
hu: Sávok Újrarendezése

source: Add Track
hu: Sáv Hozzáadása

source: Audio tracks can only point to nodes of type: -AudioStreamPlayer -AudioStreamPlayer2D -AudioStreamPlayer3D
hu: Hangsávok csak a következő típusú node-okra mutathatnak: -AudioStreamPlayer -AudioStreamPlayer2D -AudioStreamPlayer3D
