Repository: zhangjiangen11/godot
Catalog: editor/translations/editor/*.po
Languages: hu

source: There are notable differences when using this API with C#. See [url=%s]C# API differences to GDScript[/url] for more information.
hu: Jelentős különbségek vannak ezen API C# változatában. További információk a [url=%s]C# és GDScript API különbségei[/url] oldalon találhatóak.

source: Online Tutorials
hu: Online oktatóanyagok

source: Properties
hu: Tulajdonságok

source: default:
hu: alapértelmezett:

source: Theme Properties
hu: Téma Tulajdonságai

source: Constants
hu: Állandók

source: This theme property may be changed or removed in future versions.
hu: Ez a téma tulajdonság módosulhat vagy törölve is lehet a jövőbeli verziókban.

source: There is currently no description for this theme property.
hu: Jelenleg nincs leírás ehhez a téma tulajdonsághoz.

source: Signals
hu: Jelek

source: This signal may be changed or removed in future versions.
hu: Ez a jel módosulhat vagy törölve is lehet a jövőbeli verziókban.

source: There is currently no description for this signal.
hu: Jelenleg nincs leírás ehhez a jelhez.

source: Enumerations
hu: Felsorolások

source: This enumeration may be changed or removed in future versions.
hu: Ez a felsorolás (enum) módosulhat vagy törölve is lehet a jövőbeli verziókban.

source: This constant may be changed or removed in future versions.
hu: Ez a konstans módosulhat vagy törölve is lehet a jövőbeli verziókban.

source: There is currently no description for this annotation.
hu: Jelenleg nincs leírás ehhez az annotációhoz.

source: Property Descriptions
hu: Tulajdonság leírásai

source: (value)
hu: (érték)

source: This property may be changed or removed in future versions.
hu: Ez a tulajdonság módosulhat vagy törölve is lehet a jövőbeli verziókban.

source: There is currently no description for this property.
hu: Jelenleg nincs leírás ehhez a tulajdonsághoz.

source: There is currently no description for this property. Please help us by [color=$color][url=$url]contributing one[/url][/color]!
hu: Ennek a tulajdonságnak jelenleg nincs leírása. Segítsen minket azzal, hogy [color=$color][url=$url]hozzájárul eggyel[/url][/color]!

source: [b]Note:[/b] The returned array is [i]copied[/i] and any changes to it will not update the original property value. See [%s] for more details.
hu: [b]Megjegyzés:[/b] A visszatérési tömb [i]másolat[/i] és a vele végzett módosítások nem frissítik az eredeti értékeket. További információkért lásd: [%s].

source: Editor
hu: Szerkesztő

source: Click to copy.
hu: Kattintson a másoláshoz.

source: This annotation may be changed or removed in future versions.
hu: Ez az annotáció módosulhat vagy törölve is lehet a jövőbeli verziókban.

source: Open
hu: Megnyitás

source: Show in FileSystem
hu: Megjelenítés a fájlrendszerben

source: Open in File Manager
hu: Megnyitás a Fájlkezelőben

source: Class
hu: Osztály

source: Constant
hu: Állandó

source: Metadata
hu: Metaadat

source: Property
hu: Tulajdonság

source: This property can only be set in the Inspector.
hu: Ez a tulajdonság csak a Elemzőben állítható be.

source: Theme Property
hu: Téma tulajdonság

source: Method
hu: Metódus

source: Signal
hu: Jelzés

source: This variable may be changed or removed in future versions.
hu: Ez a változó módosulhat vagy törölve is lehet a jövőbeli verziókban.

source: File
hu: Fájl

source: Path
hu: Útvonal

source: Search
hu: Keresés

source: Hide
hu: Elrejt

source: %d match
hu: %d egyezés

source: %d of %d match
hu: %d egyezés a(z) %d-ból/ből

source: Search Help
hu: Keresés a súgóban

source: Case Sensitive
hu: Pontos Egyezés

source: Show Hierarchy
hu: Hierarchia megjelenítése

source: Display All
hu: Az összes megjelenítése

source: Classes Only
hu: Csak osztályok

source: Methods Only
hu: Csak metódusok

source: Signals Only
hu: Csak jelzések

source: Constants Only
hu: Csak konstansok

source: Properties Only
hu: Csak tulajdonságok

source: Theme Properties Only
hu: Csak tématulajdonságok

source: Member Type
hu: Tag típusa

source: Keywords
hu: Kulcsszavak

source: This class is marked as deprecated.
hu: Ez az osztály elavultnak van megjelölve.

source: This class is marked as experimental.
hu: Ez az osztály kísérletiként van megjelölve.

source: Matches the "%s" keyword.
hu: A "%s" kulcsszónak felel meg.

source: This member is marked as deprecated.
hu: Ez a tag elavultként van megjelölve.

source: This member is marked as experimental.
hu: Ez a tag kísérletiként van megjelölve.

source: This dock can't be closed.
hu: Ezt a dokk nem zárható be.

source: Dock Position
hu: Dokk Pozíció

source: Link to: %s
hu: Symlink ehhez: %s

source: Favorites:
hu: Kedvencek:

source: Favorites
hu: Kedvencek

source: View items as a grid of thumbnails.
hu: Az elemek megtekintése bélyegkép-rácsként.

source: View items as a list.
hu: Elemek megtekintése listaként.

source: Status: Import of file failed. Please fix file and reimport manually.
hu: Állapot: Fájl importálása sikertelen. Javítsa a fájlt majd importálja be újra manuálisan.

source: Importing has been disabled for this file, so it can't be opened for editing.
hu: Az importálás ki van kapcsolva ehhez a fájlhoz, ezért nem lehet megnyitni módosításra.

source: Cannot move/rename resources root.
hu: Az erőforrások gyökere nem mozgatható vagy átnevezhető.

source: Cannot move a folder into itself.
hu: Egy mappa nem helyezhető önmagába.

source: Error moving:
hu: Hiba mozgatáskor:

source: Error duplicating:
hu: Hiba másoláskor:

source: No name provided.
hu: Nincs név megadva.

source: Name contains invalid characters.
hu: A név érvénytelen karaktereket tartalmaz.

source: This filename begins with a dot rendering the file invisible to the editor. If you want to rename it anyway, use your operating system's file manager.
hu: Ez a fájlnév egy ponttal kezdődik, ezért a szerkesztő számára nem látható. Ha ennek ellenére szeretné átnevezni, használja az operációs rendszer fájlkezelőjét.

source: This file extension is not recognized by the editor. If you want to rename it anyway, use your operating system's file manager. After renaming to an unknown extension, the file won't be shown in the editor anymore.
hu: A szerkesztő nem ismeri ezt a fájlkiterjesztést. Ha ennek ellenére szeretné átnevezni, használja az operációs rendszer fájlkezelőjét. Ismeretlen kiterjesztésre átnevezés után a fájl már nem fog megjelenni a szerkesztőben.

source: A file or folder with this name already exists.
hu: Egy fájl vagy mappa már létezik a megadott névvel.

source: The following files or folders conflict with items in the target location '%s':
hu: Az alábbi fájlok vagy mappák ütköznek a célhelyen ("%s") lévő elemekkel:

source: Do you wish to overwrite them or rename the copied files?
hu: Szeretné felülírni őket vagy inkább átnevezné a másolt fájlokat?

source: Do you wish to overwrite them or rename the moved files?
hu: Szeretné felülírni őket vagy inkább átnevezné a mozgatott fájlokat?

source: Couldn't run external program to check for terminal emulator presence: command -v %s
hu: A terminál emulátor meglétéhez használt külső program futtatása nem sikerült: command -v %s

source: Couldn't run external terminal program (error code %d): %s %s Check `filesystem/external_programs/terminal_emulator` and `filesystem/external_programs/terminal_emulator_flags` in the Editor Settings.
hu: A külső terminál futtatása nem sikerült (hibakód %d): %s%s Ellenőrizze a `filesystem/external_programs/terminal_emulator` és `filesystem/external_programs/terminal_emulator_flags` beállításokat a Szerkesztő Beállításokban.

source: Duplicating file:
hu: Fájl másolása:

source: Duplicating folder:
hu: Mappa másolása:

source: Create Folder
hu: Mappa Létrehozása

source: Do you wish to convert these files to %s? (This operation cannot be undone!)
hu: Szeretné konvertálni a fájlokat %s formátumra? (Ez a művelet nem vonható vissza!)

source: New Inherited Scene
hu: Új örökölt Jelenet

source: Open Scenes
hu: Jelenetek megnyitása

source: Run
hu: Futtatás

source: Edit Dependencies...
hu: Függőségek Szerkesztése...

source: View Owners...
hu: Tulajdonosok Megtekintése...

source: Add to Favorites
hu: Hozzáadás kedvencekhez

source: Remove from Favorites
hu: Eltávolítás a kedvencek közül

source: Reimport
hu: Újraimportálás

source: Show in File Manager
hu: Megjelenítés a Fájlkezelőben

source: New Folder...
hu: Új Mappa...

source: New Scene...
hu: Új jelenet...

source: New Script...
hu: Új szkript...

source: New Resource...
hu: Új erőforrás...

source: Sort by Name (Ascending)
hu: Név szerinti Rendezés (Növekvő)

source: Sort by Name (Descending)
hu: Név szerinti Rendezés (Csökkenő)

source: Sort by Type (Ascending)
hu: Típus szerinti Rendezés (Növekvő)

source: Sort by Type (Descending)
hu: Típus szerinti Rendezés (Csökkenő)

source: Sort by Last Modified
hu: Utolsó módosítás szerinti Rendezés

source: Sort by First Modified
hu: Első módosítás szerinti Rendezés

source: Copy Path
hu: Útvonal Másolása

source: Yellow
hu: Sárga

source: Green
hu: Zöld

source: Teal
hu: Kékeszöld

source: Blue
hu: Kék

source: Purple
hu: Lila

source: Pink
hu: Rózsaszín

source: Gray
hu: Szürke

source: Scanning Files, Please Wait...
hu: Fájlok vizsgálata, kérjük várjon...

source: Overwrite
hu: Felülírás

source: Keep Both
hu: Mindkettő Megtartása

source: Create Script
hu: Szkript Létrehozása

source: Groups
hu: Csoportok

source: This group belongs to another scene and can't be edited.
hu: Ez a csoport egy másik jelenethez tartozik és nem módosítható.

source: Add to Group
hu: Hozzáadás Csoporthoz

source: Remove from Group
hu: Eltávolítás Csoportból

source: Rename Group
hu: Csoport átnevezése

source: Name:
hu: Név:

source: Rename references in all scenes
hu: Referenciák átnevezése minden jelenetben

source: Delete references from all scenes
hu: Referenciák törlése minden jelenetből

source: Delete group "%s" and all its references?
hu: "%s" csoport törlése minden referenciájával együtt?

source: Rename
hu: Átnevezés

source: The Beginning
hu: A Kezdet

source: Scene
hu: Jelenet

source: Keep File (exported as is)
hu: Fájl megtartása (exportálás jelenlegi állapotában)

source: Skip File (not exported)
hu: Fájl Kihagyása (nincs exportálás)

source: %d Files
hu: %d fájl

source: Default
hu: Alapértelmezett

source: Set as Default for '%s'
hu: Beállítás Alapértelmezettként '%s'-hez

source: Clear Default for '%s'
hu: Alapértelmezett Törlése '%s'-nél

source: You have pending changes that haven't been applied yet. Click Reimport to apply changes made to the import options. Selecting another resource in the FileSystem dock without clicking Reimport first will discard changes made in the Import dock.
hu: Végrehajtatlan módosítások várakoznak. Az Újraimportálás gombbal érvényesülnek az import opciók változásai. Amennyiben a FájlRendszer dokkon másik erőforrás kerül kijelölésre és az Újraimportálás nem történt meg, akkor az Import dokk változásai elvesznek.

source: Import As:
hu: Importálás Mint:

source: Preset
hu: Előbeállítás

source: The imported resource is currently loaded. All instances will be replaced and undo history will be cleared.
hu: Az importált erőforrás be van töltve. Minden példány lecserélődik és az előzmények törlődnek.

source: Select a resource file in the filesystem or in the inspector to adjust import settings.
hu: Az import beállítások módosításához jelöljön ki egy erőforrás fájlt a fájlrendszerben vagy a szerkesztőben.

source: The following resources will be duplicated and embedded within this resource/object.
hu: A következő erőforrások duplikálódnak és beágyazódnak az erőforrásba/objektumba.

source: This object has no resources to duplicate.
hu: Ezen objektumnak nincsenek duplikálható erőforrásai.

source: Failed to load resource.
hu: Nem sikerült betölteni az erőforrást.

source: Raw (e.g. "%s")
hu: Nyers (pl. "%s")

source: Localized (e.g. "Z Index")
hu: Lokalizált (pl. "Z Index")

source: Localization not available for current language.
hu: A lokalizáció a jelenlegi nyelven nem érhető el.

source: Make Sub-Resources Unique
hu: Tegye Az Al-Erőforrásokat Egyedivé

source: Inspector
hu: Elemző

source: Create a new resource in memory and edit it.
hu: Új erőforrás létrehozása a memóriában, majd annak szerkesztése.

source: Load an existing resource from disk and edit it.
hu: Meglévő erőforrás betöltése a lemezről, majd annak szerkesztése.

source: Save the currently edited resource.
hu: A jelenleg szerkesztett erőforrás elmentése.

source: Save As...
hu: Mentés Másként...

source: Copy Resource
hu: Erőforrás Másolása

source: History of recently edited objects.
hu: A nemrég módosított objektumok előzményei.

source: Open Documentation
hu: Dokumentáció megnyitása

source: This cannot be undone. Are you sure?
hu: Ezt nem lehet visszavonni. Biztos?

source: No parent to instantiate a child at.
hu: Nem példányosítható gyermek szülő nélkül.

source: No parent to instantiate the scenes at.
hu: A jelenetet nem lehet szülő nélkül példányosítani.

source: Error loading scene from %s
hu: Hiba a %s jelenet betöltése közben

source: Cannot instantiate the scene '%s' because the current scene exists within one of its nodes.
hu: A "%s" jelenetet nem lehet példányosítani, mert a jelenlegi jelenet egy belső node-ban szerepel.

source: Create AudioStreamPlayer
hu: AudioStreamPlayer Létrehozása

source: Detach Script
hu: Szkript leválasztása

source: This operation can't be done on the tree root.
hu: Ezt a műveletet nem lehet a fa gyökerén végrehajtani.

source: Duplicate Node(s)
hu: Node(ok) Megkettőzése

source: Can't reparent nodes in inherited scenes, order of nodes can't change.
hu: Node-okat nem lehet új szülőhoz rendelni az örökölt jeleneteknél, a node-ok sorrendje nem változhat.

source: Node must belong to the edited scene to become root.
hu: A Node-nak a módosított jeleneten belül kell lennie ahhoz, hogy gyökér lehessen.

source: Instantiated scenes can't become root
hu: Példányosított jelenet nem lehet gyökér

source: Make node as Root
hu: Node Gyökérré Tétele

source: Delete %d nodes and any children?
hu: %d node törlése gyermekekkel együtt?

source: Delete %d nodes?
hu: %d node törlése?

source: Delete the root node "%s"?
hu: Gyökér node törlése "%s"?

source: Delete node "%s" and its children?
hu: "%s" node törlése gyermekekkel együtt?

source: Delete node "%s"?
hu: "%s" node törlése?

source: Some nodes are referenced by animation tracks.
hu: Néhány node-ra hivatkoznak animációs sávok.

source: Saving the branch as a scene requires having a scene open in the editor.
hu: Az ág jelenetként mentése csak szerkesztőben nyitott jelenet esetében lehetséges.

source: Can't save the root node branch as an instantiated scene. To create an editable copy of the current scene, duplicate it using the FileSystem dock context menu or create an inherited scene using Scene > New Inherited Scene... instead.
hu: A gyökér node ága nem menthető példányosított jelenetként. A jelenlegi jelenet módosítható másolatához először a FájlRendszer dokk kontextus menüjéből duplikálni kell azt vagy létre kell hozni egy örökölt jelenetet a Jelenet > Új Örökölt Jelenet... menüponttal.

source: Can't save the branch of an already instantiated scene. To create a variation of a scene, you can make an inherited scene based on the instantiated scene using Scene > New Inherited Scene... instead.
hu: Már példányosított jelenet ágát nem lehet menteni. Új variáció létrehozásához a példányosított jelenetből örökölt jelenetet lehet létrehozni a Jelenet > Új Örökölt Jelenet... menüponttal.

source: Can't save a branch which is a child of an already instantiated scene. To save this branch into its own scene, open the original scene, right click on this branch, and select "Save Branch as Scene".
hu: Már példányosított jelenet gyermekeként szereplő ágat nem lehet menteni. Saját jelenetként lehet menteni az ágat az eredeti jeleneten jobb klikk után az "Ág Mentése Jelenetként" opcióval.

source: Can't save a branch which is part of an inherited scene. To save this branch into its own scene, open the original scene, right click on this branch, and select "Save Branch as Scene".
hu: Példányosított jelenet ágát nem lehet menteni. Saját jelenetként lehet menteni az ágat az eredeti jeleneten jobb klikk után az "Ág Mentése Jelenetként" opcióval.

source: Save New Scene As...
hu: Új Jelenet Mentése Másként...

source: Disabling "Editable Children" will cause all properties of this subscene's descendant nodes to be reverted to their default.
hu: A "Módosítható Gyermekek" kikapcsolása az aljelenet az összes leszármazott node-jának összes tulajdonságát alapértelmezettre állítja vissza.

source: Enabling "Load as Placeholder" will disable "Editable Children" and cause all properties of the node to be reverted to their default.
hu: A "Betöltés Placeholder-ként" engedélyezése kikapcsolja a "Módosítható Gyermekek" opciót és a node összes tulajdonságát alapértelmezettre állítja vissza.

source: Make Local
hu: Lokálissá tétel

source: Can't toggle unique name for nodes in subscene!
hu: Aljelenet node-jaihoz nem kapcsolható az egyedi név!

source: New Scene Root
hu: Új Jelenet Gyökér

source: Create Root Node:
hu: Gyökér Node Létrehozása:

source: 2D Scene
hu: 2D Jelenet

source: 3D Scene
hu: 3D Jelenet

source: User Interface
hu: Felhasználói Felület

source: Other Node
hu: Másik Node

source: Can't operate on nodes from a foreign scene!
hu: Idegen jelenet node-ján ez nem működik!

source: Can't operate on nodes the current scene inherits from!
hu: Ez nem működik olyan node-okon, amikből a jelenet örököl!

source: Reparent Node
hu: Node új szülőhöz rendelése

source: Attach Script
hu: Kód Csatolása

source: Remove Node(s)
hu: Node(-ok) eltávolítása

source: Change type of node(s)
hu: Node(-ok) típusváltoztatása

source: This operation requires a single selected node.
hu: Ehez a művelethez egy kiválasztott Node szükséges.

source: Can't overwrite scene that is still open!
hu: Nem lehet felülírni a még nyitott jelenetet!

source: Couldn't save new scene. Likely dependencies (instances) couldn't be satisfied.
hu: Új jelenet mentése sikertelen. Valószínűleg a függőségek (példányok) nem teljesíthetőek.

source: Error saving scene.
hu: Hiba a jelenet mentése közben.

source: Error duplicating scene to save it.
hu: A jelenet duplikációjának mentése nem sikerült.

source: <unknown>
hu: <ismeretlen>

source: Sub-Resources
hu: Al-Erőforrások

source: Clear Inheritance
hu: Függősék Törlése

source: Open in Editor
hu: Megnyitás Szerkesztőben

source: Editable Children
hu: Módosítható Gyerekek

source: Load as Placeholder
hu: Betöltés Placeholder-ként

source: Center Node on Reparent
hu: Node Középre Új Szülő Esetén

source: If enabled, Reparent to New Node will create the new node in the center of the selected nodes, if possible.
hu: Engedélyezve az Új Szülő Node-hoz Rendelés a létrejövő új node-ot megpróbálja a kijelölt node-ok közepére helyezni.

source: Filter nodes by entering a part of their name, type (if prefixed with "type:" or "t:") or group (if prefixed with "group:" or "g:"). Filtering is case-insensitive.
hu: Node-ok szűrése névrészlet, típus (ha a prefix "type:" vagy "t:") vagy csoport (ha a prefix "group:" vagy "g:") alapján. Nem kis- és nagybetű érzékeny.

source: Selects all Nodes of the given type. Inserts "type:". You can also use the shorthand "t:".
hu: Kiválasztja egy adott típus össze Node-ját. Beszúrja a "type:" szűrőt. Rövidítés is használható: "t:".

source: Selects all Nodes belonging to the given group. If empty, selects any Node belonging to any group. Inserts "group:". You can also use the shorthand "g:".
hu: Kiválasztja egy adott csoport össze Node-ját. Üresen kiválasztja az összes Node-ot, amely csoporthoz tartozik. Beszúrja a "group:" szűrőt. Rövidítés is használható: "g:".

source: Cannot attach a script: there are no languages registered. This is probably because this editor was built with all language modules disabled.
hu: Nem lehet szkriptet csatolni: Nincs programnyelv kiválasztva. Valószínűleg azért, mert a szerkesztőt programnyelvi modulok nélkül építették (build).

source: Can't paste root node into the same scene.
hu: Gyökér node nem illeszthető be azonos jelenetbe.

source: (used %d times)
hu: (%d előfordulás)

source: None
hu: Egyik sem

source: Paste as Sibling
hu: Testvérként Beillesztés

source: Move Up
hu: Mozgatás Felfelé

source: Move Down
hu: Mozgatás Lefelé

source: Duplicate
hu: Megkettőzés

source: Make Scene Root
hu: Jelenet Gyökérré Tétel

source: Delete (No Confirm)
hu: Törlés (Megerősítés nélkül)

source: Add/Create a New Node.
hu: Új Node Hozzáadása/Létrehozása.

source: Instantiate a scene file as a Node. Creates an inherited scene if no root node exists.
hu: Jelentfájl Node-ként való példányosítása. Örökölt jelenetet hoz létre, ha nincs gyökér node.

source: Attach a new or existing script to the selected node.
hu: Új vagy létező szkript csatolása a kiválasztott node-hoz.

source: Detach the script from the selected node.
hu: Szkript leválasztása a kijelölt node-ról.

source: Extend the script of the selected node.
hu: A kiválasztott node szkriptjének bővítése.

source: Remote
hu: Távoli

source: If selected, the Remote scene tree dock will cause the project to stutter every time it updates. Switch back to the Local scene tree dock to improve performance.
hu: Kijelölve, a Távoli jelenetfa dokk minden frissítésénél akadozást okoz a projektben. A Helyi jelenetfára visszaállással javítható a teljesítmény.

source: Local
hu: Helyi

source: Clear Inheritance? (No Undo!)
hu: Függőség Törlése? (Nem Visszavonható!)

source: Paste Params
hu: Paraméterek Beillesztése

source: Updating Scene
hu: Scene Frissítése

source: Storing local changes...
hu: Helyi módosítások eltárolása...

source: Updating scene...
hu: Scene frissítése...

source: [empty]
hu: [üres]

source: [unsaved]
hu: [nincs mentve]

source: Creating Mesh Previews
hu: Háló Előnézetek Létrehozása

source: Thumbnail...
hu: Indexkép...

source: Create New %s
hu: Új %s létrehozása

source: Clear Output
hu: Kimenet törlése

source: Collapse duplicate messages into one log entry. Shows number of occurrences.
hu: Duplikált üzenetek egyetlen naplóeseménybe sűrítése. Mutatja az előfordulások számát.

source: Focus Search/Filter Bar
hu: Kereső/Szűrő Fókuszálása

source: Warnings
hu: Figyelmeztetések

source: The Android build template is already installed in this project and it won't be overwritten. Remove the "%s" directory manually before attempting this operation again.
hu: Az Android építősablon már telepítve van ebben a projektben és nem íródik felül. Törölje manuálisan a "%s" mappát a művelet újrapróbálása előtt.

source: This will set up your project for gradle Android builds by installing the source template to "%s". Note that in order to make gradle builds instead of using pre-built APKs, the "Use Gradle Build" option should be enabled in the Android export preset.
hu: Előkészíti a projektet Androidra a gradle segítségével és a forrás sablonokat a "%s" helyre telepíti. Ahhoz, hogy az előre elkészített APK helyett gradle segítségével készüljön a projekt, a "Gradle Használata" opció engedélyezése szükséges az Android export beállításokban.

source: Unnamed Project
hu: Névtelen projekt

source: Recovery Mode is enabled. Editor functionality has been restricted.
hu: Visszaállítási Mód engedélyezve. Szerkesztő funkciók korlátozva.

source: Spins when the editor window redraws. Update Continuously is enabled, which can increase power usage. Click to disable it.
hu: Forog, amikor a szerkesztő ablak újrarajzol. A Folyamatos Frissítés be van kapcsolva, ami növeli az áramfogyasztást. Kattintásra kikapcsol.

source: Spins when the editor window redraws.
hu: Pörög, amikor a szerkesztőablak újrarajzolódik.
