Repository: zhangjiangen11/godot
Catalog: editor/translations/editor/*.po
Languages: hu

source: Uncompressing Android Build Sources
hu: Android Építőforrások Kicsomagolása

source: Export Template Manager
hu: Export Sablon Kezelő

source: Current Version:
hu: Jelenlegi Verzió:

source: Export templates are installed and ready to be used.
hu: Export sablonok telepítve és használatra készen.

source: Open the folder containing installed templates for the current version.
hu: Megnyitja a jelenlegi verzióhoz tartozó telepített sablonok mappáját.

source: Uninstall
hu: Eltávolítás

source: Uninstall templates for the current version.
hu: Eltávolítja a jelenlegi verzióhoz tartozó sablonokat.

source: Download and Install
hu: Letöltés és Telepítés

source: Download and install templates for the current version from the best possible mirror.
hu: Letölti és telepíti a sablonokat a jelenlegi verzióhoz a lehető legjobb szerverről.

source: Select Template File
hu: Válasszon sablonfájlt

source: Godot Export Templates
hu: Godot export sablonok

source: The templates will continue to download. You may experience a short editor freeze when they finish.
hu: A sablonok letöltése továbbra is zajlik. Elképzelhető, hogy a szerkesztő rövid időre lefagy, amikor ez befejeződik.

source: No "%s" library found for GDExtension: "%s". Possible feature flags for your platform: %s
hu: Nem található "%s" könyvtár az alábbi GDExtension-höz: "%s". Lehetséges funkciójelzők jelen platformhoz: %s

source: Multiple "%s" libraries found for GDExtension: "%s": "%s".
hu: Több "%s" könyvtár is létezik az alábbi GDExtension-höz: "%s": "%s".

source: Runnable
hu: Futtatható

source: Export the project for all the presets defined.
hu: Az összes definiált előbeállításra (preset) exportálás.

source: All presets must have an export path defined for Export All to work.
hu: Minden előbeállítás (preset) beállított export útvonalat igényel az Összes Exportálása funkció működéséhez.

source: Resources to exclude:
hu: Kihagyott erőforrások:

source: Resources to override export behavior:
hu: Export működést felülíró erőforrások:

source: Resources to export:
hu: Az exportálandó Erőforrások:

source: Export With Debug
hu: Exportálás Hibakereséssel

source: Exporting All
hu: Összes exportálása

source: Presets
hu: Előbeállítások

source: Add...
hu: Hozzáadás...

source: If checked, the preset will be available for use in one-click deploy. Only one preset per platform may be marked as runnable.
hu: Ha be van kapcsolva, az előbeállítás (preset) elérhető lesz egykattintásos telepítéshez. Platformonként csak egy előbeállítás (preset) jelölhető meg futtathatóként.

source: Advanced Options
hu: Haladó beállítások

source: If checked, the advanced options will be shown.
hu: Bekapcsolva, megjelennek a speciális beállítások.

source: Export Path
hu: Exportálási Útvonal

source: Options
hu: Opciók

source: Resources
hu: Erőforrások

source: Export all resources in the project
hu: Az összes projekt beli erőforrás exportálása

source: Export selected scenes (and dependencies)
hu: A kiválasztott jelenetek (és a tőle függők) exportálása

source: Export selected resources (and dependencies)
hu: A kiválasztott erőforrások (és a tőlük függők) exportálása

source: Export all resources in the project except resources checked below
hu: A projekt minden erőforrásának exportálása, kivéve a lent megjelölt erőforrásokat

source: Export as dedicated server
hu: Dedikált szerverként exportálás

source: Export Mode:
hu: Exportálási Mód:

source: "Strip Visuals" will replace the following resources with placeholders:
hu: A "Vizuális Elemek Kihagyása" lecseréli az alábbi erőforrásokat placeholder-ekre:

source: Strip Visuals
hu: Vizuális Elemek Kihagyása

source: Keep
hu: Megtartás

source: Filters to export non-resource files/folders (comma-separated, e.g: *.json, *.txt, docs/*)
hu: Szűrők a nem-erőforrás fájlok/mappák exportálásához (vesszővel elválasztva, pl. *.json, *.txt, docs/*)

source: Filters to exclude files/folders from project (comma-separated, e.g: *.json, *.txt, docs/*)
hu: Projektből kihagyott fájlok/mappák szűrői (vesszővel elválasztva, pl. *.json, *.txt, docs/*)

source: Delta Encoding Compression Level
hu: Delta Kódolás Tömörítési Szintje

source: Delta Encoding Minimum Size Reduction
hu: Delta Kódolás Minimum Méret Csökkentése

source: Filters to include files/folders from being delta-encoded (comma-separated, e.g: *.gdc, scripts/*)
hu: Delta kódoláshoz hozzáadott fájlok/mappák szűrői (vesszővel elválasztva, pl. *.gdc, scripts/*)

source: Filters to exclude files/folders from being delta-encoded (comma-separated, e.g: *.ctex, textures/*)
hu: Delta kódolásból kihagyott fájlok/mappák szűrői (vesszővel elválasztva, pl. *.ctex, textures/*)

source: Features
hu: Funkciók

source: Custom (comma-separated):
hu: Egyéni (vesszővel elválasztva):

source: Feature List:
hu: Funkciólista:

source: Encrypt Exported PCK
hu: Exportált PCK Titkosítása

source: Encrypt Index (File Names and Info)
hu: Index Titkosítása (Fájlnevek és Infó)

source: Filters to include files/folders (comma-separated, e.g: *.tscn, *.tres, scenes/*)
hu: Belefoglalt fájlok/mappák szűrői (vesszővel elválasztva, pl. *.tscn, *.tres, scenes/*)

source: Filters to exclude files/folders (comma-separated, e.g: *.ctex, *.import, music/*)
hu: Kihagyott fájlok/mappák szűrői (vesszővel elválasztva, pl. *.ctex, *.import, music/*)

source: Encryption Key (256-bits as hexadecimal):
hu: Titkosítási kulcs (256-bites hexadecimális):

source: Invalid Encryption Key (must be 64 hexadecimal characters long)
hu: Érvénytelen Titkosítási Kulcs (64 hexadecimális karakter hosszúságú kell legyen)

source: Initialization vector seed
hu: Alapállapot vektor seed

source: Note: Encryption key needs to be stored in the binary, you need to build the export templates from source.
hu: Megjegyzés: A titkosítási kulcsot a bináris fájlban kell tárolni, ezért az export sablonokat forrásból kell újraépíteni.

source: Text (easier debugging)
hu: Szöveg (könnyebb hibakeresés)

source: Binary tokens (faster loading)
hu: Bináris tokenek (gyorsabb betöltés)

source: Compressed binary tokens (smaller files)
hu: Tömörített bináris tokenek (kisebb fájlok)

source: No presets found. Create one so that its parameters can be edited here.
hu: Nincsenek előbeállítások (preset). Hozzon létre egyet a paraméterek módosításához.

source: Export the project resources as a PCK or ZIP package. This is not a playable build, only the project data without a Godot executable.
hu: Projekt erőforrások exportálása PCK vagy ZIP csomagként. Ez nem játszható verzió, csak a projekt adatai a Godot futtatható állomány nélkül.

source: Export the project as a playable build (Godot executable and project data) for the selected preset.
hu: Játszható formába exportálás (Godot futtatható állomány és projekt adatok) a kijelölt előbeállítással (preset).

source: Export All
hu: Összes exportálása

source: ZIP File
hu: ZIP fájl

source: Export templates for this platform are missing:
hu: Ezen platformhoz hiányzó export sablonok:

source: Manage Export Templates
hu: Export Sablonok Kezelése

source: Dependencies For:
hu: Függőségek:

source: Dependencies
hu: Függőségek

source: Dependencies:
hu: Függőségek:

source: Fix Broken
hu: HIbásak Kijavítása

source: Dependency Editor
hu: Függőség Szerkesztő

source: Owners of: %s (Total: %d)
hu: Tulajdonosai ennek: %s (Összesen: %d)

source: Localization remap for path '%s' and locale '%s'.
hu: Lokalizációs újraállítás a(z) "%s" útvonalhoz és "%s" területi beállításhoz.

source: Remove the selected files from the project? (Cannot be undone.) Depending on your filesystem configuration, the files will either be moved to the system trash or deleted permanently.
hu: Eltávolítja a kiválasztott fájlokat a projektből? (Nem visszavonható.) A rendszerbeállítások szerint az eltávolított fájlok vagy a lomtárba kerülnek vagy véglegesen törlődnek.

source: The files being removed are required by other resources in order for them to work. Remove them anyway? (Cannot be undone.) Depending on your filesystem configuration, the files will either be moved to the system trash or deleted permanently.
hu: Az eltávolítandó fájlokra szükség van egyéb erőforrások működéséhez. Eltávolítja őket ennek ellenére? (Nem visszavonható.) A rendszerbeállítások szerint az eltávolított fájlok vagy a lomtárba kerülnek vagy véglegesen törlődnek.

source: Cannot remove:
hu: Nem eltávolítható:

source: Dependencies of files to be deleted:
hu: Fájlok függőségeinek törlése:

source: Referenced by %s
hu: %s által hivatkozva

source: Fix Dependencies
hu: Függőségek Megjavítása

source: Load failed due to missing dependencies:
hu: A betöltés nem sikerült a hiányzó függőségek miatt:

source: Which action should be taken?
hu: Melyik lépést tegyük meg?

source: Permanently delete %d item(s)? (No undo!)
hu: Véglegesen törlöl %d elemet? (Nem visszavonható!)

source: Show Dependencies
hu: Függőségek megjelenítése

source: Orphan Resource Explorer
hu: Árva Forrás Kezelő

source: Owns
hu: Birtokol

source: Resources Without Explicit Ownership:
hu: Források Explicit Tulajdonos Nélkül:

source: Scanning file structure...
hu: Fájlstruktúra vizsgálata...

source: Initializing plugins...
hu: Beépülő modulok beállítása...

source: Some extensions need the editor to restart to take effect.
hu: Néhány bővítmény a szerkesztő újraindítása után fog működni.

source: ScanSources
hu: Források Vizsgálata

source: There are multiple importers for different types pointing to file %s, import aborted
hu: Több importáló van különböző típusokhoz a(z) %s fájl esetén, import félbeszakítva

source: (Re)Importing Assets
hu: Eszközök (Újra) Betöltése

source: Preparing files to reimport...
hu: Fájlok felkészítése újraimportáláshoz...

source: Executing pre-reimport operations...
hu: Importálási előműveletek elvégzése...

source: Finalizing Asset Import...
hu: Eszköz Importálás Véglegesítése...

source: Executing post-reimport operations...
hu: Újraimportálási Utóműveletek Elvégzése...

source: Go to Line
hu: Ugrás sorra

source: Line Number:
hu: Sorszám:

source: %d replaced.
hu: %d lecserélve.

source: Match Case
hu: Nagybetűérzékeny

source: Whole Words
hu: Egész szavak

source: Replace
hu: Csere

source: Replace All
hu: Összes cseréje

source: Selection Only
hu: Csak kijelölés

# Indentation
source: Spaces
hu: Szóközök

# Indentation
source: Tabs
hu: Tabulátorok

source: %s+Mouse Wheel, %s/%s: Finetune %s: Reset
hu: %s+Egér görgő, %s/%s: Finomhangolás %s: Visszaállítás

source: Zoom In
hu: Nagyítás

source: Zoom Out
hu: Kicsinyítés

source: Reset Zoom
hu: Nagyítás visszaállítása

source: Line and column numbers.
hu: Sor és oszlopszámok.

source: Change
hu: Változtatás

source: No results for "%s".
hu: Nincs találat a következőre: "%s".

source: The script will run in the editor.
hu: A szkript a szerkesztőben fog futni.

source: Recent:
hu: Legutóbbi:

source: Search:
hu: Keresés:

source: Matches:
hu: Egyezések:

source: Credits
hu: Közreműködők

source: Project Founders
hu: Projekt Alapítói

source: Lead Developer
hu: Vezető Fejlesztő

source: Developers
hu: Fejlesztők

source: Patrons
hu: Szponzorok

source: Platinum Sponsors
hu: Platina Támogatók

source: Gold Sponsors
hu: Arany Szponzorok

source: Silver Sponsors
hu: Ezüst adományozók

source: Diamond Members
hu: Gyémánt Tagok

source: Titanium Members
hu: Titánium Tagok

source: Thank you for choosing Godot Engine!
hu: Köszönjük, hogy a Godot Engine-t választotta!

source: Using slashes in folder names will create subfolders recursively.
hu: A mappanévben perjelek használatával almappákat hozhat létre rekurzívan.

source: Using slashes in path will create the file in subfolder, creating new subfolders if necessary.
hu: Az útvonalban perjeleket használva a fájl almappában fog létrejönni, köztes mappákat is létrehozva, ha szükséges.

source: Godot Engine contributors
hu: Godot Engine közreműködők

source: Double-click to open in browser.
hu: Dupla kattintással megnyitható a böngészőben.

source: No distractions for this, close that game first.
hu: Ehhez ne legyenek zavaró tényezők, zárd be a játékot.

source: Thanks from the Godot community!
hu: Köszönet a Godot közösségétől!

source: Authors
hu: Szerzők

source: Donors
hu: Adományozók

source: Third-party Licenses
hu: Harmadik féltől származó licencek

source: Godot Engine relies on a number of third-party free and open source libraries, all compatible with the terms of its MIT license. The following is an exhaustive list of all such third-party components with their respective copyright statements and license terms.
hu: A Godot Engine több harmadik fél ingyenes és nyílt forráskódú könyvtáraira támaszkodik, amelyek mindegyike kompatibilis az MIT licenc feltételeivel. Az alábbiakban felsoroljuk az összes ilyen harmadik fél összetevőjét, a vonatkozó szerzői jogi nyilatkozatokkal és licencfeltételekkel együtt.

source: All Components
hu: Minden Összetevő

source: Components
hu: Összetevők

source: Licenses
hu: Licencek

source: Expand Bottom Panel
hu: Alsó panel kinyitása

source: Move
hu: Áthelyezés

source: No sub-resources found.
hu: Nem található alerőforrás.

source: Selected resource will be previewed in the editor before accepting.
hu: A kiválasztott erőforrás elfogadása előtt előnézetbe kerül a szerkesztőben.

source: Include approximate matches.
hu: Közelítő találatok mutatása.

source: Addons
hu: Beépülő modulok

source: Include files from addons
hu: Beépülő modulok fájljai is

source: (recently opened)
hu: (nemrég megnyitva)

source: List view
hu: Listanézet

source: Hold %s to round to integers.
hu: %s lenyomva egész számra kerekítéshez.

source: Remove Item
hu: Elem eltávolítása

source: (unknown)
hu: (ismeretlen)

source: Git commit date: %s Click to copy the version information.
hu: Git commit dátuma: %s Kattintással másolja a verzió információt.

source: Switch Embedded Panel Position
hu: Beágyazott Panel Pozíció Váltása

source: Make this panel floating in the screen %d.
hu: Panel lebegővé tétele a %d. képernyőn.

source: Right-click to open the screen selector.
hu: Jobb klikk a képernyőválasztó megnyitásához.

source: Importing Scene...
hu: Jelenet importálása...

source: Import Scene
hu: Scene importálás

source: Running Custom Script...
hu: Tetszőleges Szkript Futtatása...

source: Couldn't load post-import script:
hu: Nem sikerült az import utáni szkript betöltése:

source: Script is not a subtype of EditorScenePostImport:
hu: A szkript nem altípusa a EditorScenePostImport típusnak:

source: Invalid/broken script for post-import (check console):
hu: Érvénytelen vagy sérült az importálás utáni szkript (ellenőrizze a konzolt):

source: Error running post-import script:
hu: Hiba történt az importálás utána szkript futtatásakor:

source: Did you return a Node-derived object in the `_post_import()` method?
hu: Node-leszármazott objektumot ad vissza a `_post_import()` metódus?

source: Saving...
hu: Mentés...

source: Type: %s Import ID: %s
hu: Típus: %s Import ID: %s

source: Select folder where mesh resources will save on import
hu: Válasszon egy mappát a mesh erőforrások import utáni mentéséhez

source: Select folder where animations will save on import
hu: Válasszon egy mappát animációk mentéséhez import után

source: Existing file with the same name will be replaced.
hu: Azonos nevű, már létező fájl felül lesz írva.

source: Already External
hu: Már Külső

source: This material already references an external file, no action will be taken. Disable the external property for it to be extracted again.
hu: Ez az anyag már most is külső fájlra hivatkozik, semmi nem fog történni. A külső tulajdonság kikapcsolásával újra kicsomagolható.

source: Material has no name nor any other way to identify on re-import. Please name it or ensure it is exported with an unique ID.
hu: Az anyagnak nincs neve és más módokon sem azonosítható újraimportáláskor. Adjon neki nevet vagy gondoskodjon egyedi azonosítóról exportáláskor.

source: Extract Materials to Resource Files
hu: Anyagok Kicsomagolása Erőforrás Fájlokba

source: This mesh already saves to an external resource, no action will be taken.
hu: Ez a mesh már most is külső erőforrásba kerül, semmi nem fog történni.

source: Existing file with the same name will be replaced on import.
hu: Már létezik ilyen nevű fájl, amit az import folyamat felül fog írni.

source: Mesh has no name nor any other way to identify on re-import. Please name it or ensure it is exported with an unique ID.
hu: A mesh-nek nincs neve és más módokon sem azonosítható újraimportáláskor. Adjon neki nevet vagy gondoskodjon egyedi azonosítóról exportáláskor.

source: Set paths to save meshes as resource files on Reimport
hu: Útvonalak beállítása a mesh-ek erőforrás fájlként mentéséhez Újraimportáláskor

source: This animation already saves to an external resource, no action will be taken.
hu: Ez az animáció már most is külső erőforrásba kerül, semmi nem fog történni.

source: Can't make material external to file, write error:
hu: Nem lehet külső fájlba tenni az anyagot, írás hiba:

source: Set Mesh Save Paths
hu: Mesh Mentési Útvonalak Beállítása

source: Secondary Light
hu: Másodlagos Fény

source: Status
hu: Státusz

source: Enable
hu: Engedélyezés

source: Offset:
hu: Eltolás:

source: Loop offset (from beginning). Note that if BPM is set, this setting will be ignored.
hu: Ciklus eltolás (előlről). Ez a beállítás figyelmen kívül marad, ha a BPM be van állítva.

source: Configure the Beats Per Measure (tempo) used for the interactive streams. This is required in order to configure beat information.
hu: Ütem (BPM, tempó) beállítása az interaktív folyamokhoz. Szükséges az üteminformációk beállításához.

source: Configure the amount of Beats used for music-aware looping. If zero, it will be autodetected from the length. It is recommended to set this value (either manually or by clicking on a beat number in the preview) to ensure looping works properly.
hu: Ütemszám beállítása a zene-figyelő ciklushoz. Nulla esetén hossz alapján automatikusan beáll. Javasolt ezt az értéket beállítani (manuálisan vagy az előnézet ütemszámára kattintva) a helyes ciklus működéshez.

source: Bar Beats:
hu: Ütembeosztás:

source: Configure the Beats Per Bar. This used for music-aware transitions between AudioStreams.
hu: Ütembeosztás Beállítása. Az AudioStream-ek közötti zene-figyelő áttűnésekhez használt.

source: Preview:
hu: Előnézet:

source: Preloaded glyphs: %d
hu: Előtöltött karakterjelek: %d

source: Warning: There are no configurations specified, no glyphs will be pre-rendered.
hu: Figyelmeztetés: Nincs megadva konfiguráció vagy nincsenek előrenderelt karakterjelek.

source: Warning: Multiple configurations have identical settings. Duplicates will be ignored.
hu: Figyelmeztetés: Több konfigurációban is azonos beállítások vannak. A másolatok figyelmen kívül maradnak.

source: Note: LCD Subpixel antialiasing is selected, each of the glyphs will be pre-rendered for all supported subpixel layouts (5x).
hu: Megjegyzés: Az LCD alpixel élsimítás ki van jelölve, az összes karakterjel előrenderelődik minden alpixel elrendezéshez (5x).

source: Note: Subpixel positioning is selected, each of the glyphs might be pre-rendered for multiple subpixel offsets (up to 4x).
hu: Megyjegyzés: Alpixel elhelyzés kiválasztva, az összes karakterjel előrenderelődhet több alpixel eltoláshoz is (akár 4x).

source: Advanced Import Settings for '%s'
hu: Speciális Import Beállítások ehhez: "%s"

source: Select font rendering options, fallback font, and metadata override:
hu: Renderelés beállítások, tartalék betűtípus és metaadat felülbírálás beállítása:

source: Pre-render Configurations
hu: Elő-Renderelési beállítások

source: Add font size, and variation coordinates, and select glyphs to pre-render:
hu: Betűtípus méret és variáció koordináták megadása és előrenderelt karakterjelek kiválasztása:

source: Select translations to add all required glyphs to pre-render list:
hu: Fordítások az összes előrendereléshez szükséges karakterjel kiválasztásához:

source: Shape all Strings in the Translations and Add Glyphs
hu: A Fordítások Szövegeinek Formázása és Karakterjelek Hozzáadása

source: Glyphs from the Text
hu: A Szöveg Karakterjelei

source: Enter a text and select OpenType features to shape and add all required glyphs to pre-render list:
hu: Írjon be szöveget és válasszon az OpenType funkciók közül a szükséges karakterjelek előrenderelési formázásához:

source: Shape Text and Add Glyphs
hu: Szöveg Formázása és Karakterjelek Hozzáadása

source: Glyphs from the Character Map
hu: A Karaktertérkép Karakterjelei

source: Add or remove glyphs from the character map to pre-render list: Note: Some stylistic alternatives and glyph variants do not have one-to-one correspondence to character, and not shown in this map, use "Glyphs from the text" tab to add these.
hu: Karakterjeleket ad hozzá (vagy töröl) az előrenderelési listához a karaktertérképről: Megjegyzés: Néhány stílusalternatíva és karakterjel variáns nem egyezik meg teljesen a vonatkozó karakterrel és ezért nem látszik a térképen, hozzáadásuk a "A Szöveg Karakterjelei" fülön lehetséges.

source: Canceling this dialog will disable the FBX2glTF importer and use the ufbx importer. You can re-enable FBX2glTF in the Project Settings under Filesystem > Import > FBX > Enabled. The editor will restart as importers are registered when the editor starts.
hu: A párbeszédablak megszakítása kikapcsolja az FBX2glTF importálót a ufbx importáló javára. Az FBX2glTF importáló újra bekapcsolható a Projekt Beállításokban a Fájlrendszer > Import > FBX > Bekapcsolás segítségével. A szerkesztő újraindul, mert az importálók induláskor aktiválódnak.

source: Path to FBX2glTF executable is empty.
hu: Az FBX2glTF futtatható állomány útvonala üres.

source: Path to FBX2glTF executable is invalid.
hu: Az FBX2glTF futtatható állomány útvonala érvénytelen.

source: Error executing this file (wrong version or architecture).
hu: A fájl futtatás hibára futott (rossz verzió vagy architektúra).

source: FBX2glTF is required for importing FBX files if using FBX2glTF. Alternatively, you can use ufbx by disabling FBX2glTF. Please download the necessary tool and provide a valid path to the binary:
hu: FBX2glTF használatakor FBX2glTF szükséges az FBX fájlok importálásához. Alternatívaként ufbx is használható az FBX2glTF kikapcsolásával. Kérem töltse le a szükséges eszközt és adja meg a futtatható állomány elérési útvonalát:

source: Click this link to download FBX2glTF
hu: Kattintson a linkre az FBX2glTF letöltéséhez

source: Browse
hu: Tallózás

source: Importer:
hu: Importáló:

source: Reset to Defaults
hu: Visszaállítás Alapértelmezettre

source: Dynamically rendered TrueType/OpenType font
hu: Dinamikusan renderelt TrueType/OpenType betűtípus

source: Prerendered multichannel(+true) signed distance field
hu: Előrenderelt többcsatornás(+true) előjeles távolságmező

source: Error importing GLSL shader file: '%s'. Open the file in the filesystem dock in order to see the reason.
hu: Hiba a GLSL shader fájl importálásakor: "%s". Az ok felderítéséhez nyissa meg a fájlt a fájlrendszer dokkon.

source: %s: Texture detected as used as a normal map in 3D. Enabling red-green texture compression to reduce memory usage (blue channel is discarded).
hu: %s: Textúra van a normáltérkép helyén, 3D-ben. A memóriahasználat csökkentése érdekében a piros-zöld textúratömörítés be lesz kapcsolva (a kék csatorna figyelmen kívül marad).

source: %s: Texture detected as used as a roughness map in 3D. Enabling roughness limiter based on the detected associated normal map at %s.
hu: %s: Textúra van az érdességtérkép helyén, 3D-ben. A hozzátartozó normáltérkép alapján érdességkorlátozó fog működni: %s.
