Repository: zhangjiangen11/godot
Catalog: editor/translations/editor/*.po
Languages: hu

source: The text-based resource at path "%s" is large on disk (%s), likely because it has embedded binary data. This slows down resource saving and loading. Consider saving its binary subresource(s) to a binary `.res` file or saving the resource as a binary `.res` file. This warning can be disabled in the Editor Settings (FileSystem > On Save > Warn on Saving Large Text Resources).
hu: A(z) "%s" útvonalon található szöveges erőforrás nagy méretű (%s), mert valószínűleg bináris adatokat is tartalmaz. Ez lelassítja az erőforrás mentését és betöltését. Érdemes lehet a bináris adatokat inkább egy bináris `.res` fájlba menteni, vagy az erőforrást bináris `.res` fájlként menteni. Ez a figyelmeztetés kikapcsolható a Szerkesztő Beállításokban (Fájlrendszer > Mentés > Figyelmeztetés Nagy Szöveges Fájlok Mentésénél).

source: This resource can't be saved because it does not belong to the edited scene. Make it unique first.
hu: Ezt az erőforrást nem menthető, mert nem tartozik a szerkesztett jelenethez. Először tegye egyedivé.

source: Save Resource As...
hu: Erőforrás Mentése Másként...

source: Scene file '%s' appears to be invalid/corrupt.
hu: A "%s" jelenetfájl érvénytelen/sérült.

source: File '%s' is saved in a format that is newer than the formats supported by this version of Godot, so it can't be opened.
hu: A "%s" fájl formátuma újabb, mint a Godot jelen verziója által támogatott formátumok, ezért nem lehet megnyitni.

source: Saving Scene
hu: Scene mentése

source: Analyzing
hu: Elemzés

source: This scene can't be saved because there is a cyclic instance inclusion. Please resolve it and then attempt to save again.
hu: A jelenet nem menthető, mert ciklikus példányhivatkozás van benne. Kérem oldja fel a ciklikusságot és próbálja újra a mentést.

source: Couldn't save scene. Likely dependencies (instances or inheritance) couldn't be satisfied.
hu: Jelenet mentése sikertelen. Valószínűleg a függőségek (példányok vagy öröklések) nem teljesíthetőek.

source: The text-based scene at path "%s" is large on disk (%s), likely because it has embedded binary data. This slows down scene saving and loading. Consider saving its binary subresource(s) to a binary `.res` file or saving the scene as a binary `.scn` file. This warning can be disabled in the Editor Settings (FileSystem > On Save > Warn on Saving Large Text Resources).
hu: A(z) "%s" útvonalon található szöveges jelenet nagy méretű (%s), mert valószínűleg bináris adatokat is tartalmaz. Ez lelassítja a jelenet mentését és betöltését. Érdemes lehet a bináris adatokat inkább egy bináris `.res` fájlba menteni, vagy a jelenetet bináris `.scn` fájlként menteni. Ez a figyelmeztetés kikapcsolható a Szerkesztő Beállításokban (Fájlrendszer > Mentés > Figyelmeztetés Nagy Szöveges Fájlok Mentésénél).

source: Save scene before running...
hu: Futtatás előtt mentse a jelenetet...

source: Merge With Existing
hu: Egyesítés Meglévővel

source: Can't load MeshLibrary for merging!
hu: Nem lehet betölteni a MeshLibrary-t egyesítésre!

source: An error occurred while trying to save the editor layout. Make sure the editor's user data path is writable.
hu: Hiba történt a szerkesztő elrendezésének mentése közben. Bizonyosodjon meg róla, hogy a szerkesztő felhasználói elérési útján engedélyezve van az írás.

source: Default editor layout overridden. To restore the Default layout to its base settings, use the Delete Layout option and delete the Default layout.
hu: Alapértelmezett szerkesztő elrendezés felülírva. Hogy visszaállítsa az alapértelmezett elrendezést az eredeti beállításokra, használja az Elrendezés Törlése opciót és törölje az alapértelmezett elrendezést.

source: Layout name not found!
hu: Elrendezés neve nem található!

source: Restored the Default layout to its base settings.
hu: Az alapértelmezett elrendezés vissza lett állítva az eredeti beállításokra.

source: This object is marked as read-only, so it's not editable.
hu: Ez az objektum csak-olvashatóként van megjelölve, ezért nem módosítható.

source: This resource belongs to a scene that was imported, so it's not editable. Please read the documentation relevant to importing scenes to better understand this workflow.
hu: Ez az erőforrás egy olyan jelenethez tartozik, ami be lett importálva, így nem szerkeszthető. Olvassa el a jelenetek importálásáról szóló megfelelő dokumentációt, hogy jobban megértse ezt a munkafolyamatot.

source: This resource was imported, so it's not editable. Change its settings in the import panel and then re-import.
hu: Ez azt erőforrást importálta, így ez nem szerkeszthető. Módosítsa a beállításait az import panelen, és importálja újból.

source: This object is read-only.
hu: Ez az objektum csak olvasható.

source: %d second ago
hu: %d másodperce

source: %d minute ago
hu: %d perce

source: %d hour ago
hu: %d órája

source: Scene "%s" has unsaved changes. Last saved: %s.
hu: A(z) "%s" jelenetnek elmentetlen változásai vannak. Utolsó mentés: %s.

source: Open Base Scene
hu: Alap Jelenet Megnyitása

source: %s no longer exists! Please specify a new save location.
hu: %s már nem létezik! Adjon meg egy új mentési helyet.

source: The current scene has no root node, but %d modified external resource(s) and/or plugin data were saved anyway.
hu: A jelenlegi jelenetnek nincs gyökér node-ja, de %d módosított külső erőforrás és/vagy beépülő modul adatai így is mentésre kerültek.

source: Save Scene As...
hu: Scene Mentése Másként...

source: Can't undo while mouse buttons are pressed.
hu: Nem lehet visszavonni az egérgombok nyomvatartása közben.

source: Nothing to undo.
hu: Nincs mit visszavonni.

source: Can't redo while mouse buttons are pressed.
hu: Nem lehet helyrehozni (redo) az egérgombok nyomvatartása közben.

source: Nothing to redo.
hu: Nincs mit helyrehozni (redo).

source: Can't reload a scene that was never saved.
hu: Nem lehet újratölteni egy olyan jelenetet, amit soha nem mentett el.

source: Stop running project before reloading the current project?
hu: Leállítsuk a futó projektet a jelenlegi projekt újratöltése előtt?

source: Stop running project before exiting the editor?
hu: Leállítsuk a futó projektet a szerkesztőből kilépés előtt?

source: Save & Quit
hu: Mentés és kilépés

source: Save changes to the following scene(s) before opening Project Manager?
hu: Elmenti a következő Scene(ek)en végzett változtatásokat a Projektkezelő megnyitása előtt?

source: This option is deprecated. Situations where refresh must be forced are now considered a bug. Please report.
hu: Ez az opció elavult. A kényszerített frissítéshez köthető szituációk hibának minősülnek. Kérjük jelentse.

source: Pick a Main Scene
hu: Válasszon egy Fő Jelenetet

source: Export Mesh Library
hu: Mesh könyvtár exportálás

source: Unable to enable addon plugin at: '%s' parsing of config failed.
hu: Nem sikerült az addon plugin engedélyezése itt: '%s' a konfiguráció elemzése megbukott.

source: Unable to find script field for addon plugin at: '%s'.
hu: Nem található szkript mező az addon pluginnak a következő helyen: 'res://addons/%s'.

source: Unable to load addon script from path: '%s'.
hu: Nem sikerült az addon szkript betöltése a következő útvonalról: '%s'.

source: Scene '%s' was automatically imported, so it can't be modified. To make changes to it, a new inherited scene can be created.
hu: A(z) '%s' Scene automatikusan be lett importálva, ezért nem módosítható. Változtatások végzéséhez egy új öröklött Scene-t hozhat létre.

source: Error loading scene, it must be inside the project path. Use 'Import' to open the scene, then save it inside the project path.
hu: Hiba a jelenet betöltésekor, benne kell lennnie a projekt útvonalában. Használja az 'Import' lehetőséget a jelenet megnyitására, majd mentse el a projekt útvonalán belülre.

source: Scene '%s' has broken dependencies:
hu: A(z) '%s' jelenetnek tört függőségei vannak:

source: Multi-window support is not available because the `--single-window` command line argument was used to start the editor.
hu: A többablakos működés nem elérhető, mert a `--single-window`parancssori argumentummal indult el a szerkesztő.

source: Multi-window support is not available because the current platform doesn't support multiple windows.
hu: A többablakos működés nem elérhető, a jelenlegi platform nem támogatja a többablakos működést.

source: Multi-window support is not available because Interface > Editor > Single Window Mode is enabled in the editor settings.
hu: A többablakos működés nem elérhető, mert az Interfész > Szerkesztő > Egyablakos mód be van kapcsolva a szerkesztő beállításokban.

source: Multi-window support is not available because Interface > Multi Window > Enable is disabled in the editor settings.
hu: A többablakos működés nem elérhető, mert az Interfész > Többablakos mód > Bekapcsolás ki van kapcsolva a szerkesztő beállításokban.

source: Clear Recent Scenes
hu: Legutóbbi Jelenetek Törlése

source: User data dir '%s' is not valid. Change to a valid one?
hu: A felhasználói adat mappa "%s" érvénytelen. Változtassuk egy érvényesre?

source: Cannot run the script because it contains errors, check the output log.
hu: A szkript nem futtatható, mert hibákat tartalmaz, ellenőrizze a kimeneti naplót.

source: Cannot run the script because it doesn't extend EditorScript.
hu: A szkript nem futtatható, mert nem örökli az EditorScript-et.

source: Cannot run the script because it's not a tool script (add the @tool annotation at the top).
hu: A szkript nem futtatható, mert nem eszköz szkript (adja hozzá a @tool annotációt a tetején).

source: Cannot run the script because it's not a tool script (add the [Tool] attribute above the class definition).
hu: A szkript nem futtatható, mert nem eszköz szkript (adja hozzá a [Tool] attribútumot az osztálydefiníció fölött).

source: Cannot run the script because it's not a tool script.
hu: A szkript nem futtatható, mert nem eszköz szkript.

source: Save Layout
hu: Elrendezés Mentése

source: Delete Layout
hu: Elrendezés Törlése

source: Save & Close
hu: Mentés és Bezárás

source: %d more files or folders
hu: %d további fájl vagy mappa

source: %d more folders
hu: %d további mappa

source: %d more files
hu: %d további fájl

source: Unable to write to file '%s', file in use, locked or lacking permissions.
hu: A(z) "%s" fájl nem írható, mert használatban van, zárolva van vagy nincs hozzáférési engedély.

source: Preparing scenes for reload
hu: Jelenetek felkészítése újratöltéshez

source: Save & Restart
hu: Mentés és Újraindítás

source: Changing the renderer requires restarting the editor. Choosing Save & Restart will change the renderer to: - Desktop platforms: %s - Mobile platforms: %s - Web platform: %s
hu: A rendermotor változtatása a szerkesztő újraindítását igényli. A Mentés és Újratöltés megváltoztatja a rendermotort: - Asztali platformokon: %s - Hordozható platformokon: %s - Web platformokon: %s

source: Open Recent
hu: Legutóbbi Megnyitása

source: Version Control
hu: Verziókezelés

source: Pack Project as ZIP...
hu: Projekt Tömörítése ZIP-ként...

source: Install Android Build Template...
hu: Android Építősablon Telepítése...

source: Tools
hu: Eszközök

source: Editor Layout
hu: Szerkesztő Elrendezés

source: Open Editor Data/Settings Folder
hu: Szerkesztő adatok/beállítások mappa megnyitása

source: Open Editor Data Folder
hu: Szerkesztő Adatmappájának Megnyitása

source: Open Editor Settings Folder
hu: Szerkesztő beállításai mappa megnyitása

source: Manage Editor Features...
hu: A Szerkesztő funkcióinak kezelése ...

source: Manage Export Templates...
hu: Exportálási sablonok kezelése...

source: Copies the system info as a single-line text into the clipboard.
hu: Vágólapra menti a rendszerinformációkat egysoros szövegként.

source: Pan View
hu: Pásztázás

source: Distraction Free Mode
hu: Zavarmentes Mód

source: Toggle distraction-free mode.
hu: Zavarmentes mód váltása.

source: Copy Text
hu: Szöveg másolása

source: New Scene
hu: Új Scene

source: New Inherited Scene...
hu: Új örökölt Jelenet...

source: Open Scene...
hu: Jelenet megnyitása...

source: Reopen Closed Scene
hu: Bezárt jelenet újbóli megnyitása

source: Save Scene
hu: Jelenet Mentése

source: Save All Scenes
hu: Az összes jelenet mentése

source: Quick Open...
hu: Gyors Megnyitás...

source: Quick Open Scene...
hu: Jelenet Gyors Megnyitása...

source: Quick Open Script...
hu: Szkript Gyors Megnyitás...

source: MeshLibrary...
hu: MeshLibrary-ra...

source: Reload Saved Scene
hu: Mentett jelenet újratöltése

source: Close Scene
hu: Jelenet bezárása

source: Editor Settings...
hu: Szerkesztő beállításai...

source: Quit
hu: Kilépés

source: Find in Files...
hu: Keresés a fájlokban...

source: Export
hu: Exportálás

source: Orphan Resource Explorer...
hu: Árva erőforrás-kezelő...

source: Quit to Project List
hu: Kilépés a projektlistába

source: Take Screenshot
hu: Képernyőkép készítése

source: Toggle Fullscreen
hu: Teljes Képernyő

source: Forum
hu: Fórum

source: Copy System Info
hu: Rendszerinfó Másolás

source: Report a Bug
hu: Hiba bejelentése

source: Suggest a Feature
hu: Funkciójavaslás

source: Send Docs Feedback
hu: Visszajelzé Küldése s A Dokumentumokról

source: Support Godot Development
hu: A Godot Fejlesztés Támogatása

source: Open Script Editor
hu: Szkript szerkesztő megnyitása

source: Open Asset Library
hu: Csomagtár Megnyitása

source: Open the next Editor
hu: Következő Szerkesztő Megnyitása

source: Open the previous Editor
hu: Előző Szerkesztő Megnyitása

source: Project
hu: Projekt

source: Choose a renderer. Notes: - On mobile platforms, the Mobile renderer is used if Forward+ is selected here. - On the web platform, the Compatibility renderer is always used.
hu: Válasszon rendermotor. Megjegyzések: - Hordozható platformokon a Forward+ kiválasztás esetén Mobile lesz használatban. - Web platformon mindig a Compatibility motor működik.

source: Update Continuously
hu: Folyamatos frissítés

source: Hide Update Spinner
hu: Frissítési forgó elrejtése

source: Don't Save
hu: Nincs Mentés

source: Android build template is missing, please install relevant templates.
hu: Hiányzó Android építősablon, kérem telepítse az ide tartozó sablonokat.

source: Manage Templates
hu: Sablonok kezelése

source: Import Templates From ZIP File
hu: Sablonok Importálása ZIP Fájlból

source: Template Package
hu: Sabloncsomag

source: Export Library
hu: Könyvtár Exportálása

source: Files have been modified outside Godot
hu: Fájlmódosulás a Godot szoftveren kívül

source: Project data folder (.godot) is missing. Please restart editor.
hu: A projekt adatmappája (.godot) hiányzik. Indítsa újra a szerkesztőt.

source: Restart
hu: Újraindítás

source: Open Anyway
hu: Megnyitás Mindenképpen

source: New Inherited
hu: Új Örökölt

source: Load Errors
hu: Betöltési Hibák

source: Warning!
hu: Figyelmeztetés!

source: Can't get filesystem access.
hu: Nincs fájlrendszer hozzáférés.

source: Failed to get Info.plist hash.
hu: Az Info.plist hash betöltése sikertelen.

source: Invalid Info.plist, no bundle id.
hu: Érvénytelen Info.plist, nincs csomag azonosító.

source: Invalid Info.plist, can't load.
hu: Érvénytelen Info.plist, nem tölthető be.

source: Failed to extract thin binary.
hu: Vékony bináris kicsomagolása sikertelen.

source: Already signed!
hu: Már alá van írva!

source: Failed to create _CodeSignature subfolder.
hu: A _CodeSignature almappa létrehozása sikertelen.

source: Can't resize signature load command.
hu: Az aláírás betöltését nem lehet átméretezni.

source: Failed to create fat binary.
hu: A vastag bináris létrehozása sikertelen.

source: Unknown bundle type.
hu: Ismeretlen csomagtípus.

source: Unknown object type.
hu: Ismeretlen objektum típus.

source: Project export for platform:
hu: Projekt platformra exportálása:

source: Export failed with error code %d.
hu: Az export %d hibakóddal hibára futott.

source: Storing File:
hu: Tároló Fájl:

source: Using user provided text server data, text display in the exported project might be broken if export template was built with different ICU version!
hu: Felhasználói szöveg szerver adatokat használunk, az exportált projektben elromolhat a szöveg megjelenítés, ha az export sablon más ICU verzióval készült!

source: Using editor embedded text server data, text display in the exported project might be broken if export template was built with different ICU version!
hu: Szerkesztőbe ágyazott szöveg szerver adatokat használunk, az exportált projektben elromolhat a szöveg megjelenítés, ha az export sablon más ICU verzióval készült!

source: Missing text server data, text display in the exported project might be broken!
hu: Hiányzó szöveg szerver adatok, az exportált projektben elromolhat a szöveg megjelenítés!

source: Could not open file to read from path "%s".
hu: A(z) "%s" útvonalon található fájl nem nyitható meg.

source: Packing
hu: Csomagolás

source: App Store Team ID not specified.
hu: Nincs megadva az App Store Team ID.

source: Invalid Identifier:
hu: Érvénytelen azonosító:

source: At least one file timestamp access reason should be selected.
hu: Legalább egy időbélyeg hozzáférési ok kiválasztása szükséges.

source: At least one disk space access reason should be selected.
hu: Legalább egy tárhelyhozzáférési ok kiválasztása szükséges.

source: At least one system boot time access reason should be selected.
hu: Legalább egy rendszerindítási idő hozzáférési ok kiválasztása szükséges.

source: "Shader Baker" doesn't work with the Compatibility renderer.
hu: A "Shader Baker" nem működik a Compatibility rendermotorral.

source: The editor is currently using a different renderer than what the target platform will use. "Shader Baker" won't be able to include core shaders. Switch to "%s" renderer temporarily to fix this.
hu: A szerkesztő jelenleg más rendermotort használ, mint amit a célplatform fog használni. "Shader Baker" nem fog tudni bizonyos shadereket használni. Ideiglenes megoldásként használja a "%s" rendermotort.

source: Target folder does not exist or is inaccessible: "%s"
hu: A célmappa nem létezik, vagy nem hozzáférhető: "%s"

source: Unexpected files found in the export destination directory "%s.xcodeproj", delete it manually or select another destination.
hu: Váratlan fájlok az export célmappájában "%s.xcodeproj", törölje kézzel, vagy válasszon másik célt.

source: Unexpected files found in the export destination directory "%s", delete it manually or select another destination.
hu: Váratlan fájlok az export célmappájában "%s", törölje kézzel, vagy válasszon másik célt.

source: Failed to export Apple Embedded plugins with code %d. Please check the output log.
hu: Az Apple Embedded plugins exportálása sikertelen %d hibakóddal. Ellenőrizze a kimeneti naplót.

source: Requested template library '%s' not found. It might be missing from your template archive.
hu: A kért sablon könyvtár "%s" nem található. Lehet, hogy hiányzik a sablon archívumból.

source: Code Signing
hu: Kód Aláírás

source: Code signing failed, see editor log for details.
hu: A kód aláírás sikertelen, részletek a szerkesztő naplójában.

source: Failed to run xcodebuild with code %d
hu: Az xcode build futtatása sikertelen %d hibakóddal

source: Xcode project build failed, see editor log for details.
hu: Xcode projekt építés sikertelen, részletek a szerkesztő naplójában.

source: .ipa export failed, see editor log for details.
hu: .ipa export sikertelen, részletek a szerkesztő naplójában.

source: .ipa can only be built on macOS. Leaving Xcode project without building the package.
hu: .ipa csak macOS-en építhető. Kilépés az Xcode projektből csomagépítés nélkül.

source: Exporting to an Apple Embedded platform when using C#/.NET is experimental and requires macOS.
hu: Apple Embedded platformra exportálás C#/.NET használata mellett csak kísérleti jellegű és macOS-t igényel.

source: Exporting to an Apple Embedded platform when using C#/.NET is experimental.
hu: Apple Embedded platformra exportálás C#/.NET használata mellett csak kísérleti jellegű.

source: Custom debug template not found.
hu: Az egyéni hibakeresési sablon nem található.

source: Custom release template not found.
hu: Az egyéni kiadási sablon nem található.

source: Invalid additional PList content:
hu: Érvénytelen további PList tartalom:

source: Select device from the list
hu: Válasszon készüléket a listából

source: Identifier is missing.
hu: Hiányzik az azonosító.

source: The character '%s' is not allowed in Identifier.
hu: A(z) "%s" karakter nem használható azonosítóban.

source: Running on %s
hu: Futtatás ezen: %s

source: Installation/running failed, see editor log for details.
hu: Telepítés/futtatás sikertelen, részletek a szerkesztő naplójában.

source: Installation failed, see editor log for details.
hu: Telepítés sikertelen, részletek a szerkesztő naplójában.

source: Running failed, see editor log for details.
hu: Futtatás sikertelen, részletek a szerkesztő naplójában.

source: "Shader Baker" is not supported when using the Compatibility renderer.
hu: "Shader Baker" nem támogatott a Compatibility rendermotor használatakor.

source: The editor is currently using a different renderer than what the target platform will use. "Shader Baker" won't be able to include core shaders. Switch to the "%s" renderer temporarily to fix this.
hu: A szerkesztő jelenleg más rendermotort használ, mint amit a célplatform fog használni. "Shader Baker" nem fog tudni bizonyos shadereket használni. Ideiglenes megoldásként használja a "%s" rendermotort.

source: A texture format must be selected to export the project. Please select at least one texture format.
hu: A projekt exportálásához ki kell választani egy textúra formátumot. Kérem válasszon legalább egy textúra formátumot.

source: PCK Embedding
hu: PCK Beépítés

source: On 32-bit exports the embedded PCK cannot be bigger than 4 GiB.
hu: 32-bites exportokon a beágyazott PCK nem lehet nagyobb mint 4 GiB.

source: Plugin "%s" is not supported on "%s"
hu: A(z) "%s" beépülő modul nem támogatott ezen: "%s"

source: Open the folder containing these templates.
hu: A sablonokat tartalmazó mappa megnyitása.

source: Uninstall these templates.
hu: Ezen sablonok eltávolítása.

source: Starting the download...
hu: Letöltés kezdése...

source: Error requesting URL:
hu: Hiba az URL kérésekor:

source: Download complete; extracting templates...
hu: Letöltés kész; sablonok kicsomagolása...

source: Cannot remove temporary file:
hu: Az ideiglenes fájl nem távolítható el:

source: Templates installation failed. The problematic templates archives can be found at '%s'.
hu: A sablonok telepítése sikertelen. A problémás sablonok archívuma megtalálható a következő helyen: '%s'.

source: Error getting the list of mirrors.
hu: Hiba történt a tükörlista lekérésekor.

source: Best available mirror
hu: Legjobb elérhető szerver

source: No download links found for this version. Direct download is only available for official releases.
hu: Nem található letöltési link ehhez a verzióhoz. Közvetlen letöltés csak a hivatalos kiadásokhoz elérhető.

source: Extracting Export Templates
hu: Export Sablonok Kibontása

source: Importing:
hu: Importálás:

source: Export templates are missing. Download them or install from a file.
hu: Export sablonok hiányoznak. Töltse le őket, vagy telepítse fájlból.

source: Export templates are missing. Install them from a file.
hu: Export sablonok hiányoznak. Telepítse őket fájlból.

source: Not available in offline mode
hu: Offline módban nem elérhető

source: Template downloading is disabled in offline mode.
hu: A sablon letöltés offline módban ki van kapcsolva.

source: Official export templates aren't available for development builds.
hu: Hivatalos export sablonok nem elérhetőek fejlesztői változatokhoz.

source: Official export templates aren't available for double-precision builds.
hu: Hivatalos export sablonok nem elérhetőek dupla pontosságú változatokhoz.
