Repository: zhangjiangen11/godot
Catalog: editor/translations/editor/*.po
Languages: hu

source: Creates a box, capsule, cylinder, or sphere primitive collision shape if the mesh is a primitive. The mesh must use the built-in BoxMesh, CapsuleMesh, CylinderMesh, or SphereMesh primitive. This is faster than the convex collision shape option for collision detection.
hu: Doboz, kapszula, cilinder vagy gömb primitív ütközési alakzatot hoz létre, ha a mesh primitív. A mesh-nek a beépített BoxMesh, CapsuleMesh, vagy SphereMesh primitíveket kell használnia. Ütközésérzékeléshez gyorsabb, mint a konvex ütközési alakzat opció.

source: Alignment Axis
hu: Igazítási Tengely

source: Longest Axis
hu: Leghosszabb Tengely

source: Create the shape along the longest axis of the mesh's AABB.
hu: Létrehozza az alakzatot a mesh AABB tulajdonságának leghosszabb tengelye mentén.

source: X-Axis
hu: X-Tengely

source: Create the shape along the local X-Axis.
hu: A lokális X-tengely mentén hozza létre az alakzatot.

source: Y-Axis
hu: Y-Tengely

source: Create the shape along the local Y-Axis.
hu: A lokális Y-tengely mentén hozza létre az alakzatot.

source: Z-Axis
hu: Z-Tengely

source: Create the shape along the local Z-Axis.
hu: A lokális Z-tengely mentén hozza létre az alakzatot.

source: UV Channel Debug
hu: UV Csatorna Hibakeresés

source: Before converting a rendering mesh to a navigation mesh, please verify: - The mesh is two-dimensional. - The mesh has no surface overlap. - The mesh has no self-intersection. - The mesh surfaces have indices. If the mesh does not fulfill these requirements, the pathfinding will be broken.
hu: Mielőtt egy renderelő mesh-t navigációs mesh-sé alakít, ellenőrizze az alábbiakat: - A mesh kétdimenziós. - A mesh-nek nincs felületátfedése. - A mesh-nek nincs önmetszése. - A mesh felületeinek vannak indexei. Ha a mesh nem teljesíti ezeket a feltételeket, akkor az útkeresés nem fog működni.

source: Remove item %d?
hu: %d elem eltávolítása?

source: Update from existing scene?: %s
hu: Frissíti a meglévő jelenetből?: %s

source: Add Item
hu: Elem Hozzáadása

source: Remove Selected Item
hu: Kijelölt Elem Eltávolítása

source: Update from Scene
hu: Frissítés Jelenetből

source: No mesh source specified (and no MultiMesh set in node).
hu: Nincs háló forrás meghatározva (és nincs MultiMesh a Node-ban beállítva).

source: No mesh source specified (and MultiMesh contains no Mesh).
hu: Nincs háló forrás meghatározva (és a MultiMesh nem tartalmaz Mesh-t).

source: Mesh source is invalid (invalid path).
hu: Mesh forrás érvénytelen (érvénytelen útvonal).

source: Mesh source is invalid (contains no Mesh resource).
hu: Mesh forrás érvénytelen (nem tartalmaz Mesh erőforrást).

source: No surface source specified.
hu: Nincs felületi forrás meghatározva.

source: Surface source is invalid (invalid path).
hu: Felületi forrás érvénytelen (érvénytelen útvonal).

source: Surface source is invalid (no geometry).
hu: Felületi forrás érvénytelen (nincs geometria).

source: Surface source is invalid (no faces).
hu: Felületi forrás érvénytelen (nincsenek oldalak).

source: Select a Source Mesh:
hu: Válasszon Ki Egy Forrás Mesh-t:

source: Select a Target Surface:
hu: Válasszon Ki Egy Cél Felületet:

source: Populate Surface
hu: Felület Kitöltése

source: Populate MultiMesh
hu: MultiMesh Kitöltése

source: Target Surface:
hu: Cél Felület:

source: Source Mesh:
hu: Forrás Mesh:

source: Mesh Up Axis:
hu: Mesh "Fel" Tengelye:

source: Random Rotation:
hu: Véletlenszerű Forgatás:

source: Random Tilt:
hu: Véletlenszerű Billentés:

source: Random Scale:
hu: Véletlenszerű Skálázás:

source: Amount:
hu: Mennyiség:

source: Populate
hu: Kitöltés

source: Transform Aborted.
hu: Átalakítás Megszakítva.

source: Orthogonal
hu: Ortogonális

source: Perspective
hu: Perspektíva

source: X-Axis Transform.
hu: X-Tengely Transzformáció.

source: Y-Axis Transform.
hu: Y-tengely Transzformáció.

source: Z-Axis Transform.
hu: Z-Tengely Transzformáció.

source: View Plane Transform.
hu: Megnéz a Síklap transzformációját.

source: Keying is disabled (no key inserted).
hu: A kulcsolás le van tiltva (nincs kulcs megadva).

source: Animation Key Inserted.
hu: Animációs Kulcs Beillesztve.

source: Drag and drop to override the material of any geometry node. Hold %s when dropping to override a specific surface.
hu: Ráhúzással felülírható bármely geometria node anyaga. Tartsa nyomva a %s billentyűt a ráejtéskor egy konkrét felület felülírásához.

source: This debug draw mode is only supported when using the Forward+ or Mobile renderer.
hu: Ez a hibakereső rajz mód csak a Forward+ és Mobile rendermotorok esetén támogatott.

source: This debug draw mode is only supported when using the Forward+ renderer.
hu: Ez a hibakereső rajz mód csak a Forward+ rendermotorok esetén támogatott.

source: CPU Time: %s ms
hu: CPU Idő: %s ms

source: GPU Time: %s ms
hu: GPU Idő: %s ms

source: Top View.
hu: Felső nézet.

source: Bottom View.
hu: Alsó nézet.

source: Left View.
hu: Bal nézet.

source: Right View.
hu: Jobb nézet.

source: Front View.
hu: Első nézet.

source: Rear View.
hu: Hátsó nézet.

source: Align Transform with View
hu: Transzformáció Nézethez Igazítása

source: Align Rotation with View
hu: Forgás Nézethez Igazítása

source: Set Surface %d Override Material
hu: Felület %d Felülíró Anyagának Beállítása

source: Circular dependency found at %s
hu: Körkörös függőség található itt: %s

source: Rotating %s degrees.
hu: %s fokkal való forgatás.

source: Rotating %f degrees.
hu: Forgatás %f fokkal.

source: View
hu: Nézet

source: Auto Orthogonal Enabled
hu: Auto Ortogonális Bekapcsolva

source: Lock View Rotation
hu: Nézet Forgás Zárolása

source: Display Normal
hu: Normális Nézet

source: Display Wireframe
hu: Drótváz Nézet

source: Display Overdraw
hu: Megjelenítés Túlrajzolás

source: Display Unshaded
hu: Megjelenítés Shading Nélkül

source: Displays directional shadow splits in different colors to make adjusting split thresholds easier. Red: 1st split (closest to the camera), Green: 2nd split, Blue: 3rd split, Yellow: 4th split (furthest from the camera)
hu: Színezett irányított árnyszeleteket jelenít meg, megkönnyítve ezzel a szeletek küszöbértékeinek beállítását. Piros: 1. szelet (legközelebb a kamerához), Zöld: 2. szelet, Kék: 3. szelet, Sárga: 4. szelet (legtávolabb a kamerától)

source: Normal Buffer
hu: Normál Buffer

source: Shadow Atlas
hu: Árnyékatlasz

source: Displays the shadow atlas used for positional (omni/spot) shadow mapping. Requires a visible OmniLight3D or SpotLight3D node with shadows enabled to have a visible effect.
hu: Megjeleníti a helyzetalapú (omni/spot) árnyéktérképhez használt árnyékatlaszt. Látható és engedélyezett árnyékokkal rendelkező OmniLight3D vagy SpotLight3D node szükséges az érzékelhető eredményhez.

source: Displays the shadow map used for directional shadow mapping. Requires a visible DirectionalLight3D node with shadows enabled to have a visible effect.
hu: Megjeleníti az irányított árnyéktérképezéshez használt árnyéktérképet. Látható és engedélyezett árnyékokkal rendelkező DirectionalLight3D node szükséges az érzékelhető eredményhez.

source: Decal Atlas
hu: Decal Atlasz

source: Requires a visible VoxelGI node that has been baked to have a visible effect.
hu: Látható és beégetett VoxelGI node szükséges az érzékelhető eredményhez.

source: VoxelGI Albedo
hu: VoxelGI Albedó

source: SDFGI Cascades
hu: SDFGI Kaszkádok

source: Requires SDFGI to be enabled in Environment to have a visible effect.
hu: A Környezetben engedélyezett SDFGI szükséges az érzékelhető eredményhez.

source: Left-click a SDFGI probe to display its occlusion information (white = not occluded, red = fully occluded). Requires SDFGI to be enabled in Environment to have a visible effect.
hu: Bal-klikk az SDFGI szondára a az okklúzió információ megjelenítéséhez (fehér = nincs okklúzió, piros = teljes okklúzió). A Környezetben engedélyezett SDFGI szükséges az érzékelhető eredményhez.

source: Displays the scene luminance computed from the 3D buffer. This is used for Auto Exposure calculation. Requires Auto Exposure to be enabled in CameraAttributes to have a visible effect.
hu: Megjeleníti a 3D buffer-ből számolt jelenet fényességet. Ez az Auto Expozíció kalkulációhoz használatos. A CameraAttributes beállításokban engedélyezett Auto Expozíció szükséges az érzékelhető eredményhez.

source: Displays the screen-space ambient occlusion buffer. Requires SSAO to be enabled in Environment to have a visible effect.
hu: Megjeleníti a screen-space környezeti sugárkövetés buffert. A Környezetben engedélyezett SSAO szükséges az érzékelhető eredményhez.

source: Displays the screen-space indirect lighting buffer. Requires SSIL to be enabled in Environment to have a visible effect.
hu: Megjeleníti a screen-space közvetett megvilágítás buffert. A Környezetben engedélyezett SSIL szükséges az érzékelhető eredményhez.

source: Requires SDFGI or VoxelGI to be enabled to have a visible effect.
hu: Engedélyezett SDFGI vagy VoxelGI szükséges az érzékelhető eredményhez.

source: Renders all meshes with their highest level of detail regardless of their distance from the camera.
hu: Minden mesh-t a legmagasabb részletezettségi szinten renderel függetlenül a kamera távolságától.

source: OmniLight3D Cluster
hu: OmniLight3D Csoport

source: Highlights tiles of pixels that are affected by at least one OmniLight3D.
hu: Kiemeli a legalább egy OmniLight3D által érintett pixelcsempéket.

source: SpotLight3D Cluster
hu: SpotLight3D Csoport

source: Highlights tiles of pixels that are affected by at least one SpotLight3D.
hu: Kiemeli a legalább egy SpotLight3D által érintett pixelcsempéket.

source: Decal Cluster
hu: Decal Csoport

source: Highlights tiles of pixels that are affected by at least one Decal.
hu: Kiemeli a legalább egy Decal által érintett pixelcsempéket.

source: Highlights tiles of pixels that are affected by at least one ReflectionProbe.
hu: Kiemeli a legalább egy ReflectionProbe által érintett pixelcsempéket.

source: Represents occluders with black pixels. Requires occlusion culling to be enabled to have a visible effect.
hu: Fekete pixeleket tartalmazó occluder-eket képvisel. Engedélyezett occlusion culling szükséges az érzékelhető eredményhez.

source: Represents motion vectors with colored lines in the direction of motion. Gray dots represent areas with no per-pixel motion.
hu: Mozgásvektorokat képvisel mozgásiránynak megfelelő színes vonalak képében. A szürke pontok pixelenkénti mozdulatlanságot képviselnek.

source: Internal Buffer
hu: Belső Buffer

source: Shows the scene rendered in linear colorspace before any tonemapping or post-processing.
hu: Megmutatja a renderelt jelenetet színleképezés és utófeldolgozás előtti lineáris színtérben.

source: View Environment
hu: Környezet Megtekintése

source: View Gizmos
hu: Gizmók Megtekintése

source: View Grid
hu: Négyzethálós Nézet

source: View Information
hu: Információ Megtekintése

source: Half Resolution
hu: Fél Felbontás

source: Enable Doppler
hu: Doppler Engedélyezése

source: Cinematic Preview
hu: Filmszerű előnézet

source: Viewport Orbit Modifier 1
hu: Betekintő Pálya Módosító 1

source: Viewport Orbit Modifier 2
hu: Betekintő Pálya Módosító 2

source: Viewport Orbit Snap Modifier 1
hu: Betekintő Pálya Illesztés Módosító 1

source: Viewport Orbit Snap Modifier 2
hu: Betekintő Pálya Illesztés Módosító 2

source: Viewport Pan Modifier 1
hu: Betekintő Csúsztatás Módosító 1

source: Viewport Pan Modifier 2
hu: Betekintő Csúsztatás Módosító 2

source: Viewport Zoom Modifier 1
hu: Betekintő Nagyítás Módosító 1

source: Viewport Zoom Modifier 2
hu: Betekintő Nagyítás Módosító 2

source: Freelook Left
hu: Szabadnézet Bal

source: Freelook Right
hu: Szabadnézet Jobb

source: Freelook Forward
hu: Szabadnézet Előre

source: Freelook Backwards
hu: Szabadnézet Hátra

source: Freelook Up
hu: Szabadnézet Fel

source: Freelook Down
hu: Szabadnézet Le

source: Freelook Speed Modifier
hu: Szabadnézet Sebesség Módosító

source: Freelook Slow Modifier
hu: Szabadnézet Lassítás Módosító

source: Lock Transformation to X axis
hu: X tengelyre Transzformálás Zárolása

source: Lock Transformation to Y axis
hu: Y tengelyre Transzformálás Zárolása

source: Lock Transformation to Z axis
hu: Z tengelyre Transzformálás Zárolása

source: Lock Transformation to YZ plane
hu: YZ síkra Transzformálás Zárolása

source: Lock Transformation to XZ plane
hu: XZ síkra Transzformálás Zárolása

source: Lock Transformation to XY plane
hu: XY síkra Transzformálás Zárolása

source: Begin Translate Transformation
hu: Áthelyezés Transzformáció Indítása

source: Reposition Using Collisions
hu: Áthelyezés Ütközések Használatával

source: View Rotation Locked
hu: Nézet Forgás Zárolva

source: To zoom further, change the camera's clipping planes (View → Settings...)
hu: További nagyításhoz változtasson a kamera vágósíkjain (Nézet → Beállítások...)

source: Overriding material...
hu: Anyag felülírása...

source: XForm Dialog
hu: XForm Párbeszédablak

source: Lock Selected
hu: Kijelölés zárolása

source: Unlock Selected
hu: Kijelölés feloldása

source: Group Selected
hu: Kijelöltek csoportosítása

source: Ungroup Selected
hu: kijelölt csoportok szétbontása

source: Click to toggle between visibility states. Open eye: Gizmo is visible. Closed eye: Gizmo is hidden. Half-open eye: Gizmo is also visible through opaque surfaces ("x-ray").
hu: Kattintással váltható a láthatósági állapot. Nyitott szem: A gizmo látható. Csukott szem: A gizmo rejtett. Félig nyitott szem: A gizmo az átlászatlan felületeken keresztül is látható ("röntgen").

source: Couldn't find a solid floor to snap the selection to.
hu: Nincs tömör padló, amelyhez a kiválasztást illeszteni lehetne.

source: Add Preview Environment to Scene
hu: Előnézeti Környezet Jelenethez Adása

source: Scene contains DirectionalLight3D. Preview disabled.
hu: A jelenetben DirectionalLight3D van. Előnézet letiltva.

source: Scene contains WorldEnvironment. Preview disabled.
hu: A jelenetben WorldEnvironment van. Előnézet letiltva.

source: Set Preview Sun Max Shadow Distance
hu: Előnézeti Nap Max Árnyék Távolság Beállítása

source: Move Mode
hu: Mozgató Mód

source: Rotate Mode
hu: Forgató Mód

source: Scale Mode
hu: Méretezési mód

source: Select Mode
hu: Kiválasztó Mód

source: Lock selected node, preventing selection and movement.
hu: Kijelölt node zárolása, ezzel a kijelölés és mozgás megakadályozása.

source: Groups the selected node with its children. This selects the parent when any child node is clicked in 2D and 3D view.
hu: Csoportosítja a kijelölt node-ot és annak gyermekeit. Ez kijelöli a szülőt, amikor bármely gyermek node-ra kattint 2D vagy 3D nézetben.

source: Ungroups the selected node from its children. Child nodes will be individual items in 2D and 3D view.
hu: Szétválasztja a kijelölt node-ot és annak gyermekeit. A gyermek node-ok önállóvá válnak 2D és 3D nézetben.

source: LMB+Drag: Measure the distance between two points in 3D space.
hu: LMB+Húzás: Távolságmérés két pont között 3D térben.

source: Ruler Mode
hu: Vonalzó mód

source: Use Local Space
hu: Lokális Környezet Használata

source: Use Snap
hu: Illesztés Használata

source: Toggle preview sunlight. If a DirectionalLight3D node is added to the scene, preview sunlight is disabled.
hu: Napfény előnézet kapcsolása. Ha egy DirectionalLight3D node kerül a jelenetbe, a napfény előnézet letiltásra kerül.

source: Toggle preview environment. If a WorldEnvironment node is added to the scene, preview environment is disabled.
hu: Előnézeti környezet kapcsolása. Ha egy WorldEnvironment node kerül a jelenetbe, az előnézeti környezet letiltásra kerül.

source: Edit Sun and Environment settings.
hu: Nap és Környezet beállítások módosítása.

source: Bottom View
hu: Alsó Nézet

source: Top View
hu: Felső Nézet

source: Rear View
hu: Hátsó Nézet

source: Front View
hu: Első Nézet

source: Left View
hu: Bal Nézet

source: Right View
hu: Jobb Nézet

source: Orbit View Down
hu: Orbit Nézet Le

source: Orbit View Left
hu: Orbit Nézet Bal

source: Orbit View Right
hu: Orbit Nézet Jobb

source: Orbit View Up
hu: Orbit Nézet Fel

source: Orbit View 180
hu: Orbit Nézet 180

source: Switch Perspective/Orthogonal View
hu: Perspektívikus/Ortogonális Nézet Váltás

source: Insert Animation Key
hu: Animációs Kulcs Beszúrása

source: Focus Origin
hu: Eredet Fókuszálása

source: Focus Selection
hu: Kiválasztott Fókuszálása

source: Toggle Freelook
hu: Szabadnézet Kapcsolása

source: Decrease Field of View
hu: Látómező (FOV) Csökkentése

source: Increase Field of View
hu: Látómező (FOV) Növelése

source: Transform
hu: átalakítás

source: Snap Object to Floor
hu: Objektum illesztése a padlóhoz

source: Transform Dialog...
hu: Átalakítás Párbeszédablak...

source: Configure Snap...
hu: Illesztés Beállítása...

source: 1 Viewport
hu: 1 Nézetablak

source: 2 Viewports
hu: 2 Nézetablak

source: 2 Viewports (Alt)
hu: 2 Nézetablak (Alt)

source: 3 Viewports
hu: 3 Nézetablak

source: 3 Viewports (Alt)
hu: 3 Nézetablak (Alt)

source: 4 Viewports
hu: 4 Nézetablak

source: Gizmos
hu: Gizmók

source: View Origin
hu: Eredet Nézet

source: Settings...
hu: Beállítások...

source: Snap Settings
hu: Illesztés Beállítások

source: Translate Snap:
hu: Illesztés Áthelyezés:

source: Viewport Settings
hu: Nézetablak Beállítások

source: FOV is defined as a vertical value, as the editor camera always uses the Keep Height aspect mode.
hu: Az FOV vertikális értékként definiált, mert a szerkesztő kamerája mindig Magasságtartás nézet módot használ.

source: View Z-Near:
hu: Z-Közel Nézet:

source: View Z-Far:
hu: Z-Távol Nézet:

source: Transform Change
hu: Átalakítás Módosítása

source: Translate:
hu: Áthelyezés:

source: Rotate (deg.):
hu: Forgatás (fok):

source: Azimuth
hu: Azimut

source: Adds a DirectionalLight3D node matching the preview sun settings to the current scene. Hold Shift while clicking to also add the preview environment to the current scene.
hu: DirectionalLight3D node-ot ad a jelenethez, ami egyezik az előnézeti nap beállításaival. Shift nyomvatartása mellett az előnézeti környezetet is hozzáadja a jelenethez.

source: Glow
hu: Ragyogás

source: Tonemap
hu: Tónustérkép

source: Adds a WorldEnvironment node matching the preview environment settings to the current scene. Hold Shift while clicking to also add the preview sun to the current scene.
hu: WorldEnvironment node-ot ad a jelenethez, ami egyezik az előnézeti környezet beállításaival. Shift nyomvatartása mellett az előnézeti napot is hozzáadja a jelenethez.

source: No meshes to bake. Make sure there is at least one MeshInstance3D node in the scene whose visual layers are part of the OccluderInstance3D's Bake Mask property.
hu: Nincs égethető mesh. Ellenőrizze, hogy legalább egy MeshInstance3D node van a jelenetben, amikor vizuális rétege egyezik az OccluderInstance3D Égetőmaszk tulajdonságával.

source: Generating Visibility AABB (Waiting for Particle Simulation)
hu: Láthatósági AABB Generálás (Várakozás Részecske Szimulációra)

source: Generate Visibility AABB
hu: Láthatósági AABB Generálása

source: "%s" doesn't contain geometry.
hu: A(z) "%s" nem tartalmaz geometriát.

source: "%s" doesn't contain face geometry.
hu: A(z) "%s" nem tartalmaz lapgeometriát.

source: Create Emission Points From Node
hu: Kibocsátási pontok létrehozása a Node alapján

source: The geometry's faces don't contain any area.
hu: A geometria oldallapjai nem tartalmaznak területet.

source: The geometry doesn't contain any faces.
hu: A geometria nem tartalmaz oldalakat.

source: Create Emitter
hu: Kibocsátó Létrehozása

source: Emission Points:
hu: Kibocsátási Pontok:

source: Emission Source:
hu: Kibocsátási Forrás:

source: Surface Points
hu: Felületi Pontok

source: Surface Points+Normal (Directed)
hu: Felületi Pontok + Normálok (Irányított)

source: Curve Point #
hu: Görbe Pont #

source: Handle In #
hu: Bemenet # Kezelés

source: Handle Out #
hu: Kimenet # Kezelés

source: Set Curve Point Position
hu: Görbe Pont Pozíció Beállítása

source: Set Curve Out Position
hu: Ki-Görbe Pozíció Beállítása

source: Set Curve In Position
hu: Be-Görbe Pozíció Beállítása

source: Split Path
hu: Útvonal Felosztása

source: Remove Path Point
hu: Útvonal Pont Eltávolítása

source: Split Segment (in curve)
hu: Szakasz Felosztása (görbén)

source: Move Joint
hu: Csukló Mozgatás

source: Create Polygon3D
hu: Polygon3D Létrehozása

source: Edit Poly
hu: Sokszög Szerkesztése

source: Edit Poly (Remove Point)
hu: Sokszög Szerkesztése (Pont Eltávolítása)

source: AnimationMixer has no valid root node path, so unable to retrieve track names.
hu: Nincs érvényes node útvonal az AnimationMixer-hez, ezért a sávneveket nem lehet lekérdezni.

source: Add Bone Metadata
hu: Csont Metaadat Hozzáadás

source: Modify metadata '%s' for bone '%s'
hu: A(z) "%s" metaadat módosítása a(z) "%s" csonton

source: Cannot create a physical skeleton for a Skeleton3D node with no bones.
hu: Nem lehet fizikai vázat létrehozni csontok nélküli Skeleton3D node-hoz.

source: Create physical bones
hu: Fizikai csontok létrehozása

source: Cannot export a SkeletonProfile for a Skeleton3D node with no bones.
hu: SkeletonProfile exportálása nem lehetséges csontok nélküli Skeleton3D node esetén.

source: Apply All Poses to Rests
hu: Minden Póz Alkalmazása Nyugalomhoz

source: Apply Selected Poses to Rests
hu: Kijelölt Pózok Alkalmazása Nyugalomhoz

source: Edit Mode Show buttons on joints.
hu: Módosítás Gombok mutatása a csuklókon.

source: Translation mask for inserting keys.
hu: Áthelyezési maszk kulcs beillesztéshez.

source: Rotation mask for inserting keys.
hu: Forgatási maszk kulcs beillesztéshez.

source: Scale mask for inserting keys.
hu: Méretezési maszk kulcs beillesztéshez.

source: Insert key (based on mask) for bones with an existing track.
hu: Kulcs beillesztés (maszk alapján) sávval rendelkező csontokhoz.

source: Insert Key (Existing Tracks)
hu: Kulcs Beszúrása (Meglévő Nyomvonalakra)

source: Insert key (based on mask) for all bones.
hu: Kulcs beillesztés (maszk alapján) minden csonthoz.

source: Insert key (based on mask) for modified bones with an existing track.
hu: Kulcs beillesztés (maszk alapján) sávval rendelkező módosított csontokhoz.

source: Insert new key (based on mask) for all modified bones.
hu: Új kulcs beillesztés (maszk alapján) minden módosított csonthoz.

source: Play IK
hu: IK Lejátszás

source: Voxel GI data is not local to the scene.
hu: A Voxel GI adatok nem lokálisak a jeleneten.

source: Voxel GI data is part of an imported resource.
hu: A Voxel GI adatok importált erőforráshoz tartoznak.

source: Voxel GI data is an imported resource.
hu: A Voxel GI adathalmaz importált erőforrás.

source: Bake VoxelGI
hu: VoxelGI Beégetése

source: Configure Snap
hu: Illesztés Beállítása

source: Grid Offset:
hu: Rács Eltolás:

source: Grid Step:
hu: Rács Léptetés:

source: Primary Line Every:
hu: Elsődleges vonal minden:

source: Rotation Offset:
hu: Forgatási Eltolás:

source: Rotation Step:
hu: Forgatási Léptetés:

source: Scale Step:
hu: Méretezés Lépték:

source: Children of a container get their position and size determined only by their parent.
hu: Egy konténer gyermekeinek helyzetét és méretét kizárólag a szülő határozza meg.

source: Move Vertical Guide
hu: Függőleges segédvonal mozgatása

source: Create Vertical Guide
hu: Függőleges segédvonal létrehozása

source: Remove Vertical Guide
hu: Függőleges segédvonal eltávolítása

source: Move Horizontal Guide
hu: Vízszintes segédvonal mozgatása

source: Create Horizontal Guide
hu: Vízszintes segédvonal létrehozása

source: Remove Horizontal Guide
hu: Vízszintes segédvonal eltávolítása

source: Create Horizontal and Vertical Guides
hu: Vízszintes és függőleges segédvonalak létrehozása

source: Set CanvasItem "%s" Pivot Offset to (%d, %d)
hu: CanvasItem "%s" Forgáspont Eltolásának Beállítása (%d, %d)
