Repository: zhangjiangen11/godot
Catalog: editor/translations/editor/*.po
Languages: hu

source: ERROR: Couldn't load frame resource!
hu: HIBA: A kép erőforrást nem lehetett betölteni!

source: Add Empty
hu: Üres Hozzáadása

source: Move Frame
hu: Keret mozgatása

source: Delete Animation?
hu: Animáció Törlése?

source: Change Animation FPS
hu: Animáció FPS Módosítása

source: Animations:
hu: Animációk:

source: This resource does not have any animations.
hu: Nincs animáció társítva ehhez az erőforráshoz.

source: Animation Frames:
hu: Animációs Képkockák:

source: Empty Before
hu: Üres Előtte

source: Zoom Reset
hu: Nagyítás visszaállítása

source: Insert Empty (After Selected)
hu: Üres Beillesztése (Kijelölt Után)

source: Select Frames
hu: Képkockák Kijelölése

source: By Row
hu: Soronként

source: Left to Right, Top to Bottom
hu: Balról Jobbra, Fentről Lefelé

source: Left to Right, Bottom to Top
hu: Balról Jobbra, Lentről Felfelé

source: Right to Left, Top to Bottom
hu: Jobbról Balra, Fentről Lefelé

source: Right to Left, Bottom to Top
hu: Jobbról Balra, Lentről Felfelé

source: By Column
hu: Oszloponként

source: Create Frames from Sprite Sheet
hu: Képkockák Készítése Sprite Lapból

source: Move GradientTexture2D Fill Point
hu: GradientTexture2D Kitöltés Pont Mozgatása

source: Swap GradientTexture2D Fill Points
hu: GradientTexture2D Kitöltés Pont Cseréje

source: Swap Gradient Fill Points
hu: Átmenet Kitöltés Pontok Cseréje

source: %s Mipmaps
hu: %s Mipmapek

source: No Mipmaps
hu: Nincsenek Mipmapek

source: Set Margin
hu: Margó Beállítása

source: Set Region Rect
hu: Régió Téglalap Beállítás

source: Snap Mode:
hu: Illesztés Mód:

source: Pixel Snap
hu: Pixelre Illesztés

source: Step:
hu: Lépés:

source: Write your logic in the _run() method.
hu: Írja a logikát a _run() metódusba.

source: Find in Files
hu: Keresés a fájlokban

source: Find:
hu: Keres:

source: Folder:
hu: Mappa:

source: Include the files with the following expressions. Use "," to separate.
hu: Az alábbi kifejezésekkel rendelkező fájlok belefoglalása. Elválasztás ","-vel.

source: example: scripts,scenes/*/test.gd
hu: például: scripts,scenes/*/test.gd

source: Excludes:
hu: Kizárás:

source: Exclude the files with the following expressions. Use "," to separate.
hu: Az alábbi kifejezésekkel rendelkező fájlok kizárása. Elválasztás ","-vel.

source: example: res://addons,scenes/test/*.gd
hu: például: res://addons,scenes/test/*.gd

source: Filters:
hu: Szűrők:

source: Include the files with the following extensions. Add or remove them in ProjectSettings.
hu: Az alábbi kiterjesztésekkel rendelkező fájlok belefoglalása. A Projekt Beállításokban adhat hozzá újat vagy távolíthat el létezőt.

source: Find...
hu: Keresés...

source: Replace...
hu: Csere...

source: Keep these results and show subsequent results in a new window
hu: Eredmények megtartása és a további eredmények mutatása új ablakban

source: Searching...
hu: Keresés…

source: Path is empty.
hu: Az útvonal üres.

source: Filename is empty.
hu: A fájlnév üres.

source: Name begins with a dot.
hu: A név ponttal kezdődik.

source: Path is not local.
hu: Az útvonal nem helyi.

source: A directory with the same name exists.
hu: Létezik ilyen nevű könyvtár.

source: File does not exist.
hu: A fájl nem létezik.

source: Invalid extension.
hu: Érvénytelen kiterjesztés.

source: Extension doesn't match chosen language.
hu: A kiterjesztés nem egyezik a választott programnyelvvel.

source: Template:
hu: Sablon:

source: Error - Could not create script in filesystem.
hu: Hiba - A szkript létrehozása a fájlrendszerben sikertelen.

source: Error loading script from %s
hu: Hiba a %s kód betöltése közben

source: Open Script / Choose Location
hu: Szkript Megnyitása / Hely Kiválasztása

source: Open Script
hu: Szkript megnyitása

source: Invalid path.
hu: Érvénytelen útvonal.

source: Invalid inherited parent name or path.
hu: Érvénytelen leszármazott szülő név vagy útvonal.

source: File exists, it will be reused.
hu: A fájl már létezik, újra felhasználjuk.

source: Note: Built-in scripts have some limitations and can't be edited using an external editor.
hu: Megjegyzés: A beépített szkriptek bizonyos megkötések miatt nem módosíthatóak külső szerkesztővel.

source: Warning: Having the script name be the same as a built-in type is usually not desired.
hu: Figyelmeztetés: Általában nem kívánatos a szkript nevét egy beépített típus nevére nevezni.

source: Built-in script (into scene file).
hu: Beépített szkript (jelenet fájlban).

source: Will load an existing script file.
hu: Egy meglévő szkriptfájlt tölt be.

source: Script file already exists.
hu: A szkriptfájl már létezik.

source: Script path/name is valid.
hu: A szkript útvonala/neve érvényes.

source: Will create a new script file.
hu: Létrehoz egy új szkriptfájlt.

source: Built-in Script:
hu: Beépített szkript:

source: Attach Node Script
hu: Szkript Node-hoz csatolása

source: (truncated)
hu: (levágott)

source: Can't open '%s'. The file could have been moved or deleted.
hu: A(z) '%s' nem nyitható meg. Lehet, hogy a fájlt áthelyezték vagy törölték.

source: Close and save changes?
hu: Bezárja és menti a változásokat?

source: Importing theme failed. File is not a text editor theme file (.tet).
hu: Téma importálás sikertelen. A fájl nem szövegszerkesztő téma fájl (.tet).

source: Importing theme failed. File name cannot be 'Default', 'Custom', or 'Godot 2'.
hu: Téma importálás siekrtelen. A fájlnév nem lehet "Default", "Custom", vagy "Godot 2".

source: Importing theme failed. Failed to copy theme file.
hu: Téma importálás sikertelen. Téma fájl másolása sikertelen.

source: Saving theme failed. File name cannot be 'Default', 'Custom', or 'Godot 2'.
hu: Téma mentése sikertelen. A fájlnév nem lehet "Default", "Custom", vagy "Godot 2".

source: New Text File...
hu: Új szövegfájl...

source: Open File
hu: Fájl megnyitása

source: Save File As...
hu: Fájl mentése másként...

source: Can't obtain the script for reloading.
hu: A szkript nem szerezhető meg újratöltéshez.

source: Reload only takes effect on tool scripts.
hu: Az újratöltés csak az eszköz szkriptekre van hatással.

source: Cannot run the edited file because it's not a script.
hu: A módosított fájl nem futtatható, mert nem szkript.

source: Import Theme
hu: Téma Importálása

source: Save Theme As...
hu: Téma Mentése Másként...

source: Online Docs
hu: Online Dokumentáció

source: Open Godot online documentation.
hu: Godot online dokumentáció megnyitása.

source: Unsaved file.
hu: Nem mentett fájl.

source: %s Class Reference
hu: %s Osztály Referencia

source: Find Next
hu: Következő Keresése

source: Find Previous
hu: Előző Keresése

source: Toggle alphabetical sorting of the method list.
hu: Ábécészerinti rendezés változtatása a metóduslistában.

source: Sort
hu: Rendezés

source: Open...
hu: Megnyitás...

source: Save All
hu: Összes Mentése

source: Copy Script Path
hu: Szkript Útvonal Másolása

source: History Previous
hu: Előző előzmény

source: History Next
hu: Következő Előzmény

source: Import Theme...
hu: Téma importálása...

source: Reload Theme
hu: Téma Újratöltése

source: Close All
hu: Mind Bezárása

source: Close Docs
hu: Dokumentációs Lapok Bezárása

source: Search the reference documentation.
hu: Keresés a referencia dokumentációban.

source: Go to previous edited document.
hu: Ugrás az előzőleg szerkesztett dokumentumra.

source: Go to next edited document.
hu: Ugrás a következőleg szerkesztett dokumentumra.

source: Discard
hu: Elvetés

source: Script Editor
hu: Szkript szerkesztő

source: There are unsaved changes in the following built-in script(s):
hu: Az alábbi beépített szkript(ek)ben elmentetlen változások vannak:

source: Reopen Closed Script
hu: Bezárt szkript újbóli megnyitása

source: Clear Recent Scripts
hu: Legutóbbi szkriptek törlése

source: Uppercase
hu: Mind Nagybetű

source: Lowercase
hu: Mind Kisbetű

source: Capitalize
hu: Szó Eleji Nagybetű

source: Standard
hu: Alapértelmezett

source: Connections to method:
hu: Kapcsolatok a metódushoz:

source: Source
hu: Forrás

source: Target
hu: Cél

source: Error at ([hint=Line %d, column %d]%d, %d[/hint]):
hu: Hiba ([hint=Sor %d, oszlop %d]%d, %d[/hint]):

source: Missing connected method '%s' for signal '%s' from node '%s' to node '%s'.
hu: Nincs kapcsolt metódus "%s" a(z) "%s" jelhez, ami a(z) "%s" node-ból a(z) "%s" node-ba mutatna.

source: [Ignore]
hu: [Mellőz]

source: The resource does not have a valid path because it has not been saved. Please save the scene or resource that contains this resource and try again.
hu: Ennek az erőforrásnak nincs érvényes útvonala, mert nincs elmentve. Mentse el a jelenetet vagy erőforrást, amiben ez az erőforrás szerepel és próbálja újra.

source: Preloading internal resources is not supported.
hu: Belső erőforrások előbetöltése nem támogatott.

source: Can't drop nodes because script '%s' does not inherit Node.
hu: Nem dobhatóak el a node-ok, mert a(z) "%s" szkript nem Node-ból öröklődik.

source: Emoji & Symbols
hu: Emoji és Szimbólumok

source: Pick Color
hu: Szín Választása

source: Go to Function
hu: Ugrás függvényre

source: Line
hu: Sor

source: Convert Case
hu: Kis- és Nagybetűk Konvertálása

source: Syntax Highlighter
hu: Szintaxis Kiemelő

source: Bookmarks
hu: Könyvjelzők

source: Go To
hu: Ugrás

source: Delete Line
hu: Sor Törlése

source: Toggle Comment
hu: Átváltás Megjegyzésre

source: Fold/Unfold Line
hu: Sor Összezárása/Kibontása

source: Fold All Lines
hu: Összes Sor Összezárása

source: Unfold All Lines
hu: Összes Sor Kibontása

source: Duplicate Selection
hu: Kijelölés Megkettőzése

source: Evaluate Selection
hu: Kijelölés Kiértékelése

source: Trim Trailing Whitespace
hu: Sorvégi Szóközök Lenyírása

source: Trim Final Newlines
hu: Utolsó Sortörések Levágása

source: Convert Indent to Spaces
hu: Behúzás átalakítása szóközökké

source: Convert Indent to Tabs
hu: Behúzás átalakítása tabokra

source: Auto Indent
hu: Automatikus Behúzás

source: Contextual Help
hu: Kontextusérzékeny Súgó

source: Toggle Bookmark
hu: Könyvjelző be- és kikapcsolása

source: Go to Next Bookmark
hu: Ugrás a következő könyvjelzőre

source: Go to Previous Bookmark
hu: Ugrás az előző könyvjelzőre

source: Remove All Bookmarks
hu: Összes könyvjelző eltávolítása

source: Go to Function...
hu: Ugrás függvényre...

source: Go to Line...
hu: Ugrás sorra...

source: Lookup Symbol
hu: Keresési Szimbólum

source: Toggle Breakpoint
hu: Töréspont Elhelyezése

source: Remove All Breakpoints
hu: Összes Töréspont Eltávolítása

source: Go to Next Breakpoint
hu: Ugrás a következő töréspontra

source: Go to Previous Breakpoint
hu: Ugrás az előző töréspontra

source: Invalid action name. It cannot be empty nor contain '/', ':', '=', '\' or '"'
hu: Érvénytelen intézkedés név. Nem lehet üres és nem tartalmazhat "/", ":"," =", "\" vagy """ jeleket

source: An action with the name '%s' already exists.
hu: '%s' nevű művelet már létezik.

source: Built-in actions are always shown when searching.
hu: A beépített műveletek mindig megjelennek a keresésben.

source: Cannot Revert - Action is same as initial
hu: Nem lehet visszavonni mert nincs változás

source: Revert Action
hu: Művelet Visszavonása

source: Add Event
hu: Esemény hozzáadása

source: Remove Action
hu: Függvény eltávolítása

source: Cannot Remove Action
hu: Esemény Nem távolítható el

source: Edit Event
hu: Esemény Szerkesztése

source: Remove Event
hu: Esemény Eltávolítása

source: Add New Action
hu: Művelet hozzáadása

source: Show Built-in Actions
hu: Beágyazott műveletek mutatása

source: Action
hu: Művelet

source: Deadzone
hu: Holtzóna

source: Must not collide with an existing engine class name.
hu: Nem ütközhet létező motor osztály nevével.

source: Must not collide with an existing global script class name.
hu: Nem ütközhet létező globális szkript osztály nevével.

source: Must not collide with an existing built-in type name.
hu: Nem ütközhet létező beépített típus nevével.

source: Must not collide with an existing global constant name.
hu: Nem ütközhet létező globális konstans nevével.

source: Autoload '%s' already exists!
hu: Már létezik '%s' AutoLoad!

source: Rename Autoload
hu: AutoLoad Átnevezése

source: Move Autoload
hu: AutoLoad Áthelyezése

source: Remove Autoload
hu: AutoLoad Eltávolítása

source: Rearrange Autoloads
hu: AutoLoad-ok Átrendezése

source: %s is an invalid path. File does not exist.
hu: %s útvonal hibás. A fájl nem létezik.

source: %s is an invalid path. Not in resource path (res://).
hu: %s egy érvénytelen elérési útvonal. Nincs az erőforrás elérési útvonalában (res://).

source: Set path or press "Add" to create a script.
hu: Adjon meg egy útvonalat, vagy használja a "Hozzáadás"-t szkript létrehozásához.

source: Node Name:
hu: Node neve:

source: Global Variable
hu: Globális Változó

source: Mobile Renderer
hu: Mobile Rendermotor

source: Godot Physics (2D)
hu: Godot Fizika (2D)

source: Godot Physics (3D)
hu: Godot Fizika (3D)

source: Text Server: Fallback
hu: Szöveg Szerver: Tartalék

source: Text Server: Advanced
hu: Szöveg Szerver: Fejlett

source: TTF, OTF, Type 1, WOFF1 Fonts
hu: TTF, OTF, Type 1, WOFF1 Betűtípusok

source: SIL Graphite Fonts
hu: SIL Graphite Betűtípusok

source: Multi-channel Signed Distance Field Font Rendering
hu: Többcsatornás Előjeles Távolságmező Betűtípus Renderelés

source: 3D Nodes as well as RenderingServer access to 3D features.
hu: 3D Node-ok és a RenderingServer hozzáférése 3D funkciókhoz.

source: Navigation Server and capabilities for 2D.
hu: Navigációs Szerver és 2D képességek.

source: Navigation Server and capabilities for 3D.
hu: Navigációs Szerver és 3D képességek.

source: XR (AR and VR).
hu: XR (AR és VR).

source: OpenXR standard implementation (requires XR to be enabled).
hu: OpenXR általános implementáció (XR bekapcsolását igényli).

source: Wayland display (Linux only).
hu: Wayland megjelenítés (csak Linux).

source: X11 display (Linux only).
hu: X11 megjelenítés (csak Linux).

source: RenderingDevice based rendering (if disabled, the OpenGL backend is required).
hu: RenderingDevice alapú renderelés (OpenGL háttérprogram kell, ha ki van kapcsolva).

source: Forward+ renderer for advanced 3D graphics.
hu: Forward+ rendermotor fejlett 3D grafikához.

source: Mobile renderer for less advanced 3D graphics.
hu: Mobile rendermotor kevésbé fejlett 3D grafikához.

source: Vulkan backend of RenderingDevice.
hu: A RenderingDevice Vulkan háttérprogramja.

source: Direct3D 12 backend of RenderingDevice.
hu: A RenderingDevice Direct3D 12 háttérprogramja.

source: Metal backend of RenderingDevice (Apple arm64 only).
hu: A RenderingDevice Metal háttérprogramja (csak Apple arm64).

source: OpenGL backend (if disabled, the RenderingDevice backend is required).
hu: OpenGL háttérprogram (RenderingDevice háttérprogramra van szükség, ha ki van kapcsolva).

source: Physics Server and capabilities for 2D.
hu: Fizika Szerver és 2D képességek.

source: Godot Physics backend (2D).
hu: Godot Fizika háttérprogram (2D).

source: Physics Server and capabilities for 3D.
hu: Fizika Szerver és 3D képességek.

source: Godot Physics backend (3D).
hu: Godot Fizika háttérprogram (3D).

source: Jolt Physics backend (3D only).
hu: Jolt Fizika háttérprogram (csak 3D).

source: Fallback implementation of Text Server Supports basic text layouts.
hu: Szöveg Szerver tartalék implementációja. Alapszintű szövegelrendezéseket támogat.

source: Text Server implementation powered by ICU and HarfBuzz libraries. Supports complex text layouts, BiDi, and contextual OpenType font features.
hu: A Szöveg Szerver implementációt az ICO és HarfBuzz könyvtárak teszik lehetővé. Támogatja a komplex szövegelrendezéseket, BiDi-t és kontextusos OpenType betűtípus funkciókat.

source: TrueType, OpenType, Type 1, and WOFF1 font format support using FreeType library (if disabled, WOFF2 support is also disabled).
hu: TrueType, OpenType, Type 1, és WOFF1 betűtípus formátumok támogatása FreeType könyvtárral (ha ki van kapcsolva, akkor a WOFF2 támogatás sem elérhető).

source: WOFF2 font format support using FreeType and Brotli libraries.
hu: WOFF2 betűtípus formátum támogatása FreeType és Brotli könyvtárakkal .

source: SIL Graphite smart font technology support (supported by Advanced Text Server only).
hu: SIL Graphite okos betűtípus technológia támogatás (csak a Fejlett Szöveg Szerver támogatja).

source: File '%s' format is invalid, import aborted.
hu: A(z) '%s' fájl formátuma érvénytelen, az importálás megszakítva.

source: Error saving profile to path: '%s'.
hu: Hiba történt a profil útvonalba mentése során: '%s'.

source: Export Profile
hu: Profil exportálása

source: Failed to execute command "%s": %s.
hu: Nem sikerült futtatni a „%s” parancsot: %s.

source: Filter by Name
hu: Szűrés név szerint

source: Clear all search filters.
hu: A keresési szűrök törlése.

source: 3D Editor
hu: 3D szerkesztő

source: Scene Tree Editing
hu: Jelenetfa szerkesztése

source: FileSystem Dock
hu: Fájlrendszer dokk

source: Import Dock
hu: Dock importálása

source: Allows to view and edit 3D scenes.
hu: Lehetővé teszi a 3D jelenetek megtekintését és szerkesztését.

source: Allows to edit scripts using the integrated script editor.
hu: Lehetővé teszi a szkriptek módosítását a beépített szkript szerkesztővel.

source: Provides built-in access to the Asset Library.
hu: Beépített hozzáférést ad a Csomagtárhoz.

source: Allows editing the node hierarchy in the Scene dock.
hu: Engedélyezi a Node hierarchia szerkesztését a Jelenet dokkban.

source: Profile must be a valid filename and must not contain '.'
hu: A profilnak érvényes fájlnévnek kell lennie, és nem tartalmazhatja a "." karaktert

source: Profile with this name already exists.
hu: Ilyen nevű profil már létezik.

source: (Editor Disabled, Properties Disabled)
hu: (A szerkesztő letiltva, a tulajdonságok letiltva)

source: (Properties Disabled)
hu: (A tulajdonságok le vannak tiltva)

source: (Editor Disabled)
hu: (A szerkesztő le van tiltva)

source: Class Options:
hu: Osztály beállítások:

source: Enable Contextual Editor
hu: Környezetfüggő szerkesztő engedélyezése

source: Profile '%s' already exists. Remove it first before importing, import aborted.
hu: A (z) '%s' profil már létezik. Importálás előtt először távolítsa el azt, importálás megszakítva.

source: Current Profile:
hu: Jelenlegi profil:

source: Available Profiles:
hu: Elérhető profilok:

source: Make Current
hu: Tegye jelenlegivé

source: New profile name:
hu: Új profilnév:

source: Godot Feature Profile
hu: Godot funkcióprofil

source: Import Profile(s)
hu: Profil(ok) importálása

source: Manage Editor Feature Profiles
hu: A szerkesztő funkcióprofiljainak kezelése

source: Editor Settings
hu: Szerkesztő Beállítások

source: General
hu: Általános

source: Shortcuts
hu: Billentyűparancsok

source: All Devices
hu: Minden eszköz

source: Device
hu: Eszköz

source: Device:
hu: Eszköz:

source: Delete Item
hu: Elem törlése

source: Add Input Action
hu: Beviteli Akció Hozzáadása

source: Input Map
hu: Beviteli Térkép

source: Localization
hu: Lokalizáció

source: Autoload
hu: Automatikus betöltés

source: Plugins
hu: Bővítmények

source: Invalid base path.
hu: Érvénytelen Alapútvonal.

source: Reload
hu: Újratöltés

source: Resave
hu: Újramentés

source: Add Input
hu: Bemenet Hozzáadása

source: Add Output
hu: Kimenet hozzáadása

source: Float
hu: valós szám

source: Add Input Port
hu: Bemeneti port hozzáadása

source: Add Output Port
hu: Kimeneti port hozzáadása

source: Remove Input Port
hu: Bemeneti port eltávolítása

source: Remove Output Port
hu: Kimeneti port eltávolítása

source: Set Input Default Port
hu: Alapértelmezett bemeneti port beállítása

source: Add Node
hu: Node hozzáadása

source: Color function.
hu: Szín függvény.

source: Color constant.
hu: Színállandó.

source: Boolean constant.
hu: Logikai állandó.

source: Input parameter.
hu: Bemeneti paraméter.

source: Vector function.
hu: Vektorfüggvény.

source: Vector operator.
hu: Vektor operátor.

source: Translations
hu: Fordítások

source: Translations:
hu: Fordítások:

source: Resources:
hu: Erőforrások:

source: File:
hu: Fájl:

source: Password
hu: Jelszó

source: SSH Public Key Path
hu: SSh Nyilvános Kulcs Útvonal

source: Select SSH public key path
hu: SSH nyilvános kulcsút kiválasztása

source: SSH Private Key Path
hu: SSH Privát Kulcs Út

source: Select SSH private key path
hu: privát SSH kulcsút kiválasztása

source: SSH Passphrase
hu: SSH jelszó

source: Detect new changes
hu: Új változások észlelése

source: Modified
hu: Módosított

source: Renamed
hu: Átnevezve

source: Deleted
hu: Törölve

source: Typechange
hu: Típusmódosítás

source: Not enough bytes for decoding bytes, or invalid format.
hu: Nincs elég bájt a bájtok dekódolására, vagy hibás formátum.

source: Incoming RPC
hu: Bejövő RPC

source: Outgoing RPC
hu: Kimenő RPC

source: Config
hu: Konfiguráció

source: Create Navigation Polygon
hu: Navigációs Sokszög Létrehozása

source: A NavigationMesh resource must be set or created for this node to work.
hu: A Node működéséhez hozzá kell rendelni vagy létre kell hozni egy NavigationMesh erőforrást.

source: Pose
hu: Póz

source: Error creating keystores directory:
hu: Hiba a kulcstárolók könyvtárának létrehozásakor

source: Invalid package name:
hu: Érvénytelen csomagnév:

source: See instructions on finding your team ID: https://developer.apple.com/help/glossary/team-id
hu: Lásd az instrukciókat csapat azonosító kód megkereséséhez: https://developer.apple.com/help/glossary/team-id

source: Run in Browser
hu: Böngészőben futtatás

source: Run exported HTML in the system's default browser.
hu: Az exportált HTML futtatása az alapértelmezett böngészőben.

source: ParallaxLayer node only works when set as child of a ParallaxBackground node.
hu: A ParallaxLayer Node csak akkor működik, ha gyermeke egy ParallaxBackground Node-nak.

source: PathFollow2D only works when set as a child of a Path2D node.
hu: A PathFollow2D Node csak akkor működik, ha gyermeke egy Path2D Node-nak.

source: An empty CollisionPolygon2D has no effect on collision.
hu: Üres CollisionPolygon2D nincs hatással az ütközésekre.

source: A shape must be provided for CollisionShape2D to function. Please create a shape resource for it!
hu: A CollisionShape2D működéséhez alakot kell hozzárendelni. Hozzon létre hozzá egy alak erőforrást!

source: Path property must point to a valid Node2D node to work.
hu: Az Útvonal tulajdonság egy érvényes Node2D Node-ra kell mutasson.

source: Creating probes
hu: Vizsgálók létrehozása

source: Animation not found: '%s'
hu: Az animáció nem található: '%s'

source: Invalid source for preview.
hu: Érvénytelen forrás az előnézethez.

source: Invalid argument name.
hu: Érvénytelen argumentum név.

source: Invalid macro argument list.
hu: Érvénytelen makró argumentum lista.

source: Invalid macro argument.
hu: Érvénytelen makró argumentum.

source: Invalid macro argument count.
hu: Érvénytelen makró argumentum mennyiség.
