Repository: zhangjiangen11/godot
Catalog: editor/translations/editor/*.po
Languages: hu

source: %s: Texture detected as used in 3D. Enabling mipmap generation and setting the texture compression mode to %s.
hu: %s: Textúra van használatban, 3D-ben. Bekapcsol a mipmap generálás és a textúratömörítési mód %s lesz.

source: 2D/3D (Auto-Detect)
hu: 2D/3D (Automatikus)

source: %s: Atlas texture significantly larger on one axis (%d), consider changing the `editor/import/atlas_max_width` Project Setting to allow a wider texture, making the result more even in size.
hu: %s: Az egyik tengelyen (%d) jelentősen nagyobb az atlasz textúra, érdemes lehet megváltoztatni az `editor/import/atlas_max_width` beállítást a Projekt Beállításokban a szélesebb textúrák támogatásához, ezzel egyenletesebbé téve az eredményt.

source: Add
hu: Hozzáadás

source: Metadata name is valid.
hu: A szkript útvonala/neve érvényes.

source: Add Metadata Property for "%s"
hu: Metaadat Tulajdonság hozzádása a "%s"-hoz

source: Metadata name can't be empty.
hu: Metaadat név nem lehet üres.

source: Metadata name must be a valid identifier.
hu: A metódusnévnek érvényes azonosítónak kell lennie.

source: Metadata with name "%s" already exists.
hu: Metaadat "%s" néven már létezik.

source: Names starting with _ are reserved for editor-only metadata.
hu: Elnevezések amik _-al kezdődnek foglaltak a szerkesztő metaadatoknak.

source: Toggling the checkbox is disabled for Resource properties. Modify the property using the resource picker instead.
hu: A jelölőnégyzet átállítása nem engedélyezett Erőforrás tulajdonságoknál. Módosítsa inkább az erőforrás választó segítségével.

source: Make this property be put back at its original place.
hu: Visszateszi a tulajdonságot az eredeti helyére.

source: Make this property be placed at the top for all objects of this class.
hu: Legfelülre teszi ezt a tulajdonságot az osztály összes objektumán.

source: Pin Value [Disabled because '%s' is editor-only]
hu: Érték Rögzítése [Kikapcsolva, "%s" csak a szerkesztőben érhető el]

source: Pinning a value forces it to be saved even if it's equal to the default.
hu: Egy érték rögzítése kényszeríti a mentést akkor is, ha az alapértelmezettel egyenlő.

source: On
hu: Be

source: (%d change)
hu: (%d változtatás)

source: Add element to property array with prefix %s.
hu: Elem tulajdonságtömbbe helyezése %s prefix-szel.

source: Remove element %d from property array with prefix %s.
hu: A(z) %d. elem törlése a tulajdonságtömbből (prefix: %s).

source: Move element %d to position %d in property array with prefix %s.
hu: A(z) %d. elem %d. helyre mozgatása a tulajdonságtömbben (prefix: %s).

source: Clear Property Array with Prefix %s
hu: Tulajdonságtömb Kiürítése (Prefix: %s)

source: Resize Property Array with Prefix %s
hu: Tulajdonságtömb Átméretezése (Prefix: %s)

source: Element %d: %s%d*
hu: %d. elem: %s%d*

source: Resize Array
hu: Tömb átméretezése

source: New Size:
hu: Új Méret:

source: Add Metadata
hu: Metaadat Hozzáadása

source: Pinned %s
hu: %s Rögzítve

source: Unpinned %s
hu: %s Feloldva

source: Add metadata %s
hu: %s metaadat Hozzáadása

source: Edit Text:
hu: Szöveg szerkesztése:

source: Accept Custom Value Edit
hu: Egyedi Érték Változtatás Elfogadása

source: Cancel Custom Value Edit
hu: Egyedi Érték Változtatás Elvetése

source: Locale
hu: Területi beállítás

source: Toggles displaying between path and UID. The UID is the actual value of this property.
hu: Az útvonal és UID megjelenítése között vált. A(z) UID a tulajdonság valódi értéke.

source: Bit %d, value %d
hu: %d bit, érték: %d

# Ease Type
source: Zero
hu: Nulla

source: Temporary Euler may be changed implicitly!
hu: Az ideiglenes Euler implicit módon változhat!

source: Temporary Euler will not be stored in the object with the original value. Instead, it will be stored as Quaternion with irreversible conversion. This is due to the fact that the result of Euler->Quaternion can be determined uniquely, but the result of Quaternion->Euler can be multi-existent.
hu: Az ideiglenes Euler értéke nem tárolódik az objektumon az eredeti értékével, hanem kvaternióként egyutas konverzióval mentjük. Ennek oka, hogy az Euler->Kvaternió konverzió egyértelműen meghatározható, a Kvaternió->Euler viszont többértelmű.

source: Temporary Euler
hu: Ideiglenes Euler

source: Temporary Euler %s
hu: Ideiglenes Euler %s

source: Assign...
hu: Hozzárendelés...

source: Show Node in Tree
hu: Node Mutatása a Fában

source: Invalid RID
hu: Érvénytelen RID

source: Recursion detected, unable to assign resource to property.
hu: Rekurzió érzékelve, az erőforrást nem lehet a tulajdonsághoz rendelni.

source: Can't create a ViewportTexture in a Texture2D node because the texture will not be bound to a scene. Use a Texture2DParameter node instead and set the texture in the "Shader Parameters" tab.
hu: Texture2D node-ban nem lehet ViewportTexture-t létrehozni, mert a textúra így nem társul a jelenethez. Használjon helyette a Texture2DParameter node-ot és állítsa be a textúrát a "Shader Paraméterek" lapon.

source: Can't create a ViewportTexture on resources saved as a file. Resource needs to belong to a scene.
hu: Fájlként mentett erőforrásokon nem lehet ViewportTexture-t létrehozni. Az erőforrás jelenethez kell tartozzon.

source: Can't create a ViewportTexture on this resource because it's not set as local to scene. Please switch on the 'local to scene' property on it (and all resources containing it up to a node).
hu: Ezen az erőforráson nem lehet ViewportTexture-t létrehozni, mert nem lokális a jelenthez képest. Állítsa át a "lokális a jeleneten" tulajdonságot (és minden öröklő erőforrásét az első node-ig).

source: Pick a Viewport
hu: Válasszon Nézetablakot

source: Selected node is not a Viewport!
hu: A kiválasztott node nem Betekintő!

source: New Key:
hu: Új kulcs:

source: New Value:
hu: Új érték:

source: Reorder
hu: Átrendezés

source: %s%s (size %d)
hu: %s%s (méret %d)

source: %s (size %d)
hu: %s (méret %d)

source: Size:
hu: Méret:

source: Size
hu: Méret

source: Add Key/Value Pair
hu: Kulcs/érték pár hozzáadása

source: Remove Translation
hu: Fordítás eltávolítása

source: Lock/Unlock Component Ratio
hu: Lezárja/Feloldja a Komponens Arányt

source: This %s is external to scene.
hu: Ez a(z) %s nem a jelenet része.

source: The %s cannot be edited in the inspector and can't be made unique directly.
hu: A(z) %s nem módosítható az elemzőben és nem tehető egyedivé közvetlenül.

source: Left-click to make it unique.
hu: Bal klikk az egyedivé tételhez.

source: It is possible to make its subresources unique.
hu: Az alerőforrásait egyedivé lehet tenni.

source: Right-click to make them unique.
hu: Jobb klikk az egyedivé tételhez.

source: In order to duplicate it, make its parent Resource unique.
hu: Duplikációhoz tegye a szülő erőforrást egyedivé.

source: The selected resource (%s) does not match any type expected for this property (%s).
hu: A kiválasztott erőforrás (%s) nem egyezik a tulajdonság (%s) által várt egyik típussal sem.

source: Opens a quick menu to select from a list of allowed Resource files.
hu: Gyorselérésű menüt nyit az engedélyezett Erőforrás fájlok kiválasztásához.

source: Hold %s while drag-and-dropping from the FileSystem dock or another resource picker to automatically make a dropped resource unique.
hu: %s nyomvatartásával a Fájlrendszer dokkról vagy erőforrásválasztóról történő húzd-és-vidd mozdulat közben automatikusan egyedivé teszi az elejtett erőforrást.

source: This Resource is already unique.
hu: Ez az Erőforrás már egyedi.

source: In order to duplicate recursively, make its parent Resource unique.
hu: Rekurzív duplikációhoz tegye a szülő Erőforrást egyedivé.

source: Subresources have already been made unique.
hu: Az alerőforrások már egyediek.

source: New
hu: Új

source: Size: %s
hu: Méret:'%s'

source: Dimensions: %d × %d
hu: Dimenziók: %d × %d

source: Length: %0dm %0ds
hu: Hossz: %0dp %0dmp

source: Length: %0.1fs
hu: Hossz: %0.1fmp

source: Length: %0.3fs
hu: Hossz: %0.3fmp

source: Advanced settings are always shown when searching.
hu: A Speciális beállítások mindig megjelennek kereséskor.

source: Set %s on %d nodes
hu: %s beállítása %d node-on

source: Select Property
hu: Tulajdonság Kiválasztása

source: Select Virtual Method
hu: Virtuális metódus kiválasztása

source: Select Method
hu: Metódus kiválasztása

source: The assigned tool button callback can't be used with multiple nodes.
hu: A hozzárendelt eszköz visszahívása (callback) nem használható több node-dal.

source: Name: %s Path: %s Main Script: %s %s
hu: Név: %s Útvonal: %s Fő Szkript: %s %s

source: Edit Plugin
hu: Bővítmény szerkesztése

source: Recovery mode is enabled. Enabled plugins will not run while this mode is active.
hu: Visszaállítási Mód engedélyezve. Az engedélyezett beépülő modulok nem futnak, amíg ez aktív.

source: Installed Plugins:
hu: Telepített Bővítmények:

source: Plugin name cannot be blank.
hu: A beépülő modul neve nem lehet üres.

source: Script extension must match chosen language extension (.%s).
hu: A szkript kiterjesztése meg kell egyezzen a programnyelv kiterjesztésével (.%s).

source: Consider enabling GDScript warnings for this plugin by adding an entry for it to the project setting Debug > GDScript > Warnings > Directory Rules.
hu: Engedélyezhet GDScript figyelmeztetéseket ehhez a beépülő modulhoz a projekt beállításokban egy új bejegyzés segítségével a Hibakeresés > GDScript > Figyelmeztetések > Könyvtár Szabályok menüpontban.

source: Edit a Plugin
hu: Bővítmény szerkesztése

source: Create a Plugin
hu: Bővítmény létrehozása

source: Plugin Name:
hu: Bővítmény neve:

source: Required. This name will be displayed in the list of plugins.
hu: Szükséges. Ez a név jelenik meg a beépülő modul listában.

source: Subfolder:
hu: Almappa:

source: Optional. The folder name should generally use `snake_case` naming (avoid spaces and special characters). If left empty, the folder will be named after the plugin name converted to `snake_case`.
hu: Opcionális. A könyvtár neve jellemzően a `snake_case`elnevezést követi (kerülve a szóközt és a különleges karaktereket). Üresen hagyva a könyvtár neve a beépülő modul `snake_case` formátumú nevét veszi fel.

source: Optional. This description should be kept relatively short (up to 5 lines). It will display when hovering the plugin in the list of plugins.
hu: Opcionális. A leírást érdemes rövidre fogni (legfeljebb 5 sor). Az egér föléhúzásakor jelenik meg a beépülő modulok listájában.

source: Author:
hu: Szerző:

source: Optional. The author's username, full name, or organization name.
hu: Opcionális. A szerző felhasználóneve, teljes neve vagy szervezete.

source: Optional. A human-readable version identifier used for informational purposes only.
hu: Opcionális. Ember által értelmezhető verzió azonosító kizárólag információs jelleggel.

source: Language:
hu: Nyelv:

source: Required. The scripting language to use for the script. Note that a plugin may use several languages at once by adding more scripts to the plugin.
hu: Szükséges. A szkripthez használt programnyelv. A beépülő modulok több programnyelvet is használhatnak több szkriptfájl hozzáadásával.

source: Script Name:
hu: Szkript neve:

source: Optional. The name of the script file. If left empty, will default to the subfolder name.
hu: Opcionális. A szkriptfájl neve. Üresen hagyva az almappa nevét veszi fel.

source: Failed to check for updates. Error: %d.
hu: Sikertelen frissítés ellenőrzés. Hibakód: %d.

source: Failed to check for updates. Response code: %d.
hu: Sikertelen frissítés ellenőrzés. Válaszkód: %d.

source: Received JSON data is not a valid version array.
hu: A kapott JSON adat érvénytelen verziótömb.

source: Offline mode, update checks disabled.
hu: Offline mód, frissítések ellenőrzése kikapcsolva.

source: An error has occurred. Click to try again.
hu: Hiba történt. Újrapróbálás kattintásra.

source: Click to open download page.
hu: Kattintással megnyílik a letöltések oldal.

source: It would be a good idea to name your project.
hu: Jó ötlet lenne elnevezni a projektet.

source: Invalid ".zip" project file; it doesn't contain a "project.godot" file.
hu: Érvénytelen ".zip" projekt fájl; nincs benne "project.godot" fájl.

source: Please choose a "project.godot", a directory with one, or a ".zip" file.
hu: Válasszon egy "project.godot" fájlt, egy ilyet tartalmazó mappát vagy egy ".zip" fájlt.

source: Creating a project at the engine's working directory or executable directory is not allowed, as it would prevent the project manager from starting.
hu: A motor saját vagy futtatási mappájában nem lehet projektet létrehozni, mert akadályozná a projekt menedzser elindulását.

source: You cannot save a project at the selected path. Please create a subfolder or choose a new path.
hu: A projekt nem menthető a kiválasztott útvonalon. Hozzon létre egy almappát vagy válasszon másik útvonalat.

source: The project folder will be automatically created.
hu: A projektmappa automatikusan létrejön.

source: The path specified doesn't exist.
hu: A megadott útvonal nem létezik.

source: The project folder exists and is empty.
hu: A projektmappa már létezik és üres.

source: The selected path is not empty. Choosing an empty folder is highly recommended.
hu: A kiválasztott útvonal nem üres. Erősen javasolt egy üres mappa kiválasztása.

source: New Game Project
hu: Új játék projekt

source: Supports desktop platforms only.
hu: Csak az asztali platformokat támogatja.

source: Advanced 3D graphics available.
hu: Fejlett 3D grafika érhető el.

source: Can scale to large complex scenes.
hu: Nagy komplex jelenetekhez is alkalmas.

source: Uses RenderingDevice backend.
hu: A RenderingDevice háttérprogramot használja.

source: Slower rendering of simple scenes.
hu: Egyszerű jelenetek lassabb renderelése.

source: Supports desktop + mobile platforms.
hu: Asztali és hordozható platformokat is támogat.

source: Less advanced 3D graphics.
hu: Kevésbé fejlett 3D grafika.

source: Less scalable for complex scenes.
hu: Kevésbé használható komplex jelenetekhez.

source: Fast rendering of simple scenes.
hu: Egyszerű jelenetek gyors renderelése.

source: Supports desktop, mobile + web platforms.
hu: Asztali, hordozható + web platformokat támogat.

source: Least advanced 3D graphics.
hu: Legkevésbé fejlett 3D grafika.

source: Intended for low-end/older devices.
hu: Belépőszintű/régi eszközökhöz szánt.

source: Uses OpenGL 3 backend (OpenGL 3.3/ES 3.0/WebGL2).
hu: OpenGL 3 háttérprogramot használ (OpenGL 3.3/ES 3.0/WebGL2).

source: Fastest rendering of simple scenes.
hu: Egyszerű jelenetek leggyorsabb renderelése.

source: Warning: This folder is not empty
hu: Figyelmeztetés: Ez a mappa nem üres

source: You are about to create a Godot project in a non-empty folder. The entire contents of this folder will be imported as project resources! Are you sure you wish to continue?
hu: Olyan mappába készül Godot projektet létrehozni, amely nem üres. A mappa teljes tartalmát projekt erőforrásokként importáljuk! Biztosan folytatni szeretné?

source: Couldn't create project.godot in project path.
hu: A project.godot létrehozása a projekt útvonalán sikertelen.

source: Error opening package file, not in ZIP format.
hu: Hiba a csomagfájl megnyitása során, nem ZIP formátumú.

source: The following files failed extraction from package:
hu: A következő fájlokat nem sikerült kibontani a csomagból:

source: Couldn't load project at '%s' (error %d). It may be missing or corrupted.
hu: A projekt betöltése "%s" útvonalon sikertelen (hibakód %d). Hiányzik egy része vagy hibás.

source: Rename Project
hu: Projekt átnevezése

source: Import Existing Project
hu: Meglévő Projekt Importálása

source: Create New Project
hu: Új Projekt Létrehozása

source: Install Project:
hu: Projekt telepítése:

source: Project Name:
hu: Projekt neve:

source: Project Path:
hu: Projekt Elérési Útja:

source: Project Installation Path:
hu: Projekt Telepítés Útvonal:

source: Renderer:
hu: Rendermotor:

source: RenderingDevice-based methods not available on this GPU: %s Please use the Compatibility renderer.
hu: A RenderingDevice alapú metódusok nem elérhetőek ezen a GPU-n: %s Kérjük használja a Compatibility rendermotort.

source: The renderer can be changed later, but scenes may need to be adjusted.
hu: A rendermotor később megváltoztatható, de a jeleneteket esetleg módosítani kell majd.

source: This project was last edited in a different Godot version:
hu: Ezt a projektet utoljára más Godot verzióval módosították:

source: This project uses features unsupported by the current build:
hu: Ez a projekt olyan funkciókat használ, melyek nem elérhetőek a jelen változatban:

source: Error: Project is missing on the filesystem.
hu: Hiba: A projekt nem található a fájlrendszerben.

source: Toggle Favorite
hu: Kedvencek Mutatása/Elrejtése

source: Scanning for projects...
hu: Projektek beolvasása...

source: Missing Project
hu: Hiányzó projekt

source: Manage Tags
hu: Címkék kezelése

source: New Window
hu: Új ablak

source: Get started by creating a new one, importing one that exists, or by downloading a project template from the Asset Library!
hu: Kezdésként hozz létre egy új projektet, importálj egy meglévőt, vagy tölts le egy sablont a csomagtárból!

source: Are you sure to run %d projects at once?
hu: Biztosan szeretne egyszerre %d projektet futtatni?

source: Can't run project: Assets need to be imported first. Please edit the project to trigger the initial import.
hu: A projekt nem futtatható: Csomagokat kell importálni. Módosítsa a projektet a kezdeti importáláshoz.

source: Can't open project at '%s'. Project file doesn't exist or is inaccessible.
hu: A prjekt nem nyitható meg a(z) "%s" útvonalon. A projektfájl nem létezik vagy nem hozzáférhető.

source: You requested to open %d projects in parallel. Do you confirm? Note that usual checks for engine version compatibility will be bypassed.
hu: %d projekt párhozamos megnyitását kérte. Biztos benne? A szokásos motor verzió kompatibilitás ellenőrzések nem történnek meg.

source: The selected project "%s" does not specify its supported Godot version in its configuration file ("project.godot"). Project path: %s If you proceed with opening it, it will be converted to Godot's current configuration file format. Warning: You won't be able to open the project with previous versions of the engine anymore.
hu: A kiválasztott projekt "%s" nem határozza meg a támogatott Godot verziót a konfigurációs fájlban ("project.godot"). Projekt útvonal: %s Ha megnyitja, akkor a jelenlegi Godot konfigurációs fájl formátumára konvertálódik. Figyelmeztetés: Korábbi motorverziókkal ezután nem fogja tudni megnyitni a projektet.

source: The selected project "%s" was generated by Godot 3.x, and needs to be converted for Godot 4.x. Project path: %s You have three options: - Convert only the configuration file ("project.godot"). Use this to open the project without attempting to convert its scenes, resources and scripts. - Convert the entire project including its scenes, resources and scripts (recommended if you are upgrading). - Do nothing and go back. Warning: If you select a conversion option, you won't be able to open the project with previous versions of the engine anymore.
hu: A kiválasztott projekt "%s" Godot 3.x verzióval generálódott és át kell konvertálni Godot 4.x verzióra. Projekt útvonal: %s Három opció közül választhat: - Csak a konfigurációs fájl konvertálása ("project.godot"). használja ezt a projekt megnyitásához a jelenetek, erőforrások és szkriptek konvertálása nélkül. - Teljes projekt konvertálása, beleértve a jeleneteket, erőforrásokat és szkripteket (javasolt, ha frissít). - Kihagyás és visszatérés. Figyelmeztetés: Ha konverziós opciót választ, akkor korábbi motorverziókkal ezután nem fogja tudni megnyitni a projektet.

source: Convert project.godot Only
hu: Csak a project.godot Konvertálása

source: The selected project "%s" was generated by an older engine version, and needs to be converted for this version. Project path: %s Do you want to convert it? Warning: You won't be able to open the project with previous versions of the engine anymore.
hu: A kiválasztott projekt "%s" régebbi motorverzióval generálódott és konvertálni kell a jelenlegi verzióra. Projekt útvonal: %s Szeretné konvertálni? Figyelmeztetés: Korábbi motorverziókkal ezután nem fogja tudni megnyitni a projektet.

source: Convert project.godot
hu: project.godot Konvertálása

source: Can't open project "%s" at the following path: %s The project settings were created by a newer engine version, whose settings are not compatible with this version.
hu: A(z) "%s" útvonalon lévő projektet nem lehet megnyitni: %s A projekt beállításokat újabb motorverzióval hozták létre, amely beállításai nem kompatibilisek ezzel a verzióval.

source: Warning: This project uses double precision floats, but this version of Godot uses single precision floats. Opening this project may cause data loss.
hu: Figyelmeztetés: A projekt dupla pontosságú lebegőpontos számokat használ, de ez a Godot verzió egyszeres pontosságúval dolgozik. A projekt megnyitása adatvesztéssel járhat.

source: Warning: This project uses C#, but this build of Godot does not have the Mono module. If you proceed you will not be able to use any C# scripts.
hu: Figyelmeztetés: Ez a projekt C#ot használ, de a Godot jelen változata nem rendelkezik a Mono modullal. Megnyitás esetén nem fog tudni C# szkripteket használni.

source: Warning: This project was last edited in Godot %s. Opening will change it to Godot %s.
hu: Figyelmeztetés: Ezt a projektet utoljára Godot %s segítségével módosították. Megnyitás esetén módosíulni fog Godot %s verzióra.

source: Warning: This project uses the following features not supported by this build of Godot: %s
hu: Figyelmeztetés: Ez a projekt a Godot jelen változata által nem támogatott funkciókat használ: %s

source: Open anyway? Project will be modified.
hu: Így is megnyitja? A projekt módosulni fog.

source: Remove all missing projects from the list? The project folders' contents won't be modified.
hu: Töröljük a lista összes hiányzó projektjét? A projektmappák tartalma nem változik.

source: It looks like Godot crashed when opening this project the last time. If you're having problems editing this project, you can try to open it in Recovery Mode.
hu: A projekt legutóbbi megnyitásakor a Godot szoftver összeomlott. Ha a projekt módosításával problémák vannak, akkor megpróbálhajta Visszaállítási Módban megnyitni.

source: Recovery Mode is a special mode that may help to recover projects that crash the engine during initialization. This mode temporarily disables the following features:
hu: A Visszaállítási Mód egy speciális mód, ami segíthet visszaállítani a motor összeomlását okozó projekteket. Ez a mód ideiglenesen kikapcsolja az alábbi funkciókat:

source: GDExtension addons
hu: GDExtension bővítmények

source: Automatic scene restoring
hu: Automatikus jelenet visszaállítás

source: This mode is intended only for basic editing to troubleshoot such issues, and therefore it will not be possible to run the project during this mode. It is also a good idea to make a backup of your project before proceeding.
hu: Ez a mód egyszerű módosításokkal történő hibafelderítéshez való, ezért a projekt futtatására ebben a módban nincs lehetőség. Továbbá jó ötlet lehet a projekt biztonsági mentése, mielőtt belekezd a folyamatba.

source: Edit the project in Recovery Mode?
hu: Projekt Módosítása Visszaállítási Módban?

source: These characters are not allowed in tags: %s.
hu: Ezek a karakterek nem szerepelhetnek címkékben: %s.

source: Projects
hu: Projektek

source: New Project
hu: Új projekt

source: Scan
hu: Keresés

source: Scan Projects
hu: Projektek beolvasása

source: Loading, please wait...
hu: Betöltés, kérem várjon...

source: Filter Projects
hu: Projektek szűrése
