Repository: zhangjiangen11/godot
Catalog: editor/translations/editor/*.po
Languages: hu

source: The edited TileMap or TileMapLayer node has no TileSet resource. Create or load a TileSet resource in the Tile Set property in the inspector.
hu: A módosított TileMap vagy TileMapLayer node-nak nincs TileSet erőforrása. Hozzon létre vagy töltsön be egy TileSet erőforrást az elemző Tile Set tulajdonságánál.

source: Select Previous Tile Map Layer
hu: Előző Tile Map Réteg Kiválasztása

source: Highlight Selected TileMap Layer
hu: Kiválasztott TileMap Réteg Kiemelése

source: Automatically Replace Tiles with Proxies
hu: Csempék Automatikus Cseréje Proxy-kra

source: Create Alternative-level Tile Proxy
hu: Alternatív-szintű Csempe Proxy Létrehozása

source: Create Coords-level Tile Proxy
hu: Koordináta-szintű Csempe Proxy Létrehozása

source: Create source-level Tile Proxy
hu: Forrás-szintű Csempe Proxy Létrehozása

source: Delete All Invalid Tile Proxies
hu: Összes Érvénytelen Proxy Törlése

source: Tile Proxies Management
hu: Csempe Proxy Menedzsment

source: Source-level proxies
hu: Forrás-szintű proxy-k

source: Coords-level proxies
hu: Koordináta-szintű proxy-k

source: Alternative-level proxies
hu: Alternatív-szintű proxy-k

source: Add a new tile proxy:
hu: Új csempe proxy hozzáadása:

source: Atlas
hu: Atlasz

source: Selected tile: Source: %d Atlas coordinates: %s Alternative: %d
hu: Kiválasztott csempe: Forrás: %d Atlasz koordináták: %s Alternatíva: %d

source: Texture Origin
hu: Textúra Eredet

source: Probability
hu: Valószínűség

source: Create and customize physics layers in the inspector of the TileSet resource.
hu: Fizika rétegek létrehozása és testreszabása az elemző TileSet erőforrásával lehetséges.

source: Navigation
hu: Navigáció

source: Create and customize navigation layers in the inspector of the TileSet resource.
hu: Navigációs rétegek létrehozása és testreszabása az elemző TileSet erőforrásával lehetséges.

source: Create and customize custom data layers in the inspector of the TileSet resource.
hu: Egyedi adatrétegek létrehozása és testreszabása az elemző TileSet erőforrásával lehetséges.

source: TileSet is in read-only mode. Make the resource unique to edit TileSet properties.
hu: A TileSet csak-olvasható módban van. Tegye egyedivé az erőforrást a TileSet tulajdonáságainak módosításához.

source: Remove Tiles Outside the Texture
hu: Textúrán Kívüli Csempék Eltávolítása

source: Create tiles in non-transparent texture regions
hu: Csempék létrehozása átlátszatlan textúra régiókban

source: Remove tiles in fully transparent texture regions
hu: Teljesen átlátszó régiók csempéinek eltávolítása

source: The tile's unique identifier within this TileSet. Each tile stores its source ID, so changing one may make tiles invalid.
hu: A csempe TileSet-en belüli egyedi azonosítója. Minden csempe eltárolja a forrás azonosítót, ezért annak módosítása érvénytelenné teheti a csempéket.

source: The human-readable name for the atlas. Use a descriptive name here for organizational purposes (such as "terrain", "decoration", etc.).
hu: Ember által értelmezhető atlasznév. Könnyen érthető nevet használjon szervezettségi okokból (például "terep", "dekoráció", stb.).

source: The image from which the tiles will be created.
hu: A kép, amiből a csempék létrejönnek.

source: The margins on the image's edges that should not be selectable as tiles (in pixels). Increasing this can be useful if you download a tilesheet image that has margins on the edges (e.g. for attribution).
hu: A margók a kép szélén, amelyek nem választhatók ki csempeként (pixelben). Ennek növelése hasznos lehet, ha olyan csempelapot tölt le, aminek margó van a szélén (pl. tulajdonjog miatt).

source: The separation between each tile on the atlas in pixels. Increasing this can be useful if the tilesheet image you're using contains guides (such as outlines between every tile).
hu: Az atlasz csempéi közötti elválasztás pixelszáma. Ennek növelése hasznos lehet, ha a használt csempelap elválasztókat tartalmaz (például körvonalak a csempék körül).

source: The size of each tile on the atlas in pixels. In most cases, this should match the tile size defined in the TileMap property (although this is not strictly necessary).
hu: Az atlasz csempéinek mérete pixelben. A legtöbb esetben ez meg kell egyezzen a TileMap tulajdonságban meghatározott mérettel (bár nem szigorúan kötelező).

source: If checked, adds a 1-pixel transparent edge around each tile to prevent texture bleeding when filtering is enabled. It's recommended to leave this enabled unless you're running into rendering issues due to texture padding.
hu: Bekapcsolva, hozzáad 1-pixeles átlátszó körvonalat a csempék körül, ezzel megelőzve a textúra átfolyást szűrés alkalmazása mellett. Javasolt bekapcsolva hagyni, kivéve, ha renderelési problémák merülnek fel a textúra padding miatt.

source: The position of the tile's top-left corner in the atlas. The position and size must be within the atlas and can't overlap another tile. Each painted tile has associated atlas coords, so changing this property may cause your TileMaps to not display properly.
hu: A csempe bal-felső sarkának pozíciója az atlaszban. A pozíció és méret az atlaszon belül kell legyen és nem fedhet át más csempéket. Minden megfestett csempének hozzárendelt atlasz koordinátája van, ezért ezen tulajdonság megváltoztatása a TileMap-ek megjelenítésében hibákat okozhat.

source: The unit size of the tile.
hu: A csempe egységmérete.

source: Number of columns for the animation grid. If number of columns is lower than number of frames, the animation will automatically adjust row count.
hu: Oszlopok száma az animáció rácson. Ha a képkockák számánál kevesebb, akkor az animáció automatikusan hozzáigazítja a sorok számát.

source: The space (in tiles) between each frame of the animation.
hu: Hely (csempék száma) az animáció képkockái között.

source: Determines how animation will start. In "Default" mode all tiles start animating at the same frame. In "Random Start Times" mode, each tile starts animation with a random offset.
hu: Meghatározza az animáció kezdetét. "Alapértelmezett" módban minden csempe animációja ugyanazon képkockánál kezdődik. A "Véletlenszerű Kezdési Idő" módban véletlenszerű eltolással kezdődnek a csempe animációk.

source: If [code]true[/code], the tile is horizontally flipped.
hu: Ha [code]true[/code], akkor a csempe horizontálisan tükrözött.

source: If [code]true[/code], the tile is vertically flipped.
hu: Ha [code]true[/code], akkor a csempe vertikálisan tükrözött.

source: If [code]true[/code], the tile is rotated 90 degrees [i]counter-clockwise[/i] and then flipped vertically. In practice, this means that to rotate a tile by 90 degrees clockwise without flipping it, you should enable [b]Flip H[/b] and [b]Transpose[/b]. To rotate a tile by 180 degrees clockwise, enable [b]Flip H[/b] and [b]Flip V[/b]. To rotate a tile by 270 degrees clockwise, enable [b]Flip V[/b] and [b]Transpose[/b].
hu: Ha [code]true[/code], a csempe 90 fokkal el van forgatva [i]az óramutató járásával ellentétesen[/i] és utána vertikálisan tükrözött. A gyakorlatban ez azt jelenti, hogy ha a csempét 90 fokkal az óramutató járásával megyegyő irányba szeretné forgatni tükrözés nélkül, akkor a [b]Tökrözés H[/b] és [b]Transzponálás[/b] opciókat kell használnia. 180 fokkal forgatásához b]Tükrözés H[/b] és [b]Tükrözés V[/b] használható. 270 fokkal az óramutató járásával megyező irányba forgatáshoz [b]Tükrözés V[/b] és [b]Transzponálás[/b] használható.

source: The origin to use for drawing the tile. This can be used to visually offset the tile compared to the base tile.
hu: A csempe rajzolásához használandó eredet. Az alapcsempéhez képesti vizuális eltoláshoz használható.

source: The color multiplier to use when rendering the tile.
hu: A csempe rendereléséhez használandó szín szorzó.

source: The material to use for this tile. This can be used to apply a different blend mode or custom shaders to a single tile.
hu: A csempéhez használt anyag. Másfajta keverési módhoz vagy egyetlen csempe egyedi shader-rel történő használatához való.

source: The sorting order for this tile. Higher values will make the tile render in front of others on the same layer. The index is relative to the TileMap's own Z index.
hu: Rendezési sorrend a csempéhez. Magasabb értékekkel ugyanazon rétegen lévő csempékhez képest előrébb kerül a rendereléskor. Az index a TileMap saját Z indexéhez képest relatív.

source: The vertical offset to use for tile sorting based on its Y coordinate (in pixels). This allows using layers as if they were on different height for top-down games. Adjusting this can help alleviate issues with sorting certain tiles. Only effective if Y Sort Enabled is true on the TileMap layer the tile is placed on.
hu: A csempe Y koordinátája alapján meghatározott sorrendiségéhez használt vertikális eltolás (pixelben). Ezzel a rétegek úgy használhatóak felülnézetes játékokhoz, mintha különböző magasságokban lennének. Bizonyos csempesorrend problémákhoz való. Csak "Y Rendezés Bekapcsolás" esetén működik azon a TileMap-en, amire rá van helyezve.

source: The index of the terrain set this tile belongs to. [code]-1[/code] means it will not be used in terrains.
hu: A hozzá tartozó terepkészlet indexe. [code]-1[/code] esetén a terepekhez nem lesz használatban.

source: The index of the terrain inside the terrain set this tile belongs to. [code]-1[/code] means it will not be used in terrains.
hu: A terep indexe a terepkészletben, amihez a csempe tartozik. [code]-1[/code] esetén a terepekhez nem lesz használatban.

source: The relative probability of this tile appearing when painting with "Place Random Tile" enabled.
hu: Ezen csempe relatív megjelenési esélye "Véletlenszerű Csempe Elhelyezés" segítségével történő festés során.

source: Setup
hu: Beállítás

source: Atlas setup. Add/Remove tiles tool (use the shift key to create big tiles, control for rectangle editing).
hu: Atlasz beállítás. Hozzáadás/Eltávolítás eszköz (shift billentyűvel nagy csempéket, control billentyűvel téglalap módosítást használhat).

source: Paint
hu: Festés

source: No tiles selected. Select one or more tiles from the palette to edit its properties.
hu: Nincs kijelölt csempe. Jelöljön ki egy vagy több csempét a palettáról a tulajdonságainak módosításához.

source: Create Tiles in Non-Transparent Texture Regions
hu: Csempék Létrehozása Átlátszatlan Textúra Régiókban

source: Remove Tiles in Fully Transparent Texture Regions
hu: Csempék Eltávolítása Teljesen Átlátszó Textúra Régiókban

source: The current atlas source has tiles outside the texture. You can clear it using "%s" option in the 3 dots menu.
hu: A jelenlegi atlasz forrásnak a textúrán kívül is vannak csempéi. Eltávolíthatja őket a "%s" opcióval a három pöttyös menüben.

source: Auto Create Tiles in Non-Transparent Texture Regions?
hu: Automatikus Csempelétrehozás Átlátszatlan Textúra Régiókban?

source: The atlas's texture was modified. Would you like to automatically create tiles in the atlas?
hu: Az atlasz textúra módosult. Szeretne automatikusan csempéket létrehozni az atlaszban?

source: Yes
hu: Igen

source: A palette of tiles made from a texture.
hu: Textúrából létrejött csempepaletta.

source: A collection of scenes that can be instantiated and placed as tiles.
hu: Jelenetcsoport, amely példányosítható és csempeként elhelyezhető.

source: Open Atlas Merging Tool
hu: Atlasz Egyesítés Eszköz Megnyitása

source: No TileSet source selected. Select or create a TileSet source. You can create a new source by using the Add button on the left or by dropping a tileset texture onto the source list.
hu: Nincs kijelölt TileSet forrás. Válasszon ki vagy hozzon létre egy TileSet forrást. Új forrás létrehozásához használja a Hozzáadás gombot a bal oldalon vagy dobjon egy tileset textúrát a forráslistára.

source: Add new patterns in the TileMap editing mode.
hu: Új minták hozzáadása a TileMap módosítás módban.

source: Warning: Modifying a source ID will result in all TileMaps using that source to reference an invalid source instead. This may result in unexpected data loss. Change this ID carefully.
hu: Figyelmeztetés: A forrás ID módosítása minden ezen forrást használó TileMap forrásreferenciáját érvényteleníti. Ez váratlan adatvesztéshez vezethet. Legyen óvatos az ID változtatásánál.

source: Drag and drop scenes here or use the Add button.
hu: Húzzon ide jeleneteket vagy használja a Hozzáadás gombot.

source: The human-readable name for the scene collection. Use a descriptive name here for organizational purposes (such as "obstacles", "decoration", etc.).
hu: Ember által értelmezhető jelentcsoportnév. Könnyen érthető nevet használjon szervezettségi okokból (például "akadályok", "dekoráció", stb.).

source: ID of the scene tile in the collection. Each painted tile has associated ID, so changing this property may cause your TileMaps to not display properly.
hu: A jelenetcsempe azonosítója a csoporton belül. Minden megfestett csempének van azonosítója, ezért ezen tulajdonság megváltoztatása a TileMap-ek megjelenítésében hibákat okozhat.

source: Absolute path to the scene associated with this tile.
hu: A csempéhez rendelt jelenet abszolút útvonala.

source: If [code]true[/code], a placeholder marker will be displayed on top of the scene's preview. The marker is displayed anyway if the scene has no valid preview.
hu: Ha [code]true[/code], akkor egy placeholder jelző jelenik meg a jelenet előnézete felett. A jelző akkor is megjelenik, ha a jelenetnek nincs érvényes előnézete.

source: Eraser Tool
hu: Radír Eszköz

source: Source ID: %d Texture path: %s
hu: Forrás ID: %d Textúra útvonal: %s

source: Bone Picker:
hu: Csont Pipetta:

source: Clear mappings in current group.
hu: A csoport hozzárendeléseinek kiürítése.

source: Preview
hu: Előnézet

source: Change AudioStreamPlayer3D Emission Angle
hu: AudioStreamPlayer3D Kibocsátási Szögének Változtatása

source: Change Camera FOV
hu: Kamera látószög változtatás

source: Change Camera Size
hu: Kamera méret változtatás

source: Change Light Radius
hu: Fény Sugarának Változtatása

source: Change Sphere Shape Radius
hu: Gömb Alak Sugár Változtatása

source: Change Capsule Shape Radius
hu: Kapszula Alak Sugár Változtatása

source: Change Capsule Shape Height
hu: Kapszula Alak Magasság Változtatása

source: Change Cylinder Shape Radius
hu: Cilinder Alak Sugár Változtatása

source: Change Cylinder Shape Height
hu: Cilinder Alak Magasság Változtatása

source: Remove SoftBody3D pinned point %d
hu: SoftBody3D rögzített pont %d törlése

source: Add SoftBody3D pinned point %d
hu: SoftBody3D rögzített pont %d hozzáadása

source: Change Notifier AABB
hu: AABB Értesítő Változtatása

source: Subdivisions: %s
hu: Felosztások: %s

source: Cell size: %s
hu: Cellaméret: %s

source: Video RAM size: %s MB (%s)
hu: Videó RAM méret: %s MB (%s)

source: Bake SDF
hu: SDF égetése

source: No faces detected during GPUParticlesCollisionSDF3D bake. Check whether there are visible meshes matching the bake mask within its extents.
hu: Nem található oldallap a GPUParticlesCollisionSDF3D égetés során. Ellenőrizze, hogy vannak-e látható mesh-ek az égetőmaszkhoz rendelve annak befoglaló területén belül.

source: Select path for SDF Texture
hu: Válasszon útvonalat az SDF textúrához

source: No meshes with lightmapping support to bake. Make sure they contain UV2 data and their Global Illumination property is set to Static.
hu: Nincsenek lighmap-et támogató mesh-ek az égetéshez. Ellenőrizze, hogy van UV2 adatuk és hogy a Globális Megvilágítás tulajdonság Statikus.

source: To import a scene with lightmapping support, set Meshes > Light Baking to Static Lightmaps in the Import dock.
hu: Lightmapping támogatással történő jelenetimportáláshoz állítsa a Mesh-ek > Fények égetése opciót Statikus Lightmap-ekre az import dokkon.

source: To enable lightmapping support on a primitive mesh, edit the PrimitiveMesh resource in the inspector and check Add UV2.
hu: A lightmap támogatás engedélyezhető a primitív mesh-ekhez az elemzőbeli PrimitiveMesh erőforrásnál az UV2 Hozzáadása opcióval.

source: To enable lightmapping support on a CSG mesh, select the root CSG node and choose CSG > Bake Mesh Instance at the top of the 3D editor viewport. Select the generated MeshInstance3D node and choose Mesh > Unwrap UV2 for Lightmap/AO at the top of the 3D editor viewport.
hu: A lightmap támogatás engedélyezhető a CSG mesh-ekhez, ehhez a CSG gyökér node kiválasztása után a CSG > Mesh Példány Égetés opciót kell választani a 3D szerkesztő betekintője fölött. Válassza ki a MeshInstance3D node-ot és használja a Mesh > UV2 Kicsomagolás Lightmap/AO-hoz opciót a 3D szerkesztő betekintője fölött.

source: Lightmap data is not local to the scene.
hu: A lightmap adatok nem lokálisak a jeleneten.

source: Maximum texture size is too small for the lightmap images. While this can be fixed by increasing the maximum texture size, it is recommended you split the scene into more objects instead.
hu: A maximális textúra méret túl kicsi a lightmap képekhez. Bár ez javítható a maximális textúra méret növelésével, javasolt inkább a jelenetet több objektumra osztani.

source: Failed creating lightmap images. Make sure all meshes to bake have the Lightmap Size Hint property set high enough, and the LightmapGI's Texel Scale value is not too low.
hu: A lightmap képek létrehozása sikertelen. Ellenőrizze, hogy az égetéshez használt összes mesh-nek elég magas-e a Lightmap Méret Célja, illetve a LightmapGI Texel Skála értéke nem túl alacsony-e.

source: Failed fitting a lightmap image into an atlas. This should never happen and should be reported.
hu: Egy lightmap kép atlaszba illesztése nem sikerült. Ennek nem szabad megtörténnie és jelenteni szükséges.

source: Bake Lightmaps
hu: Fény Besütése

source: Lightmap baking is not supported on this GPU (%s).
hu: Ezen a GPU-n (%s) nem támogatott a lightmap égetés.

source: Lightmaps cannot be baked on %s.
hu: Lightmap-ek nem égethetőek ezen: %s.

source: Lightmaps cannot be baked, as the `lightmapper_rd` module was disabled at compile-time.
hu: Lightmap-ek nem égethetőek, mert a `lightmapper_rd` modult letiltották a szoftverváltozat készítésekor.

source: LightMap Bake
hu: LightMap Égetés

source: Couldn't create a Trimesh collision shape.
hu: TriMesh ütközési alakzatának létrehozása sikertelen.

source: Couldn't create any collision shapes.
hu: Nem sikerült ütközési alakzatokat létrehozni.

source: Create %s Static Body Child
hu: %s Statikus Test Gyermek Létrehozása

source: Create %s Static Body Children
hu: %s Statikus Test Gyermekek Létrehozása

source: Bounding Box
hu: Befoglaló Doboz

source: Capsule
hu: Kapszula

source: Cylinder
hu: Cilinder

source: Sphere
hu: Gömb

source: Mesh is empty!
hu: A háló üres!

source: Mesh cannot unwrap UVs because it belongs to another resource which was imported from another file type. Make it unique first.
hu: A mesh nem tudja kicsomagolni az UV-ket, mert másik erőforráshoz tartozik, amely más fájltípusból volt importálva. Tegye először egyedivé.

source: Unwrap UV2
hu: UV2 Kicsomagolása

source: Contained Mesh is not of type ArrayMesh.
hu: A tartalmazott Mesh nem ArrayMesh típusú.

source: Only triangles are supported for lightmap unwrap.
hu: Lightmap kicsomagoláshoz csak a háromszögek támogatottak.

source: Normals are required for lightmap unwrap.
hu: Lightmap kicsomagoláshoz normálokra van szükség.

source: UV Unwrap failed, mesh may not be manifold?
hu: UV kibontás sikertelen, a mesh talán nem sokrétű?

source: No mesh to debug.
hu: Nincs mesh a hibakereséshez.

source: Create Navigation Mesh
hu: Navigációs Háló Létrehozása

source: Create Outline
hu: Körvonal Készítése

source: Create Outline Mesh...
hu: Körvonalháló Létrehozása...

source: Creates a static outline mesh. The outline mesh will have its normals flipped automatically. This can be used instead of the StandardMaterial Grow property when using that property isn't possible.
hu: Statikus körvonal mesh-t hoz létre. A körvonal mesh normáljai automatikusan tükröződnek. Ez a StandardMaterial Növesztés tulajdonsága helyett használható, amikor az a tulajdonság nem elérhető.

source: View UV1
hu: UV1 Megtekintése

source: View UV2
hu: UV2 Megtekintése

source: Unwrap UV2 for Lightmap/AO
hu: UV2 Kicsomagolása Fénytérképhez / AO-hoz

source: Create Outline Mesh
hu: Körvonalháló Készítése

source: Outline Size:
hu: Körvonal Mérete:

source: Static Body Child
hu: Statikus Test Gyermek

source: Creates a StaticBody3D as child and assigns collision shapes to it.
hu: StaticBody3D gyermeket hoz létre és ütközési alakokat rendel hozzá.

source: Creates a polygon-based collision shape. This is the most accurate (but slowest) option for collision detection.
hu: Sokszög-alapú ütközési alakzatot hoz létre. Ez a legpontosabb (de leglassabb) opció az ütközések érzékeléséhez.

source: Creates a single convex collision shape. This is the faster than the trimesh or multiple convex option, but is less accurate for collision detection.
hu: Egyetlen konvex ütközési alakzatot hoz létre. Ez a trimesh vagy többszörös konvex opcióknál gyorsabb, de kevésbé pontos az ütközések érzékelésénél.

source: Creates a simplified convex collision shape. This is similar to single collision shape, but can result in a simpler geometry in some cases, at the cost of accuracy.
hu: Egyszerűsített konvex ütközési alakzatot hoz létre. Ez hasonló az egyetlen konvex ütközési alakzathoz, de bizonyos esetekben egyszerűbb geometriához vezethet némi pontosság feláldozása árán.

source: Creates multiple convex collision shapes. These are decomposed from the original mesh. This is a performance and accuracy middle-ground between a single convex collision and a polygon-based trimesh collision.
hu: Több konvex ütközési alakzatot hoz létre. Ezek az eredeti mesh visszabontásával készülnek. Ez egy középút a teljesítmény és pontosság, illetve az egyetlen konvex ütközés és sokszög-alapú trimesh ütközés között.

source: Creates an bounding box collision shape. This will use the mesh's AABB if the shape is not a built-in BoxMesh. This is faster than the convex collision shape option for collision detection.
hu: Befoglaló doboz ütközési alakzatot hoz létre. Ez a mesh AABB tulajdonságát használja, ha a mesh-nek nincs beépített BoxMesh-e. Ütközésérzékeléshez gyorsabb, mint a konvex ütközési alakzat opció.

source: Creates a capsule collision shape. This will use the mesh's AABB if the shape is not a built-in CapsuleMesh. This is faster than the convex collision shape option for collision detection.
hu: Kapszula ütközési alakzatot hoz létre. Ez a mesh AABB tulajdonságát használja, ha a mesh-nek nincs beépített CapsuleMesh-e. Ütközésérzékeléshez gyorsabb, mint a konvex ütközési alakzat opció.

source: Creates a cylinder collision shape. This will use the mesh's AABB if the shape is not a built-in CylinderMesh. This is faster than the convex collision shape option for collision detection.
hu: Cilinder ütközési alakzatot hoz létre. Ez a mesh AABB tulajdonságát használja, ha a mesh-nek nincs beépített CylinderMesh-e. Ütközésérzékeléshez gyorsabb, mint a konvex ütközési alakzat opció.

source: Creates a sphere collision shape. This will use the mesh's AABB if the shape is not a built-in SphereMesh. This is faster than the convex collision shape option for collision detection.
hu: Gömb ütközési alakzatot hoz létre. Ez a mesh AABB tulajdonságát használja, ha a mesh-nek nincs beépített SphereMesh-e. Ütközésérzékeléshez gyorsabb, mint a konvex ütközési alakzat opció.
